[
    "Do they offer good portion sizes?",
    "What type of breakfast do they serve?",
    "What about the wifi?",
    "Does Cityroomz have clean bathrooms?",
    "Are they known for good service?",
    "Does the hotel have big rooms?",
    "Does it have a nice view?",
    "Can you tell me about their breakfast options?",
    "Can you confirm whether Curry Prince offers plentiful serving portions?",
    "Does it have a good selection of non-alcoholic drinks for people who are 21 and under?",
    "Does this restaurant serve alcohol?",
    "I'm looking for a place with great service. Any idea what kind of reviews their service has received?",
    "How would you rate the bang for the buck there?",
    "Could you tell me how large the room is there please?",
    "Is the restaurant in a highly accessible area?",
    "Will you tell me if they Alpha-Milton offers clean rooms?",
    "Is it recognized for quality Beef Wellington? I want to find a place that is.",
    "Does the hotel offer free breakfast?",
    "Will it have a good breakfast?",
    "Does this location have a pleasant interior decor?",
    "What can you tell me about their TANDOORI CHICKEN?  Is it affordably priced?",
    "Is there a good view from Oak Bistro?",
    "What is included with the room?",
    "Do you know if it has various non-alcoholic drink options?",
    "Can you also make sure that the staff is friendly?",
    "Do they have nice outdoor dining?",
    "Is the hotel close to other popular areas?",
    "I need to work. Is their wifi strong and reliable?",
    "Is this hotel a good value for the price?",
    "Does it have a comfortable bed?",
    "Are they know for any eye catching designs and good atmospheres?",
    "Do they charge for wifi?",
    "Can you let me know whether Little Seoul offers nice views to look at?",
    "Is it decorated nicely?",
    "Does this restaurant serve alcohol?",
    "How is the view?",
    "Is the hotel a quiet place?",
    "Do they have good portions of food?",
    "Is the staff there friendly?",
    "Does the hotel provide good value for the money spent?",
    "Will I be able to access the Internet reliably there?",
    "Maybe, what can you tell me about their portion sizes?",
    "Does it have a friendly staff?",
    "Do they have a location that's pleasant inside?",
    "Are the staff at Alexander Bed and Breakfast friendly and accommodating?",
    "Do they have a pleasant interior?",
    "Does loch frye have an affordable grilled lobster meal on the menu?",
    "Does a and b keep a high standard in room cleaning?",
    "Does the aylesbray have sanitary restrooms?",
    "Is there a variety of good breakfast options here?",
    "Are they known to have friendly staff and offer good service ?",
    "Can you tell me if they're well known for their value for the money?",
    "Do you know how trained and good the staff is?",
    "Is the internet reliable for business maters?",
    "What about alcohol service, do they offer that?",
    "Do they have a good selection of non-alcoholic drinks?",
    "Do they have a good selection of non-alcoholic drinks?",
    "Do they have really good mattresses there to sleep on?",
    "Is the area known for being quiet?",
    "Is the location conviennt?",
    "Yes, does the Lovell Lodge offer free breakfast?",
    "Are they known for large portions?",
    "Which one of them provides the best value for the money?",
    "Is that a good location?",
    "Do they have great breakfast options?",
    "Do they have really sanitary restrooms there?",
    "Is this located in a place that is relatively quiet?",
    "Does it have a nice atmosphere?",
    "Can you confirm for me that Warkworth House has clean rooms?",
    "Is it cheap for what is offered?",
    "Is the area preferred by others?",
    "Does the Huntington Marriott have large rooms?",
    "Is Hobsons House in a quiet location?",
    "Can you check on the condition of the rooms because I want one that is really clean?",
    "Are the interior decorations at the Missing Sock seen are being appealing?",
    "Do you know if Ali Baba serves top notch Kafta?",
    "Can you tell me if they have large size rooms?",
    "Do they have a relaxing vibe and atmosphere?",
    "How well known is their chaat?",
    "How is the atmosphere there?",
    "can you make sure that they are very clean?",
    "Do they have outdoor seating?",
    "Please choose the one with the nicest scenery.",
    "Is the staff friendly?",
    "Are the views good from the restaurant?",
    "Is it kept thoroughly cleaned?",
    "Is the location nice?",
    "Will they let us eat outside",
    "Does this hotel have staff that are very nice?",
    "Is it a great value for the area?",
    "Do they have attractive interior decorations here?",
    "Is the staff friendly?",
    "Does it offer a good selection of non-alcoholic drinks?",
    "Can you tell me if the rooms there are big?",
    "Do the reviews mention anything about the decorations?",
    "Do they have big rooms here?",
    "Do they have great service there?",
    "Do the rooms have a lot of space?",
    "Can you tell me how good the Wi-Fi is at Acorn Guest House?",
    "Are the bathrooms clean at the University Arms Hotel?",
    "Do you know if the Ashley Hotel offers its customers clean bathrooms?",
    "Is the interior of the restaurant nicely decorated?",
    "Is the indoor decor nice?",
    "Does this restaurant have a top notch atmosphere?",
    "Do they have a stable internet connection?",
    "Can you tell me about the beds at the Acorn? I need a comfortable mattress for my bad back.",
    "Does it have a nice place to eat outdoors?",
    "Does it have stable internet connection?",
    "Are the portions large there? We're starving.",
    "Which of these are in nice locations?",
    "Is the place convenient and accessible location wise?",
    "I'm looking for  a place with a popular scrambled eggs with tomatoes.",
    "Does the Alexander Bed and Breakfast charge guests a fee for using the WiFi?",
    "Do they have a nice outdoor area?",
    "Can I see through the windows of this restaurant?",
    "I hate dirt, so are these bathrooms cleaned regularly?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Yes, can you check whether they keep the bathrooms there clean?",
    "Stable internet is needed, does this have that?",
    "Can you make sure I get a room in the quiet section of the hotel?",
    "Can you check customer reviews to see if this hotel is moderately priced compared to other hotels in the area?",
    "Is it known to be a good deal?",
    "Do you get a lot of food here?",
    "Do they have a nice interior decor?",
    "Do you know a place with a good location?",
    "Does it have nice indoor decor?",
    "Does it serve various non-alcoholic drink options?",
    "Is the breakfast known for quality?",
    "How is the atmosphere there?",
    "Do they mention having clean bathrooms?",
    "Does it offer extra large rooms or suite rooms?",
    "Yes, do they offer good service while I eat?",
    "Are the beds comfortable there?",
    "The Allenbelle Guesthouse has friendly employees right?",
    "Are they centrally located?",
    "Wonderful can you tell me if they offer a Full English Breakfast?",
    "Does Kohinoor serve various non-alcoholic drink options?",
    "Do they have a nice mocktail menu?",
    "Would you please verify that they have friendly staff members?",
    "Does this place have pretty good value for the cost?",
    "Are their bathrooms clean and spotless?",
    "Is the room centrally located?",
    "Do you know if the Cambridge Belfry has comfortable beds?  I want to sleep well.",
    "Does it present a decent value?",
    "What kind of drink options do they have for sober people?",
    "Does Ali Baba have a nice outdoor seating area?",
    "Is the indoor nice?",
    "If they have good internet, sure. I need one that is reliable so I can attend to personal and business matters.",
    "I'm going to need a steady internet connection during my stay. Will that be a problem?",
    "Does this restaurant serve alcohol?",
    "Can you tell me if they have great service?",
    "Does it have a nice area for outdoor dining?",
    "How's the atmosphere rated at Cotto?",
    "Does it have a nice view?",
    "Do they offer a high-quality Meatloaf on their menu?",
    "Are there large rooms available at the acorn guest house?",
    "Does the hotel offer Continental breakfast?",
    "Does it have a clean room?",
    "Does it have a good breakfast selection?",
    "Is their sweet and sour pork well known?",
    "I'd also like to know if it is quiet.",
    "Before you make a reservation, can you check about the cleanliness of their guestrooms?",
    "It it easily accessible?",
    "I am hoping for a nice view. How does the Pizza Express measure up?",
    "Is its neighborhood safe and easy to get to?",
    "What is the internet service there like as I need to have a reliable connection?",
    "Does Curry Garden have great service?",
    "is the view is nice",
    "Do they have a nice atmosphere?",
    "Would you say they offer a lot for the money you pay?",
    "No, can you tell me if Avalon has high ratings for clean bathrooms?",
    "Does Ask Restaurant have nice interior décor?",
    "How quiet is the area surrounding the hotel?",
    "Is this place considered a good value?",
    "Does it have an attractive interior?",
    "How about the bathroom? Is it clean?",
    "Sure, but one more question first; is this area good for bargains?",
    "Does it have a large room?",
    "Are the beds comfortable?",
    "Are the beds comfortable?",
    "Is the staff nice and friendly?",
    "Does the Grafton have a good atmosphere?",
    "Is it quiet over there?",
    "Do they offer good service?",
    "Which of the two places serves a good portion of food?",
    "Does it have nice indoor decor?",
    "Only if they have clean rooms and clean bathrooms.",
    "Is the location nice?",
    "What kind of drinks are offered?",
    "Is The Cambridge Belfry location at a good location?",
    "Does this hotel have a good wifi connection?",
    "Will I feel full after I eat there?",
    "Do they serve alcohol to patrons?",
    "Does the restaurant have nice decorations?",
    "Is the HOliday Inn Cambridge a good value? What are the prices to stay there?",
    "Sure, but do they have a nice view?",
    "Is the bed comfortable?",
    "How good are their portions?",
    "Are the beds there comfortable?",
    "How is the staff in this hotel, any complaints?",
    "Could I also trouble you to answer if this restaurant serves alcohol?",
    "Does it have a good feeling atmosphere?",
    "Would you say the price of the room is a good value?",
    "Is the service there any good?",
    "Is the Acorn's housekeeping scrupulous about details?",
    "Do they charge for wifi?",
    "Do they have high quality Pierogi?",
    "Does it have comfortable beds?",
    "Do they have a nice view?",
    "Is it inexpensive?",
    "Can you tell me if they are known for having clean bathrooms?",
    "which one has the most comfortable beds?",
    "Can you first tell me what their portion sizes are like because I want huge portions of food?",
    "Does the restaurant have a nice view from the dining area?",
    "Do they have a good portion of food?",
    "Does it have nice indoor decor?",
    "Would you please verify that they have good breakfast options?",
    "Is the Hot Pot good here?",
    "I'll be working during my stay. Do they have a strong internet connection?",
    "Can you make sure it's a large room?",
    "Are the rooms large and comfortable?",
    "I want a large room so can you tell me the size of their rooms?",
    "Could you tell me whether the Lucky Star is beautifully decorated?",
    "Probably, is this a fun place with an upbeat atmosphere? I don't want anything too stuffy.",
    "Yes, does it have a big room?",
    "Does it have nice indoor decor?",
    "Is the staff at the front desk friendly?",
    "Does the hotel charge a fee for wifi?",
    "What about the internet, is it a stable connection?",
    "Could you confirm that Nandos serves good portion sizes, please?",
    "Would you know if The Curry Garden serves good portion sizes?",
    "Is this hotel known for its value?",
    "I need a restaurant with a great view.",
    "Does it have nice indoor decor?",
    "Is it a value?",
    "Is the Chiquito restaurant in a place with nice views or scenery?",
    "Is the wifi good?",
    "I don't wanna have to walk very far to get to the restaurant and also is the royal standard in a pretty good neighborhood?",
    "Are the portions big?",
    "Is Bedouin known for having a great staff and service?",
    "Does the Bedouin have very good service?",
    "Do they serve large portions?",
    "Are the bathrooms in good clean condition?",
    "What do the reviews say about their restrooms?",
    "Will I be able to enjoy my food outside while I eat at this restaurant?",
    "Do they have Clean restrooms?",
    "Yes, I would like to know if Curry Garden serves alcohol?",
    "Is that in a good location?",
    "Do you know if it has various non-alcoholic drink options?",
    "Does it have a nice outdoor dining area",
    "Between the southern and central location, which one offers better views?",
    "Does this hotel have complimentary WiFi?",
    "Do you know if it has a nice outdoor place for dining?",
    "Does it have good food portions?",
    "Is the place stunning?",
    "Can you find out if this hotel has reliable internet connections?",
    "Tell me if the reviews say it is fun and welcoming there.",
    "How are the reviews regarding the sweet and sour pork at Golden Wok?",
    "Are the rooms cleaned routinely and thoroughly?",
    "How large are the rooms there?",
    "Can you tell me if Hakka is in a safe neighborhood that's a short distance to other area attractions?",
    "Can you tell me whether the Allenbell is in a good location in town?",
    "Does this hotel have friendly staff?",
    "Does the place have a nice relaxing vibe and atmosphere?",
    "I want to make sure that I get rest. Is the place quiet or in a noisy area?",
    "Which of the restaurants do you recommend that has a nice relaxing vibe and atmosphere?",
    "Do they serve high quality Samosas?",
    "Does it have comfortable beds?",
    "How much does the Hamilton Lodge charge for WiFi?",
    "Can you verify that it will have a very clean bathroom?",
    "Is the staff friendly?",
    "Do they have a pleasant atmosphere?",
    "Are there big rooms available?",
    "I can only sleep where it's quiet - does the El Shaddai have a lot of noise?",
    "Is the hotel in a popular area?",
    "Do they offer large platter portions?",
    "Are the rooms large?",
    "Do the rooms have a lot of space?",
    "Does the restaurant have a good view or not?",
    "Does this place have big rooms?",
    "Is the internet connection there strong and stable?",
    "Does the restaurant offer outdoor seating?",
    "Can you confirm that the Internet connection at the Acorn Guest House is strong and reliable?",
    "Is the Gourmet Burger Kitchen known for having good service?",
    "Do you know if it has various non-alcoholic drink options?",
    "How friendly is the staff?",
    "Yes, do they serve a full English breakfast for cheap?",
    "What does it say about the beds, do they have comfortable mattresses?",
    "Are their prices reasonable, and what are their reviews like?",
    "What is the atmosphere like in Curry Prince?",
    "Does this hotel offer a lot for the price?",
    "Can you tell me if they have good service or not?",
    "Is that going to be a good deal?",
    "Do they have friendly staff?",
    "Does the Golden Wok offer nice views from the windows of the restaurant?",
    "Is the web connection there nice?",
    "Do they have good ratings for staff friendliness?",
    "It is a good dining place with a good atmosphere?",
    "First can you tell me if the Autumn house has a friendly staff?",
    "Can they ensure my room will be silent?",
    "Can you tell me if the rooms are spacious?",
    "How are the acoustics and the atmosphere there?",
    "Can you first tell me if Prezzo has a great selection of nonalcoholic drinks to choose from?",
    "Are the food portions good?",
    "Is it a good value for the money?",
    "It sounds good if their room is big.",
    "Do they have a lot of options for breakfast?",
    "Does it offer a really good value for money that I will spend?",
    "Are the rooms thoroughly cleaned?",
    "Is De Luca Cucina and Bar or Riverside Brasserie a better value for the money?",
    "Do they have great service there?",
    "Does Thanh Binh have a pleasant view from its dining area?",
    "Are the rooms a good value for the price?",
    "Are there comfortable beds there?",
    "Which one has a nice view?",
    "Yes do they offer on site breakfast or room service?",
    "Is the hotel easily accessible?",
    "Do they have new comfy mattresses in their rooms?",
    "Do they have good breakfast options?",
    "Does The Slug and Lettuce serve alcohol?",
    "Does the restaurant serve alcohol?",
    "Is it good value for the rate?",
    "Can you confirm that is a good location?",
    "Is there outdoor seating there?",
    "Does Little Seoul serve large portion sizes?",
    "I need to know if this place serves alcohol please?",
    "Does Cote offer a good view of the city?",
    "Is there a good atmosphere at Hakka?",
    "Does this restaurant serve alcohol?",
    "Does this place have decent value for my money?",
    "Does the Royal Spice Restaurant have high ratings on its butter chicken?",
    "What is the ambiance like there? Nice atmosphere matters to me.",
    "Can you tell me if they're well known for their value for the money?",
    "Is the Ashley Hotel considered a good value stay?",
    "Is the hotel known for its comfortable beds so I can get a great night's sleep?",
    "Are the rooms cleaned routinely and thoroughly?",
    "Does it offer a nice view of the city?",
    "Do they have a strong internet connection there so I can do my work from my room?",
    "Are the beds there comfortable enough to sleep soundly?",
    "Do they have pretty indoor decor?",
    "Do you know if it has great service?",
    "Can you tell me if it's worth the price?",
    "Is the view nice?",
    "Do they have non-alcoholic drink options?",
    "Can you tell me anything about the view as I like to dine with a nice view?",
    "Does Ugly Duckling serve high quality Hot Pot at a good value?",
    "Are the rooms clean?",
    "Could you reccomend a place that does not serve alcohol?",
    "Is this a place that has a friendly staff?",
    "Is this location known for having rooms that have been thoroughly cleaned?",
    "Do they serve alcohol",
    "Do they have a few non alcoholic drink options?",
    "What are the ratings of  the Worth House's cleanliness of their bathrooms?",
    "Is the bed there comfortable?",
    "Is this in a convenient location?",
    "As a major requirement, are their staffs accommodating and pleasant ?",
    "Is the atmosphere very high quality?",
    "Does Curry Garden serve freshly sourced Dosa?",
    "One more thing. Does the guesthouse have a stable Internet connection?",
    "Thank you. Is there a fee for Wifi at this hotel?",
    "Can you check and see if the staff gets positive ratings from customers?",
    "Do they offer great service?",
    "Is the staff friendly?",
    "Do they have good portion of foods?",
    "Is the centre of town a good location for a hotel room?",
    "Do they have a good non alcoholic drink menu?",
    "Could you confirm for me that the Aylesbury's staff are both accommodating and pleasant?",
    "Does it have nice indoor decor?",
    "Are there good choices for breakfast there?",
    "Is it in a location others like?",
    "Can I get the best pizza at Stazione Restaurant and Coffee Bar?",
    "Is the service great?",
    "Are they located in a quiet area?",
    "Are there rooms there very big?",
    "Do they have a good view?",
    "Is there outdoor seating here?",
    "Is this close to the museums and shops?",
    "Does this location offer good breakfast options?",
    "Do they offer great service?",
    "Do they have various non-alcoholic drink at Tandoori Palace?",
    "Does Frankie and Benny's offer great service?",
    "Would you consider this hotel to be a good value?",
    "Are the staff friendly? That really helps make a stay better.",
    "Could you make sure the room of the hotel is spotless?",
    "Do they have a pleasant, welcoming atmosphere?",
    "Would you consider the University Arms Hotel to be in a good location?",
    "Do they have great service?",
    "Do they serve alcohol there at Tak Tandoori?",
    "Do you know if it has a good portion of foods?",
    "Yes but can you make sure they have outdoor seating available?",
    "Is this in a safe neighborhood, located near other attractions?",
    "Does it have a good atmosphere?",
    "What views can you see from the restaurant?",
    "Do you know if El Shaddai is a quiet place to stay?",
    "Is this establishment considered a good value for my money?",
    "Is it decorated nicely?",
    "Is it considered a great value for the price?",
    "Do they have nice indoor decoration?",
    "Do you know if it's a quiet place to stay?",
    "Does the Gandhi employ responsive and friendly staff?",
    "How spacious are the rooms?",
    "Which one offers the best breakfast selection?",
    "Can you tell me what the atmosphere is like at the Meze Bar Restaurant?",
    "Are they known for their arancini?",
    "Does this hotel pack a good bang for your buck?",
    "Are these beds comfortable?",
    "Is it a quiet place to stay?",
    "Does it have outdated or gaudy indoor decor?",
    "Does worth house have a highly-rated breakfast menu?",
    "Does the business have a good feeling atmosphere?",
    "Do they have outdoor dining too?",
    "Will there be something interesting to look at through the window there?",
    "Do they provide great service?",
    "Can you tell me if the place is decorated very nicely?",
    "Does this place have an accommodating and pleasant staff working for it?",
    "Is the hotel known for their cleanliness?",
    "Is Bedouin highly rated for serving large food portions?",
    "How comfortable bed are the beds?",
    "Does this place have nice indoor decor?",
    "I'm really interested in a reasonably priced CAPRESE SALAD.",
    "Does it have good atmosphere?",
    "Yes, is that address in a crime-free location, and is it convenient to things to do and see?",
    "Do you know if it has a nice location?",
    "Is Prezzo decorated very nicely?",
    "Do they have decent food portions?",
    "Do they have great service?",
    "Are nonalcoholic drinks served at Curry Prince?",
    "Does it offer reliable internet?",
    "Are the beds extra comfy?",
    "Is this place quiet?",
    "How are the breakfast options there?",
    "Does the hotel have large rooms?",
    "How clean are the restrooms?",
    "Is the room large?",
    "Is the staff here friendly, polite, and responsive?",
    "Does Acorn Guesthouse serve a full English breakfast?",
    "Does it have a clean bathroom?",
    "Please, could you just check whether the Lensfield provides wi-fi for guests?",
    "Does the place come with a comfortable bed?",
    "Does it have a nice view?",
    "Does Prezzo have a warm atmosphere? I'd love to find a nice, relaxing place like that.",
    "Is there an extensive menu of non-alcoholic drinks?",
    "Do you know if the bed and mattress are comfortable there?",
    "Great. Will I get other good values for my money in addition to free parking?",
    "How pleasant is the outdoor dining experience?",
    "If they offer it, what do they serve for breakfast?",
    "Is the Internet reliable? I'm a businessman so I need to check my email and take a Zoom meeting.",
    "Is place a good value for the money?",
    "Does the Autumn House have clean bathrooms?",
    "i heard that, the working peoples are very nice there, it is the fact? Please tell",
    "Is the staff friendly there?",
    "Is it in a good location?",
    "Does university arms offer decent value for the cost?",
    "Do they have good mattresses?",
    "I'm looking for a restaurant that has beautiful decorations. Does the restaurant have that?",
    "Is the hotel in a good location?",
    "do they have a wide variety of non alcoholic drinks?",
    "Is the restaurant in a safe neighborhood and within a short distance to other area attractions?",
    "Is there good menu options for breakfast there?",
    "Do they have friendly staff?",
    "Does it have a variety of good breakfast options?",
    "Do they have good service?",
    "Does it have great service?",
    "How's the WIFI stability at Acorn Guest House?",
    "Do they offer great service?",
    "Do they have a friendly atmosphere?",
    "Is the room a good value?",
    "Do they have an attractive patio where I can eat outside?",
    "I just need to know if they have clean bathroom so can you tell me anything about that?",
    "Do you know if Tang Chinese have nice views from its restaurant?",
    "Are the bathrooms clean?",
    "Yes. Is the staff friendly there?",
    "Does this hotel have clean restrooms?",
    "Could you tell me if they serve adult drinks?",
    "Is the staff friendly and polite?",
    "Do they have outdoor seating available there?",
    "Does this hotel serve a nice breakfast?",
    "Are the staff nice to the guests?",
    "Does the restaurant offer tables with a nice view?",
    "Do you know if it has various non-alcoholic drink options?",
    "Does the internet have good uptime?",
    "Does this restaurant serve alcohol?",
    "Can I expect the room to be nice and quiet?",
    "do the rooms have cozy beds?",
    "Is this a place with very clean rooms?",
    "Will I be pleased with this restaurant's location?",
    "I would really like a place with a good atmosphere so can you tell me anything about that?",
    "Does the restaurant have friendly and responsive staff?",
    "Does it have a nice view?",
    "I want to stay in a very clean place. Do you know if they have their rooms thoroughly cleaned there?",
    "Do they always clean the bathrooms on time?",
    "Does Rice House have really very good service for your dining experience?",
    "Does the table have a nice view?",
    "Is this hotel in a good location?",
    "How big is the room there?",
    "Before I do, do they have nice indoor decor?",
    "Is it in a good location for shopping and sightseeing?",
    "Is there a reliable internet connection there?",
    "It'd be nice if we could eat outside too",
    "Does the staff welcome you?",
    "Do you know if it has a nice view?",
    "Do they have nice indoor decor?",
    "Is alcohol served at the Gardenia?",
    "Do they have a friendly atmosphere?",
    "Are the people that work at the hotel nice?",
    "Do they have a stable internet connection?",
    "Is it in a nice location?",
    "Is the Oak Bistro in a good neighborhood in the center and easy to get to?",
    "I'm a clean freak, do they have a clean bathroom?",
    "Do they have good and friend stuff",
    "Am I likely to have any issues accessing the Internet?",
    "Is this hotel in a good and accessible location?",
    "I don't drink so can you find out if they have a good selection of non-alcoholic drinks?",
    "Does this room have a lot of space?",
    "Does this hotel have a comfortable bed for a good sleep?",
    "Does this restaurant offer nice views?",
    "Do they have a few non alcoholic drink options?",
    "Are the rooms big here?",
    "Are there attractive interior decorations here?",
    "How clean are the bathrooms at the University Arms?",
    "Is it close to things to do?",
    "Are the bathrooms dirty?",
    "Do they mention having a friendly staff?",
    "Do they have a solid internet connection?",
    "Is it centrally located?",
    "Do they have safe and comfortable outdoor dining?",
    "Do they have clean bathrooms?",
    "Is there a friendly staff at this hotel?",
    "Is the room value for money?",
    "How good is their service?",
    "Do they have an exciting and unique interior decor?",
    "I want to check that the B and B is in a good lcoation, close to amenities?",
    "can you tell me if the surrounding area is calm and quiet?",
    "Do they have non alcoholic drinks like tea and soda?",
    "How appealing are the decorations?",
    "Does carolina bed and breakfasts employ nice people?",
    "Does the hotel have clean rooms?",
    "I meant to ask about the size of guest rooms. Will I have plenty of space there?",
    "Are their bathrooms adequately sanitized?",
    "Do they have nice beds? It must be comfortable.",
    "Do they have outdoor seating available?",
    "Is the service here fair and exceptional?",
    "Do they have lots of good breakfast options there?",
    "Do the rooms have comfortable beds in them?",
    "Is Home from Home accessible and centrally located?",
    "Do they have many choices of non-alcoholic drinks?",
    "How about their hotel staffs, are they warm and welcoming?",
    "I would really like it if the rooms are large. Are they?",
    "Do they serve alcohol everyday at this restaurant?",
    "Do they provide breakfast options for the guests?",
    "Do you have any information on the quality of the service?",
    "Do you know if The Gardenia offers a nice outdoor seating area?",
    "Is the Avalon a quiet guesthouse?",
    "Do they serve alcohol at that restaurant?",
    "Does the Lensfield Hotel give the guests Italian breakfast?",
    "Is the internet connection there stable?",
    "Does it have a good area for outdoor dining?",
    "What are their prices like?  I'm looking for something affordable.",
    "Is this restaurant known for it's friendly wait staff?",
    "Is the guesthouse known for its bathroom cleanliness?",
    "What is their selection of non-alcoholic drinks like?",
    "Can you see if they have a good atmosphere there?",
    "Does this place have a good atmosphere?",
    "Is the hotel at a noise free area?",
    "Do they serve continental breakfast?",
    "Is it in a nice location?",
    "Do they have good portion sizes?",
    "Does this location offer a top notch Doner Kebab?",
    "Will they load up my plate with food?",
    "Is the staff notorious for being good?",
    "I want more information on this hotel. Do you know if they have sanitary restrooms there?",
    "Is thag the best value for its price?",
    "Does that hotel has a big room?",
    "Does the guesthouse serve a full breakfast with eggs, toast, and coffee?",
    "Is Cityroomz located in a good place?",
    "Would you consider that to be a good value guest house?",
    "Do they have good nonalcoholic drinks?",
    "How good is the service?",
    "Are their rooms clean?",
    "Is the location nice?",
    "Does it have strong internet connection?",
    "Do they have a nice mocktail menu",
    "Do you know if Hobsons House has excellent Wi-Fi?",
    "Is the hotel in a quiet area?",
    "Do they serve a reasonably priced pizza?",
    "Are they known for their service?",
    "Does it have a nice view?",
    "Does that restaurant have a good atmosphere?",
    "Is it a good value?",
    "Can you tell me if the Bridge Guest House would give me a decent value for the price?",
    "Is this hotel a good value for the price?",
    "Does Saigon City serve a good dish of scrambled eggs with tomatoes without requiring that customers spend a lot?",
    "Can you tell me whether the Ashley Hotel will give me a great value for the price?",
    "Are the restrooms cleaned frequently?",
    "Does this hotel offer free WiFi?",
    "Is Autumn house in a good location?",
    "Does the Acorn Guest House provide a quality breakfast?",
    "Do they serve healthy portions here?",
    "Is the area around the Acorn Guest House nice?",
    "Is that In a nice location?",
    "Is the hotel economical?",
    "is this house close to the center of town?",
    "does the restaurant serve alcohol ?",
    "Do their rooms have a lot of space for my family?",
    "Is it really a good value for the money?",
    "Do either of them have nice indoor decor?",
    "Do you know if Cote's location is close by to other activities and sights I can see?",
    "Does HK Fusion serve alcohol?",
    "First can you tell me if they have a nice place for dining outside?",
    "What are the breakfast options for the Warkworth hotel?",
    "How is the selection of non-alcoholic drinks?",
    "Do they have clean bathrooms?",
    "Are there rules for guests in usage of the bathroom and how often does the staff clean the restrooms?",
    "Are the portions larger than average?",
    "Does Yu Garden have outdoor seating, I'd prefer that if it does.",
    "Can you let me know if they provide complimentary wi-fi for hotel guests?",
    "Can you also see if the reviews mention anything about portion sizes?",
    "Are there a good variety of breakfast options here?",
    "Do you know if it has a good portion of foods?",
    "Do they mention having spotless and pristine rooms?",
    "Do they have a nice view we can enjoy?",
    "Are the beds at this location known for being particularly comfortable?",
    "Do they serve alcohol at Curry Garden?",
    "Do they have a variety of non-alcoholic drinks?",
    "Is the bed soft and comfortable?",
    "How quiet is the hotel?",
    "Is Worth House located in a convenient area?",
    "I'm looking for a place that has reasonably-priced Eton Mess. Does the Copper Kettle have it?",
    "Do they have relaxing beds?",
    "Yes, is the seating only indoors or not?",
    "Can you make sure they have clean rooms please?",
    "Is the view appealing here?",
    "Does the Worth House have a professional, friendly staff?",
    "Does this restaurant have a nice area to eat outside at?",
    "Do you know if the Cambridge Belfry is a quiet place to stay?",
    "Does this hotel offer great value?",
    "Are the rooms dirty there?",
    "Are there good non alcoholic beverages?",
    "Does this place have a great atmosphere?",
    "Would you please verify that they'll have a nice, clean bathroom?",
    "Are the rooms clean?",
    "Is this location generally convenient?",
    "Does the hotel offer free WiFi?",
    "Do they have a good selection of alcoholic and non alcoholic drinks?",
    "Is it near other attractions, shops, restaurants or transportation?",
    "Is the decor modern and up to date?",
    "Do they offer good value Dosa?",
    "Is it quiet?",
    "Is the location centrally located?",
    "I need to get work done. Is the guesthouse too noisey?",
    "Does it have big rooms?",
    "Are the rooms cleaned thoroughly?",
    "Do this hotel offer Irish breakfast?",
    "Does the Aylesbury have comfortable and relaxing beds?",
    "Do they have any pictures of their decor?",
    "Do they have lots of different drinks with no alcohol?",
    "Is the area nice for outdoor dining and seating?",
    "Is the waitstaff known for providing high quality service?",
    "Do they serve alcohol at the restaurant?",
    "Does it have good internet service?",
    "How are the breakfast options there?",
    "Is it quiet there? I'm looking for accommodations somewhere quiet, please.",
    "Is it in an easily accessible area?",
    "Now my second question is do they offer a continental breakfast?",
    "Are the rooms cleaned before I check in?",
    "Do you know if patrons can see nice surroundings from the windows of Kymmoy?",
    "Does that restaurant have a good atmosphere?",
    "And lastly, is the Hamilton Lodge known to be a quiet hotel for its guests?",
    "Is the waitstaff considered exceptional and kindly?",
    "Does the restaurant have a variety of non-alcoholic beverage options?",
    "Is their bathroom kept clean?",
    "Does the room come with a stable internet connection?",
    "First can you tell me if Wagamama has reasonably priced yakitori?",
    "Does it come with a pretty view out the windows?",
    "Can you tell me the average portion size of Curry Prince's meals?",
    "I prefer to dine in a fun environment with an inviting ambiance. Which place meets that criteria?",
    "Do they have outdoor seating?",
    "Do you know if the River Bar and Steakhouse has a good selection of nonalcoholic drinks?",
    "Is the staff welcoming? I would like it more if it is.",
    "Is their staff friendly?",
    "Is this in place which is in a preferred area by others?",
    "Do they have incredible waitstaff?",
    "Is it nearby nightlife and other exciting activities?",
    "Can you confirm that the service is excellent at Restaurant Alimentum?",
    "Does it have beautiful indoor decor?",
    "Is the breakfast high quality?",
    "I need spotless bathrooms, does this place do that?",
    "Does the Dojo Noodle Bar have nice indoor features to look at?",
    "How is the breakfast at this location?",
    "Are the bathrooms clean here?",
    "The most important thing to me is good service, can you find a restaurant like that?",
    "Does GRaffiti have good portion sizes?",
    "Does this place have a calm and quiet environment?",
    "Does the Pizza Hut Cherry Hinton have a decent decor inside?",
    "What amenities are included in the price of the hotel?",
    "Are the bathrooms in the room clean?",
    "Do you know if it has a nice location?",
    "does the guesthouse have accommodating and pleasant staff?",
    "Does it have a good outdoor area for dining?",
    "Yes, not everyone in my group is 21 years old. Will there be a good variety of non-alcoholic drinks on the menu at Bloomsbury Restaurant?",
    "Is the staff there friendly?",
    "Are the samosas a good value?",
    "Does that place have a clean room?",
    "Does Hobson's House have reliable internet that doesn't go down?",
    "Is the staff on hand really friendly?",
    "Does it have good ratings for its large portion sizes?",
    "Are the rooms in this hotel clean?",
    "Does the Marriott offer a good value?",
    "Do they have a nice view?",
    "What rooms at the alyesbray have the most comfortable bed?",
    "Which hotel has a bigger room available?",
    "Is this restaurant in a nice location?",
    "Can you check if the hotel has warm and welcoming staffs?",
    "Do guests have to pay a fee for the wifi?",
    "Does la margherita serve good portions of food?",
    "Yes. How good are their waitstaff?",
    "Do they offer comfortable mattresses in their rooms?",
    "Do they have decent food portions?",
    "Is the view amazing here?",
    "Is the wifi pretty stable?",
    "Have they been highly rated for having large portions of food?",
    "Yes as long as its close enough to attractions",
    "Are the rooms large, while it is just us 2, we still want a big room to accommodate us.",
    "Does the hotel have clean rooms?",
    "Awesome, the bathrooms are pretty clean there though, right?",
    "Is the Gardenia in a decent location of town?",
    "Does this have a good location?",
    "Is the wait staff amazing?",
    "Can you tell me whether the Alpha-Milton Guest House is known for cleanliness?",
    "Is the location a good one for this business?",
    "How big are the rooms at the Alexander Bed and Breakfast?",
    "The rooms at the Acorn Guest House are clean right?",
    "Do they have a variety of breakfast options?",
    "Do they offer a high quality and reasonably priced Risotto?",
    "Could you tell me what the noise level is like there?",
    "Can you tell me if the rooms are spacious?",
    "Can you tell me if I can expect silence there?",
    "I need the internet to be absolutely reliable so can you check on that for me?",
    "Do they serve ravioli at reasonable prices?",
    "Does the place have a nice area for outdoor dining?",
    "Could you let me know whether Panahar serves alcohol?",
    "Does the Cambridge Lodge Restaurant serve large portion sizes?",
    "Do they have clean restrooms?",
    "Are the staff available 24/7?",
    "Is the place nicely decorated?",
    "Is the area in a preferred location?",
    "Is the location nice?",
    "Do they have clean rooms?",
    "Is the internet good?",
    "Is it in a good location in town?",
    "are the breakfast options decent?",
    "Does this restaurant offer a high grade Arancini?",
    "Does J Restaurant have any alcohol there for people?",
    "Does the place come with a clean bathroom?",
    "Yes. I'd prefer a place with great service. Does the Ugly Duckling fit this description?",
    "Are the portions a good size?",
    "Are the beds comfortable there?",
    "Is this place known for well known for plentiful food on the plate?",
    "does this restaurant have a nice area for outdoor dining?",
    "Will the Huntington have a friendly staff available to greet me and assist with problems during my stay?",
    "What can you tell me about the vibe inside as I want something that makes me feel good?",
    "Is the atmosphere there good?",
    "Do they serve a hot breakfast?",
    "Is it a decent value or your money?",
    "Is the Missing Sock nicely decorated, despite being cheap?",
    "Does it have a nice view?",
    "Which one would have best internet for my personal and business needs?",
    "Is the staff friendly and easy to deal with?",
    "Are the beds soft enough to sleep soundly?",
    "I need a place with friendly and desirable staff as well.",
    "Is the bathroom clean?",
    "Does it provide decent value?",
    "Is it in a safe neighborhood within walking distance of other attractions?",
    "Is the interior decorated very nicely?",
    "How is the atmosphere at those locations?",
    "Is the bathroom going to be clean and spotless?",
    "Do they offer good WiFi?",
    "Is the location sight attractive?",
    "Does Charlie Chan have a delicious Yangzhou Fried Rice dish?",
    "Is this place known for it's clean rooms, I need a clean room",
    "Does the restaurant serve alcohol?",
    "Is Yippee in a solid location at least?",
    "How are the breakfast options there?",
    "Do they have decent food portions?",
    "Can you also check whether it has comfortable bed in its rooms?",
    "Can you find out whether guests have to pay for wi-fi access at this hotel?",
    "Is it at least a good value?",
    "Are they highly rated for having reasonable prices?",
    "Do they have great service?",
    "How much souvlaki is one serving there, and how good is it?",
    "Do they have good non-alcoholic options?",
    "Does this restaurant serve alcohol?",
    "Does the Ashley hotel have comfortable beds?",
    "Does Finches bed and breakfast have decent value for what I'll pay?",
    "Can you also make sure its somewhere that mentions having nice employees?",
    "Does their seating offer a nice view?",
    "Do you know if Rajmahal has an incredible waitstaff?",
    "Do they have lots of soft drinks on their menu for teetotalers?",
    "Do they have free WiFi or is there a charge?",
    "Is this place in a quiet area with a calm environment?",
    "Can you confirm whether Autumn House has good WiFi?",
    "Is the place really very good in the service department?",
    "Is the Gonville Hotel known for its kindly staff?",
    "Can you first confirm whether I'll be able to see interesting views through the windows of La Margherita?",
    "Would they have a nice patio or some other kind of outdoor dining feature?",
    "Does it have a good atmosphere?",
    "Does University Arms have good breakfast options?",
    "And does the Golden House offer a lot of food for their meal portions?",
    "Does the place have a big room?",
    "I want to ask about the quality of their caprese salad first.",
    "What is the address of the restaurant?",
    "Do they provide clean and comfortable beds?",
    "Is it in a good location in town?",
    "Does this hotel have clean bathrooms?",
    "Does the Cambridge Belfry offer relaxing beds that give guests a good night's rest?",
    "Is the service great?",
    "Do they provide a stable internet connection?",
    "Is it in a good location?",
    "I can't stay somewhere that doesn't have spotless rooms. Does the housekeeping staff have a reputation for keeping the rooms in pristine condition?",
    "Does it give a lot for what I pay?",
    "Are the people very nice?",
    "Do they offer great service?",
    "Does this restaurant serve quality Vindaloo?",
    "do they have peaceful outdoor dining?",
    "Do they have big rooms?",
    "Does the area have things to do?",
    "Are they a good value for the money?",
    "Do they serve a good portion of food here?",
    "First, could you tell me whether the rooms are clean in the Worth House?",
    "Do they have a nice view?",
    "Is it quiet?",
    "I need the beds to be comfy, are they?",
    "Do they have great service",
    "I need a reliable internet during my stay to take care of my business. Does Alexander B and B have reliable and consistent internet?",
    "I really want to make sure it has alot of amenities, but it needs to be affordable as well.",
    "Are the beds comfortable?",
    "Do they have a stable internet connection there?",
    "Is this in a quiet place?",
    "Does Stazione have an aesthetically pleasing decor?",
    "Please ensure the place need to be clean",
    "Maybe. Does it have high ratings for the cleanliness of the rooms?",
    "Do you know if it has various non-alcoholic drink options?",
    "Is this place in a good location?",
    "Not yet, could you first confirm whether La Tasca has a good location that's close to other sights?",
    "Maybe. Do they serve alcohol?",
    "Is there yummy breakfast?",
    "Wait. Is the bed comfortable there?",
    "Is it located in a quiet area?",
    "Is there a nice view from this restaurant?",
    "Does the River Bar and Steakhouse have a welcoming vibe?",
    "Is the worth guesthouse in a good location?",
    "Are the portions big?",
    "Before you book it, can I get a large room if they have it?",
    "Is it a soft-sounding place to stay?",
    "Does the place have a wide variety of non alcoholic drink options?",
    "Are the beds comfortable for light sleepers?",
    "Does it serve a highly-rated naan?",
    "Do they have a friendly staff?",
    "Are they in a nice location?",
    "Do they have large portion sizes?",
    "Will I be able to sit at a table with a nice view there?",
    "Does it have a nice view?",
    "Do they have a good selection for breakfast?",
    "How's the service at the Slug and Lettuce?",
    "What about breakfast; do they have good options for my morning meal?",
    "Do you know how large the guest rooms are?",
    "Is it in a nice area of town?",
    "How big of a bang for my buck can I get out of the Gonville Hotel?",
    "Are the beds soft?",
    "I need great service. How is the service here?",
    "Do you get your money's worth?",
    "Is the staff there friendly?",
    "Is the hotel in a good location?",
    "Can you tell me if any of these places serve alcohol?",
    "What hotel has the cleanest bathrooms?",
    "Is that a place that is known for having good breakfast options?",
    "Do they serve pierogi there, and is it highly rated?",
    "Can you tell me which one has the best atmosphere?",
    "Does the restaurant serve alcohol?",
    "No thanks, can you check if it is also highly rated for having really clean bathrooms?",
    "Yes, can you check what reviewers say about their service quality, because I prefer nice servers.",
    "Is this hotel a great value for the money?",
    "Can you first tell me if the employees are nice and welcoming?",
    "Do they have large rooms?",
    "Are the decorations nice?",
    "Does Thanh Binh serve freshly sourced spring rolls?",
    "Do they serve alcohol here?",
    "Does the restaurant provide a great staff and service?",
    "Does Wagamama serve an inexpensive Okonomiyaki?",
    "For what I spend, I get a lot correct?",
    "i need a large room , please arrange this",
    "Before you do that, can you tell me if that place is pretty quiet?",
    "Is it low key and quiet?",
    "Oh, before we confirm would you tell me if Slug and Lettuce is know for great service, or not so much?",
    "Before that, do you happen to know which one is known for their great service?",
    "The waitstaff is incredible there right?",
    "Do they have outdoor dining available?",
    "Do you know if it has a nice location?",
    "I need to work my stay, so can you find out if they have reliable strong internet connection there?",
    "Which place has nice view?",
    "Is the are known for being inexpensive?",
    "What does the decor of the restaurant look like?",
    "Do they have a nice area of outer dining?",
    "Can you tell me whether the Alpha-Milton Guest House is known for its helpful, friendly employees?",
    "Does it have nice outdoor dining?",
    "Do they have a good non-alcoholic drink menu?",
    "Are the employees helpful and friendly here?",
    "Is the area proximity good?",
    "Does the Yippee Noodle Bar serve a lot of food?",
    "Do they charge extra to use the wifi at that place?",
    "Is that restaurant located in a nice area?",
    "Is there outdoor seating here?",
    "Is the wifi connection stable?",
    "Sure, but can you first tell me whether Clowns Cafe serves alcohol?",
    "First, I need to know the noise level at the hotel as I need silence during my stay. Does El Shaddai have a reputation of being quiet?",
    "Is there a nice area for eating outside?",
    "Do they have a good selection of non-alcoholic drinks?",
    "Does it have any dirty rooms?",
    "How large are the rooms at the Alexander Bed and Breakfast?",
    "Is the staff considered helpful and friendly at this hotel?",
    "The place has a large room correct?",
    "Do they have good WiFi there?",
    "Is it close to things to do?",
    "Could you confirm for me that the Ashley Hotel's internet connection is solid?",
    "What are the reviews on its service?",
    "Is the staff at Don Pasquale Pizzeria well trained to be friendly, fast and flawless?",
    "Sure, but first can you tell me if Yu Garden is known for the quality of its hot pot?",
    "How friendly are the staff at Acorn Guest House?",
    "Do you know if the Ashley Hotel offers a decent value for what the price is?",
    "Can you tell me if they're highly rated for having meals at reasonable prices?",
    "Are the people who work there going to be friendly?",
    "Are the rooms clean at the Acorn guest house?",
    "Do they have nice indoor decor?",
    "Do they have anything in the way of outdoor dining there, like a patio?",
    "Are the rooms there spacious? I want to be able to spread out.",
    "Is the restaurant accessible?",
    "What are the recent ratings for the hotel for the staff in responding to customers' requests?",
    "Is it a good value for the price?",
    "How often does roomservice clean your room?",
    "Can you run it through and check if it offers a lot for the price people pay?",
    "Is the atmosphere nice?",
    "Are the food portions a good size?",
    "Do they have decent food portions here?",
    "Can you give me more information on their serving sizes first?",
    "Is the bed comftorable?",
    "Do they keep their rooms very clean?",
    "Which place has more friendly staffs?",
    "Is the Curry Prince located in a convenient and accessible part of town?",
    "Does the hotel charge a fee for WiFi?",
    "whether the restaurant has specific ambience?",
    "Does the room have stable wifi connection?",
    "What are the views from a window seat like?",
    "May I check if they have clean bathrooms?",
    "Do they have a strong internet connection?",
    "Is the Restaurant Alimentum located in a safe an accessible area?",
    "Are nonalcoholic drinks on the menu at Pizza Express?",
    "Does the lodging offer decent value for my money?",
    "Does this location offer customers a pleasant view?",
    "Does this restaurant have a nice view?",
    "Can you tell me if the staff are nice and friendly there?",
    "Can they do a fantastic vindaloo?",
    "Are their tapas good?",
    "Is there a good breakfast selection there?",
    "what portion size did you prefer ?",
    "Can you reassure me that this is a good location?",
    "Does it mention anything about cleanliness?",
    "Does this restaurant serve alcohol?",
    "Can we get a comfortable outdoor table?",
    "Are the bathrooms clean?",
    "I want to know if the rooms are clean there.",
    "Can you specify whether the Good Luck Chinese Food Takeaway offers great service?",
    "Do they keep their rooms clean here?",
    "Do you know if they area known for having a good atmosphere?",
    "Is the staff helpful?",
    "How is the atmosphere at Tandoori Palace?",
    "Is the bed cozy?",
    "Do they serve high-quality dumplings?",
    "Will there be great quality Angulas available?",
    "Is it peaceful and not noisy there?",
    "Do the reviews mention clean rooms?",
    "Are the rooms there really big?",
    "which one has have clean room",
    "Do they have good outdoor seating?",
    "Does this restaurant serve alcohol or not?",
    "Is the location of the hotel popular?",
    "Does the Acorn House serve an Irish breakfast?",
    "Is the room a good deal price wise?",
    "Does Don Pasquale Pizzeria have outdoor seating available?",
    "How are their beds?",
    "Are there portion sizes large?",
    "Does the hotel have accommodating and pleasant staff?",
    "Are their rooms clean? I'm weird about dirtiness.",
    "Are the rooms cleaned properly?",
    "Do they have an incredible waitstaff?",
    "How is the internet? Is it fast enough for watching youtube?",
    "Is it a quite place? I was hoping to stay somewhere quiet.",
    "Are the beds nice and comfy?",
    "Which hotel has better reviews for the room cleanliness?",
    "I need a place with non-alcoholic drinks as well since some of my party will be under 21.",
    "Does the Express by Holiday Inn Cambridge have decent breakfast options?",
    "How calm is the place at night?",
    "Is there a stable internet connection here?",
    "How clean are the rooms?",
    "Is the bed soft and comfy for me to get a good nights sleep?",
    "Can you tell me if they have WiFi available for their guests?",
    "Maybe, I'm trying to impress my boss, it would be cool if the waitstaff was top notch, my boss can be a bit of a handful.",
    "Do they have clean rooms?",
    "do they have nice breakfast options?",
    "Is their staff friendly?",
    "Are the staff at the Missing Sock known for being friendly and responsive?",
    "Do they have a quality patatas brava dish?",
    "I am looking for a place that's well known for their Eton Mess.",
    "Before you book I need to know if the staff there are nice and accommodating.",
    "Do they provide clean and comfortable beds?",
    "Do they have a decent selection of non-alcoholic drinks?",
    "Does it have various non-alcoholic drink options?",
    "By the way, does the hotel provide continental breakfast?",
    "Is there anything unique about the inside of the restaurant?",
    "Do they offer breakfast?",
    "Is it in a peaceful and quiet location?",
    "The view from Jinlin Noodle Bar, is it any good?",
    "Will I get a lot of food?",
    "Can you tell me if they're well known for their value for the money?",
    "Is this a quiet area, I would prefer quiet",
    "How spacious are the rooms at the Acorn Guesthouse?",
    "Does la tesca offer outdoor seating?",
    "Does it have a good feeling atmosphere?",
    "Is their biryani delicious?",
    "Does Fitzbillies have excellent service at the location?",
    "Do they have good breakfast options?",
    "Is the location a good one for this hotel?",
    "Do they serve high quality Kimchi?",
    "Is it located near any attractions?",
    "Is it a good deal?",
    "Is the room a good value?",
    "Is it in proximity to things to do?",
    "Do they have great staff and service?",
    "What can you tell me about their portion sizes as I want a lot of food?",
    "Do you get a good value for the money there?",
    "Is the internet reliable?",
    "Does the restaurant have a nice view?",
    "Are the rooms at the Lensfield Hotel spotless?",
    "Does it have pretty indoor decor?",
    "Does the restaurant offer outdoor seating?",
    "Do you know if this place has a nice indoor decor?",
    "Is this hotel equipped with clean rooms?",
    "Can you first tell me if they have comfortable beds?",
    "Does the restaurant have outdoor seating?",
    "I'd love a quiet escape. Is it in a quiet spot of town?",
    "Sounds okay.  Do they serve alcohol there?",
    "Can you tell me if Travellers Rest has staff that are well trained to be friendly, fast and flawless?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Is the first meal in the morning good here?",
    "Are the rooms gonna be big enough for me and my guests?",
    "Is it in a good location?",
    "How comfy are the beds?",
    "Is the bed comfortable?",
    "Is there a friendly and responsive staff here?",
    "Does this place have a good value for my money?",
    "Are the bathrooms clean?",
    "Do they have a nice interior decor?",
    "Does University arms hotel have a calm and peaceful atmosphere?",
    "Does it have great service?",
    "Do they have strong wifi? I need to work on this trip",
    "How strong is the WiFi signal there?",
    "Do they have stable and strong wifi?",
    "does this hotel have good breakfast options?",
    "What is the atmosphere like there?",
    "Is it in a nice location?",
    "Is this a place with a good location?",
    "Is that in a nice area?",
    "Does it also happen to have a big room?",
    "Is the service great?",
    "Does the price offer a good value?",
    "Does the Jinling noodle bar offer a good amount of non-alcoholic drinks?",
    "Does the a and b guest house provide customers with clean rooms?",
    "Is the staff super friendly?",
    "Sounds good.  Can you tell me if they charge a fee for WiFi?",
    "Sure, but does the University Arms Hotel have spacious rooms?",
    "Does the hotel offer a full English breakfast option for guests?",
    "Yes please.  Does the restaurant have any outdoor seating options?",
    "Does this restaurant serve alcohol?",
    "Is this hotel quiet?",
    "Do you know if the Nirala serves a vindaloo of superb quality?",
    "Are the food portions sufficiently large?",
    "Is this hotel priced at a good value for my dollar?",
    "Does it have nice indoor decor?",
    "Can you tell me if they have a wide variety of breakfast options?",
    "Is this staff known for being friendly?",
    "Does it have a comfortable bed to get a good night's sleep?",
    "Do they have any large rooms available?",
    "Is that hotel in a good location?",
    "Does the hotel have highly-rated breakfast menu items?",
    "Does the Oak Bistro offer good food portions?",
    "Do they have comfortable beds?",
    "Remind me if the Autumn House has a dirty room. If it does, then please cancel.",
    "Is there outdoor seating available at Fitzbillies?",
    "Do they offer good portions here?",
    "One more thing. I would like to get some Korma at reasonable prices. Does Curry Prince have that?",
    "Is the internet reliable?",
    "Does the hotel provide a comfortable bed?",
    "I want a place that has superior service...I'm tired of slow, uncaring staff at the restaurants I've been to.",
    "Does the Curry Garden serve high-quality korma?",
    "Do they serve high-quality afternoon tea?",
    "Is it easily accessible?",
    "Do you know if it has a good portion of foods?",
    "Which of these are known for having good atmospheres?",
    "Are the portions large?",
    "Are the reviews high for their Eton mess?",
    "Is the staff friendly, polite and responsive?",
    "Do you know if it has nice indoor decor?",
    "Is that restaurant in a nice location?",
    "Do they mention having a lot of breakfast options?",
    "Is there free WiFi for guests?'",
    "Can you first confirm that the Ashley has comfy beds?",
    "Are there clean rooms at the Acorn?",
    "Do you get a lot for what you pay here?",
    "Does this hotel have a good value?",
    "Do either of them have a nice outdoor dining area?",
    "Overall, is this guesthouse a good value for the money?",
    "Is there wifi there and what is fee",
    "Does Warkworth house have a reputation for clean and spotless rooms?",
    "Does it have large serving sizes?",
    "Is the internet pretty stable there?",
    "Does it have strong wifi?",
    "Do they have very clean rooms?",
    "Do they have creative, tasty breakfast food?",
    "Are they known for their food being good value for the money?",
    "Is it a calm and quiet place to stay?",
    "Do they have a nice indoor decor?",
    "Is it in a safe area within waking distance to other attractions?",
    "Can you recommend a place known for its strawberries and cream?",
    "Does the restaurant serve alcohol?",
    "Is it known for their currywurst?",
    "Does it have good portions of food?",
    "Do they have a pleasant, relaxing atmosphere?",
    "Could you confirm for me whether the bathrooms at Home from Home are clean?",
    "Are the rooms large there?",
    "Does this place have a friendly staff?",
    "Does the Jinling Noodle Bar typically have a relaxed vibe and atmosphere?",
    "Will I have a great experience relative to what I paid?",
    "Does the hotel charge for wifi?",
    "Is the price of a room inexpensive?",
    "Does it have various non-alcoholic drink options?",
    "Do they offer outdoor seating?",
    "Do they have big rooms?",
    "Do you know if the Huntingdon Marriott Hotel offers clean, spotless rooms?",
    "Does it have a good variety of non-alcoholic drinks?",
    "Does that place have a very comfortable bed?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Are the rooms kept really clean?",
    "Will I get good value for my money here?",
    "Does Cote serve fresh Bouillabaisse?",
    "Does the hotel have a good value?",
    "Do the reviews mention anything about a nice vibe?",
    "Cool, and are they worth the price of staying and not overpriced?",
    "I have a question. Is the Avalon a quiet hotel?",
    "So would you say it's a good value then?",
    "What are the breakfast options like?",
    "Do they mention having a stable and reliable internet connection?",
    "Does it have a nice view?",
    "Is cityroomz in a good location?",
    "Do they have a good and reliable internet connection?",
    "Do you know if Bridge Guesthouse offers a good value for the money?",
    "Do they have big rooms?",
    "Not yet, could you first tell me whether Riverside Brasserie serves up large portions of food?",
    "Are they known for having comfortable beds?",
    "Does it have a nice location?'",
    "Is this a place with a good value for the money?",
    "Do they mention having a relxing bed and a comfortable mattress?",
    "How are the staff at the location?",
    "Do they have clean rooms?",
    "Does Bedouin have seating available outdoors?",
    "Does this restaurant have a nice view?",
    "Does this place have a big room?",
    "I need a place with clean bathroom. Does the hotel clean bathrooms regularly and thoroughly?",
    "Are they known for their bathroom cleanliness?",
    "How clean are the bathrooms there?",
    "Do they have stable internet?",
    "Does the hotel have a relaxing bed and mattress?",
    "I need to be sure the place is in a safe area and easily accessible, can you find that?",
    "Are their beds comfortable to sleep in?",
    "Do they serve large portions here?",
    "I really need a good night rest these days. So can you find out whether the hotel has good relaxing beds?",
    "Do they charge a fee for wifi?",
    "Which one of these has the best atmosphere?",
    "Is Wagamama known for having a nice location?",
    "Are there drinks served that don't contain alcohol?",
    "Is this restaurant located in a safe part of town close to other attractions?",
    "What is their service like?",
    "Ashley Hotel is at a good location correct?",
    "Does Autumn House offer big rooms?",
    "Do you know if the beds there are comfortable?",
    "Are there sanitized and pristine restrooms?",
    "Is there a fee for the wifi at Lensfield Hotel?",
    "Does the Meze Bar serve alcohol?",
    "Do they give good service here?",
    "This isn’t one of those hotels with surly staff, right?",
    "Is Wagamama located in a nice area?",
    "The restaurant has a nice view of the city?",
    "Does this restaurant have any outdoor seating available?",
    "Can I order extra large portions?",
    "Are the rooms clean?",
    "Are the people working here known to be pretty nice?",
    "Is it in a good location?",
    "Do they have a large selection of sodas?",
    "Is the internet good?",
    "Can you tell me anything about the size of their rooms as I want something large?",
    "Well, for instance, do people rate it highly for having reasonable prices?",
    "Perfect, could you confirm that the beds at the Hamilton Lodge offer a great night's worth of sleep?",
    "Do you know if it has various non-alcoholic drink options?",
    "Do you know if they have large rooms?",
    "Do they mention having clean restrooms?",
    "Do they mention having large rooms?",
    "Are the staff super welcoming?",
    "How about their staffs, are they warm and welcoming?",
    "What are the breakfast options there?",
    "Are there various non alcoholic drink options?",
    "Yes, are their rooms thoroughly cleaned to be as clean as possible?",
    "Do you know whether The Gardenia has an appealing view from its indoor dining area?",
    "I need a quiet room, does the hotel have a good policy on loud noise?",
    "Do you know if the Limehouse Hotel's rooms are clean?",
    "is that considered a pleasant location",
    "Does it have a friendly staff?",
    "Does it have good breakfast options?",
    "Is it in a convenient location that is easy to get to?",
    "What do they offer in terms of breakfast?",
    "Are they located in a good area?",
    "Does this hotel offer comfortable sleeping arrangements?",
    "I would prefer the one that offers non alcoholic options",
    "Is this place in a good location?",
    "Does Curry King have well known dosa?",
    "Can you tell me if they have delicious lasagna?",
    "Do you know if the Acorn Guest House is in a convenient location?",
    "Do they have beds that are pleasant to sleep in?",
    "Is the place really very good in the service department?",
    "Will this place have nice views?",
    "Is the Midsummer House Restaurant in a good location?",
    "How is the atmosphere in the place?",
    "Is this hotel known for it's good breakfast options?",
    "Is the Carolina Bed and Breakfast a quiet hotel to stay at?",
    "Is the Sesame Restaurant known for having appealing views?",
    "Is the atmosphere top notch?",
    "Do they have really clean bathrooms there?",
    "Is the bed comfortable?",
    "Does cityroomz have large room sizes?",
    "Does the restaurant serve alcohol?",
    "Do you know if the Acorn Guest House is located somewhere appealing?",
    "Does it have a strong internet connection?",
    "Do they offer decent breakfast options?",
    "Can you tell me if they provide great service?",
    "Do they provide good value and service?",
    "Does that location offer some good breakfast options?",
    "Are the rooms quiet?",
    "Do customers receive a large amount of food for what they spend?",
    "is the staff one that is friendly?",
    "Thank you, are the breakfast options good at this hotel?",
    "Do they have comfortable and pleasant surroundings for outdoor dining?",
    "Can you tell me if that's located in a good area?",
    "Does the arbury lodge have clean and spotless rooms?",
    "Can you provide any additional information about the atmosphere first?",
    "Are various nonalcoholic drink options available at Grafton Hotel Restaurant?",
    "How is the indoor seating area decorated?",
    "Do they have a good atmosphere?",
    "First I want to know if the beds are comfortable.",
    "Yes, can you tell me if Ali Baba has outdoor seating?",
    "Do they have a nice decor?",
    "Yes, but are the staff there friendly, polite, and responsive?",
    "Do you get a decent value for your money there?",
    "Are they in a nice location?",
    "That might be nice.  Are the rooms there clean?",
    "Does it have a good atmosphere?",
    "Does that Pizza Hut have outdoor seating available?",
    "Are there a lot of breakfast options:?",
    "Does the Worth House have clean bathrooms?",
    "Is it in a nice location?",
    "Do you have any information on the cleanliness of their bathrooms?  I can't stand a dirty bathroom.",
    "Does Warkworth House provide a good value for my dollar?",
    "Can you let me know if Royal Spice has various nonalcoholic drink options?",
    "Does the restaurant serve alcohol?",
    "Is the place too gaudy?",
    "Is the Charlie Chan restaurant located in a nice area?",
    "Is the Allenbell worth the money?",
    "Are the rooms clean there?",
    "Maybe, can you first tell me if there a nice view surrounding the restaurant?",
    "Does it have various non-alcoholic drink options?",
    "Do either of those places offer a good variety of drinks that are non-alcoholic?",
    "Can you tell me what the values will be? I just want to get the best deal that I can.",
    "Do you know if it has a good portion of foods?",
    "Does the acorn guesthouse offer a variety of good breakfast options?",
    "Are the portion sizes large?",
    "Does the hotel provide decent value for the cost?",
    "Does the alexander have very clean and spotless rooms?",
    "Do they mention having a stable and reliable internet connection?",
    "Does this hotel offer large rooms and suites?",
    "Does it offer many non alcoholic options?",
    "Do you know if their Vindaloo has received high ratings?",
    "Do you get a good value for your money there?",
    "Do the rooms in the hotel have a lot of space?",
    "Can I please know whether they offer a variety of non-alcoholic drinks?",
    "Do they mention having a friendly staff?",
    "Would it have a good portion of foods?",
    "Is the staff friendly?",
    "Would you please verify that they have some good breakfast options?",
    "Do they have good breakfast options?",
    "Is there free wi-fi at the archway house?",
    "Is Rosa's quiet? I don't like noisy places.",
    "Before that, do you know if they are known for giving a lot of food for their dishes?",
    "Does this location provide a good view of its surrounding area?",
    "Can you first tell me if they are considered to be a good value hotel?",
    "Do they have outdoor seating?",
    "How big are the room sizes at the Autumn House?",
    "Is this hotel quiet?",
    "How is the staff there, are they friendly?",
    "I forgot I wanted Arancini, do they serve it?",
    "Does it have a good feeling atmosphere?",
    "Does this restaurant offer good portions?",
    "Do they have really clean bathrooms there?",
    "Do they have really clean bathrooms there?",
    "Can I get an extra big room for my stay?",
    "Can you tell me if the beds are considered to be comfy. I want a soft bed, that is not to hard.",
    "Do they offer great service here?",
    "Are the beds nice? Can I get a great night's sleep there?",
    "Does it have nice indoor decor?",
    "Are the beds comfy?",
    "Is this restaurant located in a nice location?",
    "Can you also let me know whether Home from Home is known for having highly-rated breakfast menu items?",
    "Is this hotel in a quiet location? I really want to relax.",
    "I really want a comfortable bed to sleep in.",
    "Do they have outdoor seating?",
    "Is it in a central location that's easily accessible?",
    "Is this place a good place and good value for my money?",
    "Is the staff friendly?",
    "Is da Vinci pizzeria located in a good area?",
    "Do they have good, friendly staff there?",
    "Does The Lucky Star serve Chow Mein?",
    "Before you make the reservation, please find out whether they offer a decent variety of breakfast options.",
    "Does this place have nice views?",
    "Do they have friendly staff there?",
    "Is there a good selection of non-alcoholic drinks here?",
    "Which ones have good selections of non-alcoholic drinks?",
    "How pleasant is the Oak Bistro inside?",
    "Is fitzbillies decorated beautifully?",
    "Is the place really very good in the service department?",
    "Do they have a liquor license so I can order a cocktail?",
    "Is the hotel located somewhere that is quiet?",
    "Is the atmosphere good?",
    "Are there a lot of activities in the area?",
    "Are there many non alcoholic drink options?",
    "Is there nice indoor decor?",
    "Does Darry's Cookhouse and Wine Shop have great service?",
    "I have a bad back and need to make sure that the mattress is comfortable. What have previous guests said about the beds?",
    "I can get a great night's sleep at this place?",
    "Does the Archway House have a good breakfast spread?",
    "Is the Meghna known for it's Dosa? Are they highly rated?",
    "I will need to do some business calls at this place. Does it have a strong wifi connection?",
    "Do the rooms have a comfortable bed?",
    "Do they have friendly staff?",
    "Is there a nice view there?",
    "Are they in a safe and easily accessible area?",
    "Does Thanh Binh have great service?",
    "Can I order alcohol at Anatolia?",
    "Can you confirm whether La Raza serves heaping portions?",
    "Do the reviews mention a nice atmosphere?",
    "Does the Lensfield offer good breakfast options?",
    "Does the hotel have a good value?",
    "Do they offer great service?",
    "Are they known for being really quiet and soft sounding?  That's what I want.",
    "Is the waitstaff considered exceptional and kindly?",
    "is the hotel centrally located?",
    "Does the Varsity Restaurant provide large portion sizes for their dishes?",
    "I really need a big room at this place. Does the Alpha-Milton offer this is an option?",
    "Is it close to other attractions?",
    "Do they offer nice views from their tables?",
    "Yes, could you kindly confirm that the Pizza Hut offers nice views to look at?",
    "Is the staff friendly at this hotel?",
    "Does the Finches Bed and Breakfast have a warm and friendly staff?",
    "Is La Raza known for having great service?",
    "Is the staff highly trained at Galleria?",
    "Does lovell lodge give a good value for the money?",
    "Do you know if the people that work there are friendly?",
    "Does this restaurant offer a nice view of the Cambridge cityscape?",
    "Does the University Arms Hotel have reasonably priced rooms?",
    "How are the breakfast options there?",
    "Do they have good breakfast options?",
    "Can you first make sure the staff at the Alexander is friendly?",
    "no just make sure it has good outdoor seating area",
    "Are they known for their breakfast quality?",
    "does it have a good atmosphere?",
    "Will it be nice and quiet there?",
    "What is the atmosphere like at Charlie Chan's, and is it a positive one?",
    "Does Cotto offer patrons nice views to look at?",
    "Does this place have good breakfast options?",
    "Does the Curry Prince feature a Korma for a decent value?",
    "Are they known for having clean rooms?",
    "Does the hotel provide breakfast buffet?",
    "Are the rooms very clean?",
    "Does the acorn have spotless rooms?",
    "Which hotel has a more decent locale?",
    "Does the restaurant serve alcohol?",
    "Before booking, could you tell me whether the Express by Holiday Inn Cambridge offers good breakfast options?",
    "Does the place have good value for the money? I don't want to overpay. Can you tell me about the amenties.",
    "Does it have clean rooms?",
    "How big are the serving sizes?",
    "Is the wifi maintained day and night?",
    "Does it have a reputation for very clean rooms?",
    "I would like a hotel that offers free breakfast, does that apply to this one?",
    "Does this place have great service?",
    "Yes, please. Is this restaurant located in a convenient and accessible location?",
    "does the hotel have clean bathrooms?",
    "Do they have many non-alcoholic drink options?",
    "Okay, can you first tell me if they charge a fee for WiFi?",
    "Not yet, could you first let me know whether the Hakka is in a nice location?",
    "Does it have a nice location, perhaps overlooking the city?",
    "Do they keep the hotel quiet, particularly at night?",
    "Do they provide Continental breakfast in the morning?",
    "Are the decorations there aesthetically attractive?",
    "Do they have stable and reliable wifi?",
    "Do they have a good atmosphere there?",
    "Does it have some non-alcoholic drink options?",
    "What's the noise level like there?",
    "Is it easy to find?",
    "Does it also have a spacious room where I can stay?",
    "Is it in a quiet area?",
    "Is the staff friendly?",
    "Does the el shaddai offer decent value for the price?",
    "Does this location have a nice atmosphere?",
    "Is there a decent seating area outdoors here?",
    "Yes and how are the beds?",
    "Does this hotel have a good internet connection?",
    "Do they have outdoor dining or just indoor?",
    "Are their pierogis highly rated?",
    "Is the staff at A and B Guest House friendly?",
    "Do they have clean bathrooms?",
    "Do they have a nice view?",
    "Is there a cool vibe in there?",
    "Is the area clean with a nice view of the city?",
    "Can you tell me if the Wifi is good and reliable?",
    "Was that one the best value for the price?",
    "Is this hotel located in a quiet place?",
    "Do they have clean bathrooms?",
    "Can you tell me if Autumn House has large rooms?",
    "Does it have a nice atmosphere?",
    "Is it centrally located?",
    "Does it have nice outdoor seating?",
    "Does it have good service?",
    "Do you know if the Pizza Hut Cherry Hinton has outdoor seating?",
    "is it accessible?",
    "That sounds good. Can you see if that spot has good outdoor seating please?",
    "Do they have comfortable beds?",
    "Does the hotel have good breakfast options?",
    "How big is the room?",
    "Does it have a low noise level?",
    "Does the restaurant serve alcohol?",
    "Do they provide indoor decor that is nice to look at?",
    "Is the wifi free at the Autumn house?",
    "Does it have a great location?",
    "Does this place have good breakfast options?",
    "Is it located somewhere nice?",
    "Does it have a nice view if I were to eat there?",
    "Are the Tapas desirable here?",
    "Do they have incredible waitstaff?",
    "Does it have a  nice outdoor dining area?",
    "Do they offer great service?",
    "Not yet, could you first tell me whether Limehouse is in a good location?",
    "Does this hotel have rooms that are thoroughly cleaned?",
    "Has any guest complained about unreliable Internet access?",
    "First I would like to know if the hotel has good breakfast options?",
    "Just also wanted to confirm if it was a good value for money option compared to others ?",
    "Which one has a good portion of foods? I'd prefer that.",
    "Well, I would like to know if it is in a good location.",
    "Do they have a nice outdoor dining area?",
    "Is the breakfast fresh?",
    "Do they have a nice outdoor dining area?",
    "Is it close to other shops and restaurants?",
    "Can you confirm for me that Pizza Hut has pizza that's a good value for the money?",
    "I really insist on pleasant and efficient service; what is their service reputation?",
    "Does it have a nice view?",
    "Can you also tell me how soft the beds are? I need it for my back problems.",
    "Is their staff very warm? 1",
    "Is the location good?",
    "Do they have outdoor seating available?",
    "Is the value good though?",
    "Does the Lucky Star have good design decoration around it's perimeter?",
    "Does it have clean bathrooms?",
    "Are the rooms large at the Allenbell?",
    "Do any of them have quality Chaat at a good price?",
    "Do they have large rooms?",
    "Is it in a good location in town?",
    "Are the bathrooms spotless here?",
    "Is it a decent value for the money?",
    "Is it a good location?",
    "Does The Alexander have a stable internet connection so that I can stream movies during my stay?",
    "Are the meatballs at the restaurant freshly sourced?",
    "Can you tell me where this restaurant is located?",
    "Yes, I would like to know if this guesthouse has a good reputation for bathroom cleanliness?",
    "Does it actually have stable internet?",
    "I was wondering if the internet is reliable?",
    "Does De Luca Cucina and Bar have any outdoor seating?",
    "First I would like to know if they offer outdoor seating?",
    "Are there a lot of non-alcoholic drink choices there?",
    "Does it come with good breakfast options in the morning?",
    "Do they have good portion sizes?",
    "I appreciate it, do the rooms in this hotel have comfortable beds?",
    "I also need a spacious room so I don't feel cramped. Do you know if Express by Holiday Inn Cambridge has a large room available?",
    "Are the rooms spotless there?",
    "Before that, does the hotel happen to have a good location?",
    "Can you confirm if Bloomsbury Restaurant has a decent outdoor dining area?",
    "How is the atmosphere for it?",
    "Do they have an option for comfortable outdoor dining with pleasant surroundings?",
    "Yes, I'd like to know if the hotel has good breakfast options.",
    "Can you tell me about their reputation for cleanliness?",
    "Can you tell me if they have excellent service?",
    "How's the staff rated at the Ghandhi restaurant?",
    "Does it offer large food sizes?",
    "Is there enough area for outdoor dining?",
    "Does the guesthouse offer wifi for guests?",
    "Which one has better Yangzhou fried rice",
    "Do you know if Ali Baba is well-known for their Shawarma?",
    "Is Ask restaurant in a good neighborhood and accessible?",
    "Do they offer large portions?",
    "Is the staff there friendly to deal with?",
    "Are the rooms known for being spotless?",
    "Does the bridge house have clean bathrooms?",
    "Does this restaurant have striking features and a good vibe inside?",
    "How are the bathrooms there? I really need a very clean and well-kept bathroom.",
    "Yes, I was wondering how friendly their staff is?",
    "Is this hotel known for it's spotless and clean rooms?",
    "Is their internet connection reliable enough to do work on?",
    "Does it have good portion sizes?",
    "That depends. How large are the portions there?",
    "Do they usually have low levels of noise there?",
    "Is the environment calm and chilled?",
    "Not yet. Do they have any large rooms there?",
    "Do they have large portions?",
    "I don't drink.  Are there a lot of non-alcholic drinks there?",
    "Do they have delicious scrambled eggs with tomatoes?",
    "Can you tell me if the staff is friendly there?",
    "Does this hotel have good breakfast choices?",
    "Is the staff there friendly?",
    "Is it located near restaurants and attractions?",
    "Do they have an extensive non-alcoholic drink menu?",
    "Does this restaurant exist in a good location in the city?",
    "Are the beds extra soft?",
    "One more thing does the hotel have nice staff that work there?",
    "Could you make certain the restrooms are sanitized and pristine?",
    "Do they have any large rooms that I could book?",
    "is there a nice view at this restaurant?",
    "Do they have comfortable beds there?",
    "Is it nice and quiet there?",
    "Is the Chaat highly rated?",
    "Is the hotel located near good places to go?",
    "Do they serve a quailty Goulash at a good price?",
    "Is this a place with clean guest rooms?",
    "is the hotel quiet?",
    "Do they offer a good selection of non-alcoholic beverages?",
    "Are the breakfast menu items at The Worth House highly-rated?",
    "Are the rooms clean and spotless?",
    "If I want a cocktail with my meal, does this restaurant serve drinks?",
    "Do you know how good the value for the price the hotel is?",
    "I always want a place that has good service, do you know if it has that?",
    "How good is the tempura?",
    "Is it centrally located?",
    "Are their portion sizes on the bigger or smaller side?",
    "Do they provide any open-air seating in case it's nice enough to eat outdoors?",
    "Before we make a reservation, can you confirm whether The Golden Wok has decent food portions?",
    "Does this place have clean restrooms?",
    "Do they have spacious rooms?",
    "Thanks. Can you tell me if they serve good pasta there?",
    "Cotto huh, and would you know if their service is great or not?",
    "Is the hotel near other restaurants, shops or attractions?",
    "Is it decorated very nicely?",
    "Do they keep the bathrooms clean at the university arms?",
    "Does it have dirty rooms?",
    "Does the Hamilton Lodge usually have clean rooms?",
    "How are their portion sizes, good?",
    "Does Hakka have great seating outside?",
    "Do they have big rooms?",
    "Does the hotel charge a fee for WiFi?",
    "i heard the peoples of hotel staff , working good there, really waiting to see them",
    "How is the atmosphere here?",
    "Do they serve a reasonably priced Fiorentina Steak?",
    "Is Kymmoy's location close to the sights?",
    "Is the hotel cleaned thoroughly?",
    "Can you tell me if there is wifi that I can use at the hotel?",
    "Yes, does this place have friendly staff?",
    "How good is their reputation for keeping their rooms clean?",
    "Do they serve alcohol there?",
    "Are there accomodations when the internet goes down?",
    "And do they have reliable Wifi?",
    "Do you know if this hotel has clean bathrooms?",
    "Before I do, does it have a striking features and a good vibe inside?",
    "How is the service at this location?",
    "Do you get a decent value for what you pay here?",
    "Are the portions at the Gandhi large or small?",
    "Do they have relaxing beds suitable for nice sleep?",
    "Do they serve high quality Bolognese that is affordable?",
    "I'm concerned about the low rating, it is important for me to have a friendly and conscientious staff can you tell me about that?",
    "Do they have a wide selection of alcoholic and non alcoholic drinks?",
    "Do they keep the bathrooms really clean?",
    "Is the bed relaxing?",
    "Does it have Irish breakfast?",
    "Is the indoor decor at Kohinoor authentic?",
    "Do they have good wifi so I can work.",
    "Do they have a good selection of breakfast items?",
    "Does Prezzo serve up good portion sizes to diners?",
    "Does this restaurant offer a outdoor seating area?",
    "is the outdoor dining nice?",
    "Do they offer a  nice area for outdoor dining?",
    "Do they have many kinds of non-alcoholic drink options there?",
    "Does the a and b guest house have comfortable beds in the rooms?",
    "Can you tell me if they are located in a good area?",
    "Is this place a quiet hotel?",
    "Can you find a place where the bathrooms are rated higher in how sanitary they're kept?",
    "Does it have a friendly staff?",
    "Do they have good portions of food in their servings?",
    "How about their staff, are they friendly and helpful?",
    "Does it offer a comfortable bed?",
    "Can you tell me if their burritos have reasonable prices?",
    "Do you know if it has good atmosphere?",
    "Do they have nice decor inside?",
    "Do you know if they provide a good dining atmosphere?",
    "Does the restaurant serve alcohol?",
    "Is the staff kind?",
    "Does it have a nice view?",
    "Does it have a good variety of non-alcoholic drinks?",
    "Do they have clean rooms?",
    "Is there a maid service that cleans the bathrooms daily?",
    "Before you book can you see if there is any information on how comfortable their beds are?",
    "Yes, does The Acorn Guesthouse offer free breakfast to guests?",
    "Does it have various non-alcoholic drink options?",
    "Do they have a good variety of breakfast options?",
    "Are there many non alcoholic drink options?",
    "Where is the Lovell Lodge located?",
    "Does this place have nice indoor features to look at?",
    "Does it have comfortable beds?",
    "I have back problems, so can you make sure the hotel has a comfortable mattress?",
    "Do they offer outdoor dining in a nice setting?",
    "I also want a place that has delicious Ma Po Tofu? Does J restaurant serve it?",
    "Is the bed comfortable?",
    "Do they have good views?",
    "Does it have a nice view?",
    "Do you know if it has a nice outdoor place for dining?",
    "Does it have nice indoor decor?",
    "Could you tell me how the decor is ranked?",
    "Do they mention having a good breakfast?",
    "Can you tell me if the beds and mattress are very comfortable?",
    "Do they have a good selection of non-alcoholic beverages?",
    "I would like to find a place that serves delicious Ma Po Tofu. Does Golden Wok have it?",
    "How big are the portion sizes at Royal Standard?",
    "Is this hotel known for providing a good value for the price?",
    "Do they have clean bathrooms at this hotel?",
    "How many quests share the bathroom and what is the rating for cleanliness?",
    "Which has the most comfortable beds?",
    "Would you say that it has beautiful decorations?",
    "Are the rooms large?",
    "Can you first confirm that Kirkwood House Hotel offers accommodating and pleasant staff?",
    "Actually, sorry about that but can you check if the location you booked is centrally placed and is accessible as well?",
    "Do they mention comfortable beds?",
    "Is it located in a nice area?",
    "Does the Bridge Guest House have a comfortable bed?",
    "Do they have Freshly sourced Alheira?",
    "Is it located in a good part of town?",
    "Can you tell me whether Cow Pizza Kitchen and Bar serves alcohol?",
    "Do they have a great selection of non-alcoholic drinks?",
    "I'm looking for a large room, can they meet those accommodations?",
    "I'd like to stay in a quiet place.",
    "How are the breakfast options there?",
    "Is the waitstaff on top of things?",
    "Can you tell me if they are located in a nice area?",
    "Does that place come with some good breakfast options?",
    "Are the rooms considered clean there?",
    "Is Ugly Duckling a nice location?",
    "I want to stay at a place where they staff is really friendly and I feel comfortable.",
    "Do you know if any of them have a nice outdoor dining area?",
    "Is there outdoor seating available at Restaurant Two Two?",
    "Can you tell me if Darry's Cookhouse and Wine Shop serves a decently valued quiche?",
    "Neat, does it have a relaxing bed and mattress as well?",
    "I need it to have a comfortable bed.",
    "Does this restaurant serve exceptional Sklandrausis?",
    "How much is it and what do I get for that price?",
    "Is the Leverton House relatively quiet?",
    "Do you know if it is centrally located in town?",
    "Does the Lucky Star offer outdoor dining spaces with pleasant and comfortable surroundings?",
    "Does their interior have striking features and a good vibe inside?",
    "Can you first let me know whether the bathrooms at the Ashley Hotel are clean?",
    "Is the staff very friendly there?",
    "Does this hotel have a good breakfast menu?",
    "Is there a great selection of non-alcoholic drinks?",
    "Does it have a comfortable bed?",
    "Does it have a nice view?",
    "What is the Finches Bed and Breakfast's options for breakfast.",
    "Do they give a hefty portion with each dish?",
    "Does this hotel provide full english breakfast?",
    "As long as they get good ratings for customer service - I need a place with staff that are helpful & pleasant. Do they have that?",
    "What beverage options are there for those who are underage?",
    "Yes, I'm looking for a place with tandoori chicken on the menu.",
    "How good is the value?",
    "Is there any kind of alcohol that is served there?",
    "Do they mention having a comfortable bed?",
    "Is the cb11ly area considered a good location?",
    "Is the hotel centrally located and accessible?",
    "Is it a good value for the price?",
    "Is Cote in a good location?",
    "Does it come with a stable internet connection?",
    "Does this hotel give you a lot for the price?",
    "Is this hotel a good value for my money?",
    "Does this place have big rooms?",
    "Is it a good value?",
    "Is Sala Thong in a location that's good?",
    "I can get a great night's sleep at this place?",
    "Is the view great?",
    "Does it have a strong internet connection there anyway?",
    "Do they have a clean bathroom?",
    "Do they have a warm and welcoming staff?",
    "Can you confirm that Cocum serves a good selection of nonalcoholic drinks?",
    "Are they a good value for the price?",
    "Is the service staff rated well?",
    "Does Lovell Lodge have a polite staff?",
    "Is their staff well trained to be friendly, fast and flawless?",
    "Do they have big rooms?",
    "Does it have nice modern decor?",
    "Is it good value for the rate?",
    "Would you say the Centre is a good location?",
    "Are the bathrooms clean?",
    "How many stars is the customer service rated?",
    "Is this place nice and neat?",
    "Does this restaurant serve a high-quality pasta?",
    "Is the silence good?",
    "I am wondering, does Home from Home have a varied breakfast menu?",
    "Does it have good portions of food for their servings?",
    "Do they have really spotless rooms there?",
    "Do they have reliable internet service there?",
    "Do they have many different non-alcohol drinks?",
    "Is their BEER-BRAISED CHICKEN STEW delicious?",
    "Does it have beautiful decorations?",
    "Is the hotel location found in a  nice natural landscape?",
    "Do they have a good atmosphere?",
    "Can you confirm that the Huntingdon Marriott Hotel offers a quiet place to stay?",
    "Do they thoroughly clean the rooms between guests at the acorn?",
    "I need a room with a lot of space, roomy, does it have that?",
    "i need the bed to be neat",
    "Does the place have a nice indoor decor?",
    "Does it have a good atmosphere?",
    "Does the El Shaddai have have high ratings for clean bathrooms?",
    "Does it have a good atmosphere?",
    "I am on a tight budget so is this a good value for my money?",
    "Is it centrally-placed and accessible?",
    "Is there outdoor seating available at the restaurant?",
    "Does it have a good location?",
    "Is the location centrally-placed and accessible?",
    "Is there good portions at Gardenia?",
    "Are the rooms thoroughly cleaned?",
    "What is breakfast names?",
    "First can you tell me if the rooms have cozy beds?",
    "What about the dining area? Is it pleasant? Or just average?",
    "Is the area safe?",
    "Are the beds comfortable?",
    "Is that place in a good locale?",
    "What is included in the price?",
    "Does it have a good feeling atmosphere?",
    "Do they have large rooms at that hotel?",
    "I'd like to know whether their ratings indicate them being really clean.",
    "Do they offer a continental breakfast also?",
    "Does the hotel provide American breakfast?",
    "Do they offer a good breakfast option at this hotel?",
    "I need the place to have pleasant surrounding for outdoor dining",
    "Does it have a good atmosphere?",
    "Can you please verify that it will have a clean bathroom?",
    "Also, does it have good service?",
    "Are they known for good service?",
    "Does the hotel have staff who are friendly, polite and responsive?",
    "For the price, how are their portions?",
    "When i book in do they also provide nice breakfast food?",
    "Can you check if it has spacious rooms so I don't feel cramped during my stay?",
    "Does it have a big comfy bed?",
    "I prefer a place that has great customer service and nice employees, is this one of them?",
    "Is this restaurant known for their surface?",
    "Are the staff well trained to be friendly, fast and flawless?",
    "Is the indoor decor nice?",
    "How is customer service rated at El Shaddai? I need one with friendly staff",
    "Do they have good breakfast choices there?",
    "Does it have good service? I feel like service has been lacking lately.",
    "Do they charge for wifi?",
    "Does it have good portions of food for their servings?",
    "Does it have a nice atmosphere?",
    "Is it soft sounding?",
    "Does the guest house have a relaxing bed and mattress?",
    "Does the Arbury Lodge Guesthouse have a variety of options for breakfast?",
    "Does the restaurant have a good atmosphere?",
    "do they have large portioning?",
    "Not yet, can you first tell me whether Efes Restaurant has a good selection of non-alcohol drinks available?",
    "Do they have a good selection of non alcoholic beer?",
    "Do they have nice indoor decor?",
    "Is there a charge for using wireless internet there?",
    "Do you know if the serve Fish and Chips at a reasonable price?",
    "Can you tell me whether the Gandhi is in a nice location?",
    "Does Graffiti serve a high grade Cornish Pasty?",
    "Is there nice outdoor dining?",
    "Is their Kung Pao Chicken of a high grade?",
    "Does it have a large non alcoholic drink selection?",
    "Does it have nice outdoor dining",
    "Do you know if they serve alcohol at the Portuguese restaurant?",
    "Is it in a safe and easily accessible area?",
    "Are the food portions good?",
    "Is this hotel a pretty good value?",
    "Which restaurant has a top notch atmosphere?",
    "Can you let me know whether the Galleria has a good variety of nonalcoholic beverages?",
    "Does the hotel provide good value for the money spent?",
    "Does it offer various good breakfast options?",
    "Are the bathrooms clean here?",
    "Do they have an interesting view outside looking through the windows?",
    "Do they offer good portions here?",
    "Is it close to any tourist attractions or other things to do?",
    "Would you happen to know if they offer large potions sizes so I can take home leftovers?",
    "How highly rated is thier table service?",
    "Does it have a nice view?",
    "Does Kymmoy serve decent food portions?",
    "Is the Kohinoor establishment situated in a pleasant part of town?",
    "Is that the best value for the price?",
    "make sure its clean",
    "Does the restaurant happen to serve alcohol?",
    "Are the mattresses there comfortable?",
    "Do any of them have a nice view and patio?",
    "Can you tell me if they charge for wi-fi?",
    "Can you confirm that this restaurant has incredible waitstaff?",
    "Are the views good because this is very important to me?",
    "Does it have a nice view?",
    "Can you tell me if the Warkworth House has a variety of tasty breakfast options?",
    "Is the outdoor area good for dining?",
    "Is it centrally-placed and accessible?",
    "Are they located in a nice area?",
    "Is it worth the money?",
    "Do they have friendly staff there?",
    "Do they have an extensive non-alcoholic drink menu at all?",
    "Is the view from City Stop decent?",
    "Is the hotel located somewhere appealing?",
    "Does it have strong wifi reception?",
    "Possibly. How's the service there? I won't settle for anything less than impeccable service and I need to be treated right.",
    "Could you let me know if the mattress' at Alexander Bed and Breakfast are nice? Are they new?",
    "Is the Worth House in a good location?",
    "Does Riverside Brasserie serve alcohol?",
    "Do you know how highly rated the vindaloo is at Curry Garden?",
    "Can you tell me first if the staff are friendly?",
    "Is the guesthouse in a quiet place there?",
    "Is it a quiet place in a quiet area?",
    "Do you have any details about the quality of mattresses available?",
    "Can you check to see if they have an outdoor dining area and what it is like?",
    "Are the beds comfy?",
    "Is it close to other attractions and shops?",
    "I need a quiet room, does the hotel have a good policy on loud noise?",
    "Do they offer high quality and stable wi-fi?",
    "I would like the one that has clean bathrooms.",
    "Is it a good value?",
    "Are the people who work there known to be very nice?",
    "Yes, but after you let me know whether it is in a good neighborhood and is accessible.",
    "Do they have a nice view?",
    "2 star place would be fine if it has excellent value. Is it worth the money?",
    "How is the non-alcoholic drink selection?",
    "Can you confirm whether the views are appealing at the Hotel du Vin and Bistro?",
    "Is the service great?",
    "Do you know if the Lensfield Hotel has reliable Internet connectivity?",
    "Does it have really nice decorations?",
    "Could you tell me if their iskender kebap is reasonably priced?",
    "Do you know if the Curry Garden serves plentiful portion sizes?",
    "Not yet. Can you confirm if they have incredible waitstaff working at the restaurant?",
    "Are there a variety of good breakfast options?",
    "Is it in a safe location and easy to get in and out of?",
    "Before that, could you please confirm that the bathrooms are clean here?",
    "Do they have clean bathrooms?",
    "And would you happen to know if reviewers say they serve large portions of food or not?",
    "First can you tell me if the staff at the Acorn Guest House is friendly?",
    "Does it have sanitized and pristine restrooms?",
    "Will the bed there let me get a good nights rest?",
    "Do they have good WiFi?",
    "Are there tasty breakfast options?",
    "I want a place that's highly rated for its reasonable prices. How does Little Seoul rate?",
    "Do either of these have outdoor seating as an option?",
    "Are they located in a good location?",
    "I prefer a nice location, does this restaurant qualify?",
    "How would you describe the decor? nice?",
    "Is it in a good location?",
    "Does this restaurant serve alcohol?",
    "Is it close to things to do?",
    "Do you know whether the Grafton Hotel Restaurant has any outdoor seating available?",
    "Can you check to see if they have a highly rated breakfast menu?",
    "Do they have good outdoor seating?",
    "I insist on great service when I dine out. Is Pipasha Restaurant known for having fast and flawless staff?",
    "Does it have nice views?",
    "Does it have a nice view?",
    "Is it a good atmosphere there?",
    "Is the Slug and Lettuce's location close to many different things to do?",
    "Is Charlie Chan located in a nice area?",
    "The people that work there, are they friendly and would I find them welcoming?",
    "Yeah can you please tell me anything about how comfortable the beds are?",
    "Are there a lot of breakfast options?",
    "Is this place well equipped for outdoor dining?",
    "Can you confirm that the bathrooms are clean?",
    "Does little Seol serve alcohol to their customers?",
    "Does the restaurant have a nice view?",
    "Does this place have large rooms?",
    "Do you get a clean room here?",
    "Does the hotel charge for wifi?",
    "Does La Tasca serve an exceptional Gazpacho?",
    "Is the vibe nice and chill?",
    "Do they have a great staff and service?",
    "Do they offer good portions here?",
    "I want a place that serves delicious Eton mess.",
    "Does it have a nice area for outdoor dining?",
    "Which one has a great variety of non alcoholic drinks to choose from?",
    "Do they have large rooms?",
    "Is the Cambridge Chop House known for having a top notch atmosphere?",
    "Does it have a large non alcoholic menu?",
    "Which one has the biggest portion of dishes?",
    "Are the bathrooms dirty here?",
    "Is the view nice?",
    "Do they provide customers with a clean bathroom?",
    "I would prefer a location where it will not be noisy. Is Leverton House a quiet place to stay?",
    "Is the place decorated nicely?",
    "Is there any noisy attractions around the A and B Guest House? I'm looking for something quiet.",
    "Do you know if the Acorn Guest House offers internet connection that's both reliable and consistent?",
    "How is the atmosphere for the restaurant described?",
    "Do they have large rooms with plenty of room to walk?",
    "Is Bedouin too expensive to have reasonably priced koshari?",
    "Are they located in a nice location?",
    "Could you first tell me do they have comfortable beds there?",
    "Do they have a good variety of non-alcoholic drinks at Cotto?",
    "Do you know if City Stop Restaurant has an extensive nonalcoholic drink menu.",
    "Do they serve fresh Baklava?",
    "Is the service great?",
    "I absolutely must have clean restrooms; is that a given at this location?",
    "Will I get a good value for the price there?",
    "Does the hotel provide good value for the money spent?",
    "Does the restaurant offer outdoor seating?",
    "I don't need to worry about dirty bathrooms do I?",
    "Does this hotel offer Wi-Fi for guests?",
    "Does the Grafton Hotel Restaurant serve large food portions?",
    "Do they have a good view?",
    "Which restaurant has high ratings for its arancini?",
    "Is the neighborhood quiet? I need a calm and quiet environment.",
    "Only if it has good breakfast options! Does it?",
    "Is there a feelgood atmosphere at HK Fusion?",
    "Is their Lasagna cheap?",
    "Does El Shaddai charge guests a fee for using the WiFi?",
    "Can their rooms be considered as large?",
    "Do they serve cocktails?",
    "Is the hotel in a good location?",
    "Is this area close to things to do?",
    "Can you tell me more about their non-alcoholic drink options?",
    "Does it have comfortable beds?",
    "Does the place have spotless rooms at all times?",
    "do they treat people right?",
    "Are the rooms very big there?",
    "Is the Carolina B&B known for having friendly and helpful employees to help assist during my stay?",
    "Does the atmosphere at the Saigon City give a good feeling?",
    "Does it have clean bathrooms?",
    "Is the staff friendly?",
    "Are they a good value for the money?",
    "I need a place that is quiet for me to stay. Does the Rosa bed and breakfast offer this?",
    "Is this place a good value for the money?",
    "Is it in a safe and easily accesible area?",
    "Do they have good portion sizes?",
    "Does this place have a friendly staff?",
    "Do they give large portions when you order?",
    "Are they known for having providing good value for the money?",
    "Is it in a nice location?",
    "Do any of them mention having a friendly staff?",
    "Does the Midsummer House Restaurant have a high quality staff?",
    "Is the staff friendly?",
    "Which of these offers generous food portions?",
    "Do you get a lot of food here?",
    "Does the restaurant give a good view of the city?",
    "Is there a nice outdoor patio for dining here?",
    "Can you make sure I get a quiet room by itself?",
    "Wait.  Is there a good internet connection at the Ashley?",
    "Does Maharajah Tandoori have a nice location?",
    "do they many alcohol free drinks",
    "Do they have good portion sizes?",
    "Do you have have 24/7 internet for business and personal activity?",
    "Would you consider this hotel a place where I would get a lot for what I spend?",
    "Does the business have a good feeling atmosphere?",
    "It depends, do they have a room with a bed that is very cozy?",
    "Does it have a lot non alcoholic drink options?",
    "Do they have spotless rooms?",
    "Does this hotel have a good breakfast menu?",
    "Are the rooms there big?",
    "Is it located in a nice area?",
    "I need a good bed to sleep at night, how's the offering at the University Arms Hotel?",
    "Can you tell me if it has sodas, teas and other non alcohol drink choices?",
    "Is it in a good location?",
    "Does the Carolina Bed and Breakfast have a big room?",
    "Can you first tell me whether Grafton Hotel Restaurant is equipped for outdoor dining?",
    "Do you know if it has great service?",
    "Does it have a clean room?",
    "Does the limehouse have reliable internet?",
    "Is the neighborhood safe and close by downtown?",
    "Do they offer non-alcoholic drink options?",
    "Does this restaurant have various non-alcoholic drink options?",
    "Are the restrooms cleaned frequently?",
    "Do you get a lot for what you spend there?",
    "Is the location of the hotel popular?",
    "Is the service good?",
    "Does it have a stable internet connection?",
    "Are the workers nice?",
    "Can I confirm they have good service?",
    "Does the guest house have a large room?",
    "Do they have spacious rooms?",
    "Do they have a good selection of non-alcoholic drinks?",
    "Are the bathrooms clean?",
    "Do they have good service?",
    "What is the atmosphere like at Shiraz Restaurant?",
    "Can you tell me if it's a good location?",
    "Is there somewhere nice there to sit outside and eat?",
    "Does the cambridge lodge restaurant have nice decorations?",
    "Is this hotel known for it's friendly staff?",
    "Do they offer superb quality kimchi?",
    "Is the atmosphere chill?",
    "Do they have a good non-alcoholic drink menu?",
    "Do they have beautiful decorations?",
    "Do they have escargot at reasonable prices?",
    "Does the El Shaddai have bathrooms that aren't dirty?",
    "Does The Royal Spice serve alcohol?",
    "Does restaurant one seven have decently valued Fish and Chips?",
    "Is the location good for the restaurant?",
    "no am looking for nice indoor features",
    "Is the vibe good?",
    "Does it have nice outdoor seating?",
    "Is Restaurant Alimentum known for having great service?",
    "Do they have a good atmosphere here?",
    "Do you get a decent value for the money there?",
    "Do they have non-alcoholic beverages?",
    "Is it in a convenient location?",
    "I need the restaurant to have a good view.",
    "Is there Wi-Fi available for guests?",
    "Is the waitstaff considered exceptional and kindly?",
    "I do prefer a large room. Can this be accommodated?",
    "Are the beds good enough to sleep like a baby?",
    "Do they have good service? That's what I'd like.",
    "Doesn't mention comfortable beds?",
    "Is their staff known for being friendly, polite, and responsive to the needs of their guests?",
    "Does the restaurant serve alcohol?",
    "Do they have a nice indoor decor?",
    "Does it have gigantic rooms?",
    "Will I be able to sleep in a comfy bed?",
    "I should have asked earlier but can you tell me if the staff at the hotel are nice and welcoming?",
    "I'm concerned about hygiene so please check the cleanliness level of their bathrooms.",
    "How is the atmosphere in Bangkok city?",
    "Does Autumn House have large spacious rooms?",
    "Are the rooms considered quiet, perhaps soundproofed?",
    "How is the indoor décor at Nandos?",
    "Does this place treat customers nicely?",
    "Does the establishment have beautiful decorations there?",
    "Which of these are considered to be good locations?",
    "Does the table have a nice view?",
    "Do they have great service?",
    "Does it have large rooms?",
    "Does this place have stable wifi?",
    "Does this restaurant have outdoor seating options for guests?",
    "Does it have a 4 star staff?",
    "Does it have great service?",
    "Are any large rooms available there?",
    "Is it close to other attractions?",
    "Do they have Chicken Tikka Masala that's a good value?",
    "Are there clean rooms at Home from Home?",
    "Are they located somewhere appealing?",
    "What about the dining area? Is it nice there?",
    "Does the restaurant serve alcohol?",
    "It's very important the mattresses are comfortable--are they?",
    "Does the price of the room include a breakfast buffet with fresh fruit, pancakes, and orange juice?",
    "Do they serve alcohol there?",
    "Is it good value for the rate?",
    "are the rooms large and spacious?",
    "Does it have a comfortable bed?",
    "How big are their rooms?",
    "Are the bathrooms cleaned frequently throughout the day?",
    "Are the beds high quality to allow a good night's sleep at the Carolina B&B?",
    "Yes, is wifi available there for the hotel guests?",
    "Are the bathrooms kept in a clean condition?",
    "Are there clean bathrooms here?",
    "Can I be sure that it will be a clean room?",
    "Does the hotel have free wifi for guests, or do I have to pay for it?",
    "Does it have good breakfast options?",
    "Can you tell me will I get a good value for my money there?",
    "I want a place in a nice location...how is the Gourmet Burger Kitchen's?",
    "Does it have a nice view?",
    "Is this hotel known for it's friendly staff?",
    "Perhaps. Can you verify if they serve alcohol here?",
    "What about outdoor seating?",
    "Does it have a good atmosphere?",
    "Are there sanitary bathrooms here?",
    "Is their bathroom there sanitary?",
    "Do you know if it has great service?",
    "I should have asked, do they have outdoor seating?",
    "First I would like to know if Express is in a quiet location?",
    "Do you know if it has a good portion of foods?",
    "Can you tell me what location Curry Prince is in?",
    "Yes, does Curry Prince serve alcohol?",
    "Does it serve alcohol?",
    "Is this establishment considered a good value for my money?",
    "How about the outdoor seating preference, do they both offer this?",
    "Is the restaurant in a convenient and accessible location?",
    "Do the rooms have comfortable beds in them?",
    "What is the service there like as I want to dine some place with good service?",
    "Do they have a nice view?",
    "Are their rooms impeccably clean?",
    "Are patrons able to see nice surroundings from the Meghna?",
    "Can you find out if this restaurant has staff that are well trained to be friendly, fast and flawless?",
    "Do they serve scrambled Eggs with Tomatoes and have decent portion sizes for the price?",
    "Does Hakka serve scrambled eggs with tomatoes that's a good value for the price?",
    "are they in a good neighborhood and accessible area",
    "Can you see if its worth the money I spend for it?",
    "Are the bathrooms cleaned frequently?",
    "Do they have good choices for breakfast?",
    "Do they offer non-alcoholic drink options?",
    "Does it offer a good value?",
    "Does this location offer a pleasant view?",
    "Does it have really clean bathrooms there?",
    "Do you know if the staff is accommodating and pleasant?",
    "Is the outdoor dining nice?",
    "Does the Cambridge Belfry have large rooms?",
    "Are other guests saying they have friendly, positive staff?",
    "Is it a stable internet connection?",
    "Good service matters to me. What is their reputation for service?",
    "Do they have a large alcoholic and non alcoholic drink menu?",
    "Do they serve fresh and quality Vindaloo?",
    "Does City Stop Restaurant offer nice outdoor dining areas?",
    "Are the rooms large enough for 2 people to have their own bed?",
    "Not yet. Can you confirm that this is a place with a clean bathroom?",
    "Do they have comfortable beds here?",
    "Is the value good for the money at kirkwood house?",
    "Do you know whether the Lensfield Hotel is in a good location in town?",
    "First can you let me know about how friendly their staff is?",
    "Is it a good place where it serves good portion of foods?",
    "Being moderately priced would you say I get a lot for my money?",
    "And the staff who work there are friendly?",
    "Do you know if it has a nice view?",
    "Do they mention having a comfortable bed?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Are they staff known for being friendly?",
    "Is it a good value for the money?",
    "Is it worth the money?",
    "Does this location offer a nice inside decor?",
    "Are the bathrooms very clean?",
    "Can you add a request for additional cleaning attention pre-arrival?",
    "Does Panahar have decent food portions?",
    "Does Charlie Chan also have good views?",
    "is this hotel considered as a quiet place?",
    "Does this location offer large rooms?",
    "Do they offer many drinks that don't contain alcohol?",
    "Do they have nice outdoor seating available?",
    "Is there a nice view from this restaurant?",
    "How's the staff there? Are they friendly and responsive? Or do you have to wait awhile to be served?",
    "Does this location have a stable internet connection?",
    "Do they have great service at the restaurant?",
    "Does the restaurant serve  alcohol?",
    "Does this restaurant serve alcohol?",
    "Does the hotel offer wifi for guests?",
    "Are the bathrooms there clean?",
    "Is the restaurant in a nice location?",
    "Is that the best value for the price?",
    "Does Darrys feature a good variety of non-alcoholic drinks?",
    "Can this place give portions of food that are decent?",
    "Does this place have a good atmosphere to enjoy?",
    "Is that hotel good for people who like quiet?",
    "I love breakfast are their options good?",
    "Does Curry Garden offer a drinks menu in case I want a cocktail?",
    "Do they have a pleasant interior decor?",
    "Do they have a good breakfast selection there?",
    "Does it have striking features and a good vibe inside?",
    "Is the internet connection stable there?",
    "Could you let me know whether Finches offers good breakfast options?",
    "Does the restaurant have a great selection on non-alcoholic drinks to choose from?",
    "Is this hotel considered a good value for my money?",
    "Do they sell good baklava there?",
    "Are the bathrooms clean in the Lovell Lodge?",
    "Is the staff friendly and easy to deal with?",
    "How's the view from the restaurant?",
    "Are they in a convenient and accessible location?",
    "Yes, I want to know if they have a large room to book?",
    "Is this hotel known for it's friendly and warm staff?",
    "Is the outdoor dining area nice?",
    "Also, what is the set up in the room and how about the size of the bed?",
    "Can you provide any information on the serving sizes?",
    "Does it have large rooms?",
    "Are their rooms clean?",
    "How friendly are the staff at The Lensfield Hotel? What are their customer service ratings?",
    "Can you tell me whether they serve non-alcoholic drinks?",
    "The most important thing for me is customer service. Is the staff friendly?",
    "How clean are their restrooms according to reviews?",
    "Do they offer a good variety of breakfast foods?",
    "Does Lan Hong House serve any alcohol?",
    "Do they mention having large rooms?",
    "Is it in a nice location, because that is important when choosing a place to dine?",
    "Is the Missing Sock located in a good location?",
    "Does the El Shaddai have nice clean bathrooms?",
    "Do they have relaxing beds?",
    "Does this hotel offer great wifi?",
    "Is the Missing Sock equipped to host outdoor dining?",
    "Is the vibe here good?",
    "Does Archway House have comfortable beds?",
    "Is the internet reliable there?",
    "Do other people that have stayed there generally like the area?",
    "Is it a good value for the money though?",
    "Do they have various non-alcoholic drinks available?",
    "Can you confirm whether Panahar has good views?",
    "Does that restaurant have good views from its windows?",
    "Does this hotel have a friendly staff?",
    "Are the bathrooms always clean?",
    "Do they serve good food portions?",
    "How would you describe the atmosphere there?",
    "How is the internet connection?",
    "Does Nandos offer great service?",
    "Is the staff nice or not?",
    "Does this place have WiFi available to guests?",
    "I want to eat at a place where the Yangzhou fried dish is known to be good.",
    "Is the staff known for friendliness?",
    "Which of these serve freshly sourced Bolognese?",
    "Is it located in a nice area?",
    "Does the Ashley have good breakfast options?",
    "How large are the rooms at Carolina Bed and Breakfast?",
    "Can you check if this restaurant has nice outdoor dining areas?",
    "Do they have dirty bathrooms?",
    "Do they have nice indoor decorations?",
    "Great. Are their rooms clean and sanitized regularly?",
    "Is it in a nice location?",
    "Do they have reasonably priced food?",
    "Do they offer a free breakfast",
    "Are the rooms there clean?",
    "Can you confirm that the staff at Jinling Noodle Bar is well trained to be friendly, fast, and flawless?",
    "Are there any interesting sights visible from the dining room?",
    "Does the University Arms Hotel offer larger suite rooms?",
    "Is the atmosphere good?",
    "Is the view amazing?",
    "How do customers rate the friendliness and helpfulness of the staff there?",
    "Does chiquito restaurant have a nice view?",
    "Is it in a nice location?",
    "Oh, I forgot to ask before. Does the restaurant have a nice view?",
    "Is the hotel cleaned thoroughly?",
    "Are there any complaints about the WiFi?",
    "Do you know if it has a nice location?",
    "Is this place known for it's large food portions?",
    "Could you also tell me how clean their rooms are?",
    "I prefer a high quality mattress. Are your beds high quality and relaxing?",
    "I'm looking for a place that's not too noisy. Is the Huntingdon Marriott fairly quiet?",
    "Is there nice indoor decorations here?",
    "Does the Alexander bed and breakfast have reviews saying it is worth the price of staying?",
    "Does it have nice indoor decor?",
    "Do they also offer a nice view?",
    "Is there a nice outdoor dining area?",
    "Does the Royal Spice have DOSA at a reasonable price?",
    "Matters do they have a friendly staff?",
    "Is the staff there super friendly?",
    "Do you know if it has a nice location?",
    "Does it have a good value for money?",
    "Is this a quiet hotel?",
    "Are they known for plentiful portions?",
    "Can you tell me if they have large size rooms?",
    "Do is mention having a friendly and helpful staff?",
    "Can you check and make sure that there is an option for a nice breakfast please?",
    "Is this establishment considered a good value for my money?",
    "Are there some nice indoor features to look at?",
    "Is this place easily accessible?",
    "Do they have a friendly staff?",
    "does the place have a nice view too?",
    "Is the place in a good location?",
    "Can you make sure that the room is spotless?",
    "Does this restaurant have a nice view to look at?",
    "Is the service great?",
    "Which one has a better view?",
    "Do they have a modern decor without a lot of outdated decor?",
    "Can you confirm that El Shaddai Guesthouse is very clean?",
    "How friendly is the staff at the Bridge Guest House? Do they have an overall user rating?",
    "Do they serve fresh dumplings?",
    "Which place has the friendliest staff?",
    "Does this hotel offer a comfortable bed for a good sleep?",
    "Do they have an extensive non-alcoholic drink menu?",
    "Does it have good breakfast options?",
    "Does the Kohinoor serve Biryani?",
    "Do they have Chaat at a good price there?",
    "Are the people that work there nice?",
    "Do I get wifi at the Hobson's House?",
    "Does Graffiti offer great service?",
    "Can you tell me if the guest house rooms are cleaned thoroughly?",
    "Do they have comfortable beds ?",
    "Which one has a better breakfast selection?",
    "Does it have good strawberries and cream?",
    "Is it in the best location of town?",
    "Can you tell me if the University Arms Hotel has good breakfast choices?",
    "Does it mention anything about a relaxing bed and mattress?",
    "Is this restaurant known for it's nice surroundings for a good view?",
    "Is it known for having an exciting and welcoming atmosphere?",
    "Does the Acorn have free breakfast for guests?",
    "Does Loch Fyne have various non-alcoholic drink options?",
    "How are the non-alcoholic drink options?",
    "Is it in a safe area with lots of entertainment options?",
    "Does the hotel charge a fee to use their WiFi?",
    "Is it a quiet place?",
    "Does it have a clean bathroom?",
    "Do they have outdoor seating?",
    "Is the there a business quality wi-fi connection at this b&b?",
    "Do you think the price is worth the level of luxury you get?",
    "Does this guesthouse have friendly and welcoming staff?",
    "Is it highly-rated for large portion of foods?",
    "What is the view like as I would like to dine with a nice view?",
    "Do they have good food portion sizes?",
    "Do they have internet in their rooms and is it a good connection?",
    "Is it a good value for the price?",
    "How are their price?",
    "Do you know if Finches Bed and Breakfast is known for having clean bathrooms?",
    "Is the waitstaff known for providing high quality service?",
    "Does Shiraz have good atmostphere?",
    "Do they have a nice view we can enjoy?",
    "what place and portion of food do you need?",
    "Is the staff friendly and welcoming?",
    "Are the bathrooms kept clean?",
    "Are the bathrooms spotless in this hotel?",
    "How good is the waitstaff?",
    "Is this hotel located near activities in the area.",
    "Do you know if Home from Home is in a good location?",
    "Do you know how large the serving are there?",
    "Does it have a good atmosphere?",
    "Yes, do they serve alcohol?",
    "What hotel is known for their clean rooms?",
    "Do you know whether Fitzbillies Restaurant offers nice views?",
    "Does the Saffron Brasserie serve a Korma dish that's considered a good value for the price?",
    "How are the views there?  I want a place with good views.",
    "Does the hotel provide good value for the money spent?",
    "Does The Carolina Bed and Breakfast have a nice quiet atmosphere?",
    "Is the service great?",
    "How are their breakfast options rated?",
    "Do they have big rooms?",
    "Just to be sure, can you confirm that this restaurant has a nice indoor decor?",
    "What is included in the price of a room at the guesthouse?",
    "Do they serve breakfast?",
    "Are the bathrooms clean?",
    "Which one offers the most accommodations for the listed price range?",
    "Does Graffiti restaurant serve alcohol?",
    "Do they offer large portion sizes?",
    "Does Caffe Uno have attractive interior decorations?",
    "Do they thoroughly clean the rooms? I'm worried about getting sick.",
    "Is the waitstaff considered exceptional and kindly?",
    "Do they serve pretzels and are they highly rated?",
    "Is the place convenient and accessible location wise?",
    "Does the Royal Spice serve alcohol?",
    "Do you know if Curry Prince offers nice views?",
    "Can you confirm that the Acorn Guesthouse offers me the best bang for my buck and won't be overpriced?",
    "Are they known for having spotless rooms?",
    "How are the views from the Hotpot Restaurant?",
    "Do they mention spotless rooms?",
    "Is the naan here superb?",
    "Will the staff respond promptly and pleasantly to my concerns?",
    "How much does the naan cost? I want naan that's a good value for the money.",
    "Do they have great service?",
    "Do you know if it has a nice view?",
    "Does this location serve a high quality pasta?",
    "Does it give a lot for my money?",
    "Do they serve good portion of foods?",
    "Are the rooms large here?",
    "Do they have a nice view?",
    "Do you know if this hotel is in a quiet part of town?",
    "Does it have good portions of food?",
    "Is the view nice?",
    "Does The Autumn House provide large rooms?",
    "Is the hotel quiet?",
    "Do they have yakitori at a decent value?",
    "Is this in a good location?  I would like that.",
    "Is it in a safe handicap accessible area?",
    "Is the location nice?",
    "Is this place quiet?",
    "Can you make sure there is a good vibe in there?",
    "Is the staff friendly?",
    "Do they have great service?",
    "Does the restaurant have outdoor seating?",
    "Is the food portion a good size?",
    "Do they serve decent Biryani at a reasonable price?",
    "Is this hotel in a good location?",
    "Do they have good breakfast options available ?",
    "Are the staff members happy and friendly?",
    "Do they serve large portions?",
    "Is it in a nice location?",
    "Is the bathroom here always sanitized and pristine?",
    "Are the staffs responsive and polite?",
    "Do you know if it has a nice view?",
    "Does Da Vinci Pizzeria serve quality pizza at a good price?",
    "Do they have a nice indoor decor there?",
    "Are the bathrooms sanitized daily?",
    "Could you tell me whether Efes Restaurant is in a safe neighborhood, and confirm whether it's within a short distance of other attractions nearby?",
    "Does this restaurant have good portions for leftovers?",
    "Do you know if it has stable internet?",
    "Does the hotel offer a good value for money?",
    "Is the atmosphere good?",
    "I'd prefer a really clean room, so is there one available at the cityroomz?",
    "Do you know how large their hotel rooms are?",
    "Are the serving sizes large?",
    "Are there good breakfast options there?",
    "What is the ambience like there?",
    "Does Rice House have a nice outdoor area in which to eat?",
    "Is the service great?",
    "Are the bathrooms there clean?",
    "Does the place come with a big room?",
    "Does it have a good atmosphere?",
    "Is this hotel in a quiet part of town?",
    "Does this place have a good locale?",
    "Do you know how large their guestroom is? I'd like to get a big room.",
    "Do they have a good outdoor seating area?",
    "Are the rest rooms clean?",
    "Can you please make sure the bathroom is clean?",
    "Are you certain it has great staff and service?",
    "Does the Midsummer House restaurant have good reviews on their location?",
    "Is the location nice?",
    "Do they have large potions",
    "Does Charlie Chan exist in a desirable location?",
    "Do you know if they have some good outdoor seating for patrons?",
    "Is that hotel considered a quiet place?",
    "Do you know if it has a nice location?",
    "Does the hotel have stable internet connection?",
    "Does their chef know how to make borscht?",
    "Is there a patio or other outdoor area for dining?",
    "Are the rooms clean?",
    "Do they have great staff and service? That is something I am really interested in.",
    "Is Leverton House in an area that is appealing?",
    "Does the Golden Wok serve good portions?",
    "Are they known for having a friendly staff?",
    "Will this place give me value worth what I'm paying?",
    "Does Cityroomz charge a fee for WiFi?",
    "That sounds fine, providing that a substantial Breakfast is part of the package at Acorn Guest House. Can you confirm this or provide a menu for my review?",
    "Are their portions huge? Because that's what I'm looking for.",
    "Is their service considered superior?",
    "Are there attractive interior decorations here?",
    "What breakfast options do they have?",
    "First, can you tell me whether they serve alcoholic beverages there?",
    "Are the bathrooms spotless at the lensfield?",
    "Is it a good deal?",
    "could you tell me if the bathrooms are clean there?",
    "Does Sala Thong have a great atmosphere?",
    "How close is it to modern conviences?",
    "Does this hotel offer breakfast buffet?",
    "Do they have big rooms available?",
    "Do they have a nice view?",
    "Are the rooms clean at the Bridge Guest House?",
    "Is it nicely decorated?",
    "Not yet, can you first tell me whether the University Arms Hotel charges guests a fee for using the WiFi?",
    "Do they have a wide variety of non-alcoholic drink options?",
    "Does the hotel have a clean bathroom?",
    "Do they have freshly sourced arancini?",
    "Do they thoroughly clean the rooms between guests at the huntingdon marriott?",
    "Does Curry Prince serve freshly sourced chaat?",
    "Does the restaurant have outdoor seating?",
    "How is their decor...I'd like a place with nice indoor decor.",
    "Can you tell me if they have a nice outdoor dining area?",
    "i need more non - alcoholic drinks",
    "Does it have sanitary restrooms?",
    "Is there nice outdoor dining?",
    "Does the Gonville give you good value for what you spend?",
    "Is this restaurant known for it's nice decor?",
    "Does the hotel have free WiFi?",
    "Are the rooms clean and well maintained?",
    "And do you happen to know if their rooms are cleaned thoroughly?",
    "Do they have drinks there or what?",
    "Does that location offer really comfortable beds?",
    "Does this location come with a pleasant view?",
    "Do they have a variety of non-alcholic drinks there?",
    "Does Rajmahals serve booze?",
    "Could you let me know if the Huntington Marriott Hotel has large rooms, as I really would like to stay in a large room.",
    "Do they have a nice interior decor?",
    "Can you tell me if they have delicious yellow curry?",
    "Could you tell me how this place rates on decor first?",
    "Do they have a friendly staff?",
    "Do they have nice indoor decor?",
    "Is there any type of outdoor seating there?",
    "Well, is the Rice Boat in a safe and easily accessible area of the city?",
    "Is the Biryani of good value?",
    "Looking for a room that is not cramped, is this it?",
    "Do they serve Pierogi and I only want the best?",
    "Is is in close proximity to things to do right?",
    "Could you check if the beds comfortable there?",
    "Does it have a lot of non-alcoholic drink options?",
    "Is Saint Johns a carefree relaxed establishment or is it hoity toity?",
    "Do you know how the noise level is there?  I need somewhere quiet.",
    "Does this location have free breakfast?",
    "Does this restaurant serve highly-rated lasagna?",
    "I prefer a big room. Can I get one from there?",
    "Do you know if the Slug and Lettuce is in a nice location?",
    "Do they mention having a friendly staff?",
    "Do they have good breakfast options?",
    "Is the staff pleasant and accomodating?",
    "What type of reviews do they have for bathroom cleanliness?",
    "Does that hotel come with a stable internet connection?",
    "Is it in an appealing location?",
    "Does it have a decent value?",
    "Can you make sure they have sanitary restrooms?",
    "Is it well known for its Cornish pastry?",
    "Can you first tell me please whether the rooms are clean and spotless?",
    "Do they serve the Pierogi dish?",
    "Is the location okay around the cheaper place?",
    "does the hotel provide wifi for the guests?",
    "What is the atmosphere like as that is important to me?",
    "Does this place have nice, big guest rooms?",
    "Is it in a safe location and close to fun things to do?",
    "Does the Acorn have free wifi?",
    "Does it have good breakfast options?",
    "Is this place quiet without noise that can be heard from the room?",
    "Will it be an orderly environment with no loud noises?",
    "Does this restaurant have a good view while eating?",
    "Is the staff kind?",
    "Does the dining area have nice views?",
    "Is it a soft sounding place to stay?",
    "Is this place a quiet hotel?",
    "Does the hotel have comfortable beds?",
    "Is the Worth House free of dirty rooms?",
    "Does it say anything about the breakfast being good?",
    "Before I book, I want to know what kind of breakfast options are available?",
    "Is it in a good location?",
    "Does this place have clean bathrooms in it?",
    "Is it good value for the rate?",
    "Do they have a highly reviewed waitstaff?",
    "Has the decor been updated lately?",
    "Do you know if the Curry Garden has nice views?",
    "Does Yu Garden have outdoor seating?",
    "It would be fine if it gets me the most for my money.",
    "Does this place have stable wifi?",
    "Would you please verify that there's a friendly staff at the guesthouse?",
    "Does it offer pasta with great value?",
    "Does their menu offer a high quality Monkfish?",
    "How is the atmosphere at the location?",
    "I want extremely clean bathrooms.",
    "Do you know if it has a nice view?",
    "How is the bed quality? I need a comfortable mattress.",
    "Is the alpha-milton guest house in a good location?",
    "Is this hotel in a good location?",
    "Are the rooms clean?",
    "Is the hotel considered to be a good deal?",
    "One other thing. Are the employees friendly and helpful there?",
    "Does the restaurant have a soothing atmosphere?",
    "Is the staff friendly?",
    "I'm looking for a quiet and peaceful environment for this trip. Would The Cambridge Belfry fit my needs?",
    "Is the room large and spacious?",
    "Is the Bedouin known for offering patrons a nice view?",
    "What has larger food portions?",
    "Does it have a nice view?",
    "Is it well known for its BIRYANI?",
    "Can you confirm whether Pipasha Restaurant is nicely decorated?",
    "Do they have dirty bathrooms?",
    "Do they serve non alcoholic drinks there?",
    "Yes, does the hotel have friendly staff overall?",
    "Do they have a nice outdoor dining area?",
    "Do they have clean rooms because I don't want to stay somewhere dirty?",
    "Does it have nice indoor decor?",
    "Do they have a decent selection of non-alcoholic drinks?",
    "does this restaurant have outdoor seating?  if it does, can you make the reservation for outdoor?",
    "What have previous guests said about the cleanliness of their rooms?",
    "Do they have options for non-alcoholic drink?",
    "Do they serve lots of non-alcoholic drinks?",
    "How is the Cassoulet at Cote?",
    "Are nonalcoholic drinks on the menu at Cambridge Lodge Restaurant?",
    "Well, do they at least serve alcohol there?",
    "I really want a place with a nice view...do you know if Royal Spice has one?",
    "Is Chesterton Road in a good area of town?",
    "Is this location in a good, accessible neighborhood?",
    "Do they offer a breakfast buffet or a sit down experience?",
    "Being in the east is it close to any attractions?",
    "Does this location offer customers a pleasant view?",
    "First, please check if they have a patio so I can dine outside, weather permitting.",
    "Does the lensfield hotel have good breakfast options?",
    "Does the restaurant have nice views?",
    "I'd really like a Calzone that's not too pricey.  Do they have that?",
    "Does Prezzo offer a nice view while dining?",
    "Do you know how solid the Internet connection is at Acorn Guest House?",
    "Are they close to many different things to do?",
    "make sure its clean",
    "Does this place have clean rooms?",
    "Do you know if the breakfast options at Arbury Lodge Guesthouse are good?",
    "Sure, but are they well known at Fitzbillies for their strawberries and cream?",
    "Is the City Centre North and B in a quiet location?",
    "Does the place have a friendly staff?",
    "Is that hotel one with a good location?",
    "Is this restaurant located in a good part of town and easily accessible?",
    "Is the pizza highly rated?",
    "How big are the rooms?",
    "Can you first confirm that the University Arms Hotel is located in an appealing place?",
    "Does Nandos City Centre have a top notch atmosphere?",
    "Will the view while I eat be interesting?",
    "Sorry, also can you check if their breakfast are highly rated?",
    "Is Taj Tandoori nicely decorated?",
    "Do they have outdoor seating, because that is what I prefer?",
    "Is the location nice?",
    "What is the ambience like",
    "How are the breakfast options there?",
    "Does it have big rooms?",
    "Do they offer large portions? I'm starving.",
    "Can you kindly tell me whether Saigon City offers a good selection of nonalcoholic drinks on their menu?",
    "Are the bathrooms clean?",
    "Are the surroundings there nice?",
    "Yes, please I would like a place that is quiet and peaceful.",
    "Are they pleasant inside?",
    "Are the rooms known to be really clean there? That's a priority for me.",
    "How would you rate the cleanliness of their bathrooms?",
    "Does this bistro provide a quiet and peaceful atmosphere?",
    "Is that located in a good area?",
    "Is J Restaurant located in a convenient, accessible location?",
    "Do they serve good portion sizes of food?",
    "Can you tell me if they are known for having clean rooms?",
    "Do they serve Butter Chicken?",
    "Do they have comfortable mattresses for guests with back problems?",
    "First, can you tell me whether A and B Guest House has clean rooms?",
    "Is the hotel good value for money?",
    "Does the hotel offer WiFi for those staying there?",
    "I'd like to make sure that they have clean bathrooms first.",
    "Do they have spacious rooms?",
    "Is the atmosphere pleasant?",
    "is the internet connection stable at least?",
    "Would you consider the Acorn Guest House a good location?",
    "Well, does the Hotspot serve alcohol?",
    "Is the atmosphere good?",
    "Do you know if anyone has ever mentioned them having dirty room?",
    "Do you know if it has various non-alcoholic drink options?",
    "Before we commit, has the staff been reported to be kind and friendly, i cant take a rude staff.",
    "Does this hotel have good breakfast options?",
    "Are the rooms dirty? I would prefer a place with clean rooms please.",
    "Is there a lot of noise from traffic and other rooms in this hotel?",
    "I think so, but do you know if Shiraz is known to provide good value for the money?",
    "Is this place highly-rated for large portions?",
    "Do they have a nice area for outdoor dining?",
    "Are the rooms and bathrooms cleaned everyday by maid service?",
    "Are the bathrooms dirty?",
    "Do either hotels have comfortable beds?",
    "How comfortable are the beds?",
    "Is it a good value?",
    "Domthe hotel staff have a reputation for being kind and welcoming?",
    "Is the internet connection stable during the day?",
    "Can you confirm whether the Rice Boat Restaurant has received high ratings for its vindaloo?",
    "Does the Acorn Guesthouse have a comfortable and relaxing bed in their rooms?",
    "but is the breakfast good enough?",
    "Do they have good options for breakfast there?",
    "Is the view nice?",
    "Are they known for their good service?",
    "Do you know if Da Vinci has highly rated reviews for their pizza?",
    "Is there a good variety of non-alcoholic drinks?",
    "Does the restaurant have friendly and responsive staff?",
    "Does the hotel have clean restrooms?",
    "Can you tell me if this hotel is in a good location?",
    "Do they have a strawberries and cream dish that's a good value for the money?",
    "Do you know if the Cambridge Belfry offers relaxing beds in its rooms?",
    "Could you find what kind of mattress and what thread count the linens are?",
    "Does it mention the view? Its really important that it the restaurant have a good view.",
    "Is it a safe neighborhood and within a short distance to other area attractions?",
    "Do they offer non-alcoholic drink options?",
    "Thanks. Are these rooms known to be clean?",
    "Do they have good breakfasts in the morning?",
    "Does this place have good breakfast options?",
    "Will I be able to sit outside to eat there?",
    "Are the bathrooms there kept clean?",
    "Is Curry Prince known for having high quality seafood?",
    "Are they known to have friendly staff?",
    "Do they have non-alcoholic drink options there?",
    "How clean are the rooms at this hotel?",
    "Can you tell me if they have good wifi?",
    "Does this place have clean bathrooms?",
    "How big are the food portions?",
    "Do you know if it has a good portion of foods?",
    "Do they serve large portions?",
    "What size rooms do they have?",
    "How are the staff at the location?",
    "Do they have free wi-fi, or is there a fee?",
    "How well will their employees treat me?",
    "Is it pretty accessible I really care more about its location being convenient?",
    "Before you finish booking, does the hotel have clean rooms?",
    "What is their breakfast selection like?",
    "The bathrooms aren't dirty are they?",
    "Does it have a nice view while dining?",
    "Do they have a reputation for good service.",
    "First can you tell me if they have naan and whether you get a lot for the price?",
    "What are the breakfast options available?",
    "Yes, are you positive that there's free WiFi?",
    "Is the atmosphere good?",
    "Will I be able to see something interesting through the window here?",
    "Do they have nice outdoor dining?",
    "Can you tell me if their butter chiken has highly-rated reviews?",
    "Does the Golden Wok serve good food portions?",
    "Does Curry Garden serve alcoholic beverages?",
    "Does it have strong wifi reception?",
    "Do they serve alcohol there?",
    "Does the Cafe had a well-designed interior?",
    "Does this location have a solid internet connection?  Because that's important.",
    "Can you describe their décor in detail?",
    "Is it in a good neighborhood and easily accessible? That's important to me.",
    "Could you confirm whether De Luca Cucina and Bar has outdoor seating?",
    "Are the decorations beautiful?",
    "Does Hamilton Lodge provide an Irish breakfast in the mornings?",
    "Do they have places to sit outside if you are eating there?",
    "Is this place a good value for the money?",
    "Does this location offer customers a pleasant view?",
    "We want to walk around, is this in a good area?",
    "Can you tell if they have really clean bathrooms because they is super important?",
    "Is there a friendly staff for me to deal with here?",
    "Does this hotel have large rooms with a lot of space?",
    "Doe the acorn guesthouse have good breakfast options?",
    "dos it have good value of money",
    "Do they have incredible waitstaff?",
    "How is the atmosphere?",
    "How are the reviews for its breakfast restaurant?",
    "Can I get a cheap, tasty pizza there?",
    "First can you tell me if they have a high quality breakfast?",
    "Am I getting a good value for my money?",
    "I'd like the one that has bigger rooms.",
    "Do they have outdoor seating?",
    "Is the staff friendly, polite and responsive here?",
    "Before I go ahead, can you tell me how big the rooms are that are available?",
    "make sure its clean",
    "The rooms aren't dirty there are they?",
    "Do they serve fresh Sutlac?",
    "Is their waitstaff capable of providing high quality service?",
    "Do they have a good atmosphere?",
    "Do they have delicious ma po tofu?",
    "Does the room have a lot of space?",
    "does it offer a nice view of the city?",
    "Do they have accommodating and pleasant staff?",
    "Are there attractive interior decorations here?",
    "Is Rajmahal Restaurant located in a good neighborhood that's accessible?",
    "Does it have a stable internet connection?",
    "Is the staff friendly there?",
    "Do they have a friendly and responsive staff?",
    "Are the rooms large?",
    "Oh, wait do they have clean bathrooms?",
    "In your opinion, is it one of the best options in the values for my buck?",
    "Are there good breakfast options here?",
    "Are there various non alcoholic drink options?",
    "Are the rooms spacious, because I don't want to feel cramped?",
    "Can you tell me if their bathrooms are in excellent, clean condition?",
    "Does this place have an accommodating and pleasant staff working for it?",
    "Is it in a good location?",
    "Is the bed comfortable there though?",
    "What is the cleanliness rating of the hotel?",
    "How is the staff at the Gonville Hotel?",
    "Does this place have throughly cleaned rooms?",
    "Is the location of Hamilton Lodge appealing?",
    "I'd like to find a place with aesthetic appeal and tasteful decor. Does it fit the bill?",
    "Are the serving sizes large?",
    "Is the bed cozy?",
    "Is this place known for having really clean rooms?  I don't want a dirty room.",
    "Is it easily accessible?",
    "Would you please verify that they have good breakfast options?",
    "Does Lovell Lodge have comfy beds?",
    "Is it a safe area?",
    "Are breakfast options available?",
    "Do they have comfortable beds ?",
    "Is the room dirty?",
    "Do you know if staying at Carolina Bed and Breakfast will give me peace and quiet?",
    "Will my room have lots of extra space?",
    "Does Nandos serve alcohol?",
    "Does this hotel provide a full English Breakfast?",
    "Do you know how accessible the Cambridge Belfry is?",
    "Does this hotel have a welcoming and courteous staff?",
    "Is the location good?",
    "Are the bathrooms clean?",
    "Is the location of Zizzi Cambridge close to many other different things to do?",
    "Do they have an extensive non-alcoholic drink menu?",
    "Is there a good selection of nonalcoholic drinks on La Raza's menu?",
    "Does La Raza serve alcohol?",
    "Do they have lots of space in the rooms?",
    "Do you know if it has a nice view?",
    "Is the atmosphere top notch?",
    "Which of these are better values for my dollar?",
    "Do they have clean rooms?",
    "Can I get a large room?",
    "Are the rooms spotless?",
    "If it is located in a good area, then yes, that would work.",
    "Does it have a lot of non-alcoholic drink options?",
    "Does that restaurant have nice views?",
    "What is there rating for its Naan?",
    "Does it have a clean room?",
    "Are the pizzas there a decent value?",
    "Do they mention having comfortable beds?",
    "Does the dining room have modern decor?",
    "Does it have a cozy bed?",
    "What is their nonalcoholic drink menu?",
    "Do they serve good Samosas at this restaurant?",
    "Do they have good breakfast options there?",
    "Does the gonville have a good location in town?",
    "Can a patron here see pleasant views through the restaurant windows?",
    "Do they have a nice view?",
    "Does the room have a lot of space?",
    "Which one of them has better breakfast options?",
    "Do you know if this hotel has a stable and reliable internet connection for work?",
    "Do they have a quality selection of non-alcoholic drinks?",
    "Is it in a nice location?",
    "Can you tell me if their rooms are considered large?",
    "Is the hotel a decent value compared to others?",
    "Does it have a large room?",
    "Are their bathrooms clean and spotless?",
    "Is the staff there very nice?",
    "Does the Curry Garden serve Samosas?",
    "do they have a nice location?",
    "Yes, how much is their average meal?",
    "Will they pile my plate high with food?",
    "Can you first confirm whether Little Seoul serves high-grade gimbap?",
    "Do you know if the internet is considered reliable and strong?",
    "Do you know if it has a good portion of foods?",
    "Can you tell me if alcohol is served at this restaurant?",
    "Are the staff at the hotel courteous and friendly?",
    "Are the beds comfortable?",
    "What is the decor inside like?",
    "Are the bathrooms pretty clean?",
    "Does Stazione Restaurant and Coffee Bar have a good atmosphere?",
    "Do you know if Limehouse is in a good location?",
    "Does the restaurant offer alcohol?",
    "Are the portion sizes large?",
    "Does either place have a big room?",
    "Does this hotel offer a good breakfast menu?",
    "Can you first tell me whether the indoor décor is nice at the Curry Prince?",
    "Do they serve alcohol?",
    "Are the bed and mattress comftorable?",
    "Yes, please. Does Home from Home have clean rooms?",
    "Does this place have modern and fun concepts, not outdated or gaudy indoor decor?",
    "What is the room size for the Acorn Guest House?",
    "Does the hotel provide a good value for the cost?",
    "Can you tell me whether Cityroomz is a quiet place to stay?",
    "Will I receive decent value for my money there?",
    "Does this hotel have friendly staff?",
    "Do they have a strong internet connection that I can do business off of?",
    "Do any of those places employ a friendly staff?",
    "Do they have a very tasty first meal?",
    "Does it have a good value for the cost",
    "How comfortable are the beds there?",
    "Does this location have good breakfast options?",
    "How well does housekeeping clean the rooms?",
    "Not yet, does it have comfortable beds?",
    "Is the bed there comfy or not?",
    "Please check that their drinks menu includes several non-alcoholic options.",
    "Does this place have a good atmosphere?",
    "Does the hotel have a very reliable wi-fi connection?",
    "Can you tell me if Grafton Hotel Restaurant has attractive interior decorations?",
    "Do they have a good breakfast selection?",
    "Do you know if they have omelettes on the breakfast menu?",
    "Do they offer wifi for their guests?",
    "Does this restaurant offer large food portions?",
    "Is it set in a lovely or great location for people as well?",
    "Could you also tell me if the hotel offers free wifi?",
    "Does the Cow Pizza Kitchen and Bar have nice views for patrons to enjoy?",
    "Do you know if this hotel also charge for wifi separately?",
    "Does the hotel have a stable internet connection?",
    "Does it have great service?",
    "Can you tell me if this restaurant has a nice view?",
    "Can you confirm that Acorn house has good wifi signals?",
    "In your opinion, whould I get the best bang for my buck from this place?",
    "Is this place quiet? I don’t like places that are too noisy.",
    "How clean are the washrooms kept?",
    "Are they nicely decorated inside?",
    "Is it well known for it's pad Krapow moo?",
    "Does it offer nice area for outdoor dining?",
    "What can you tell me about the quality of their quiche?",
    "Will there be a pleasant view out the window during dinner?",
    "Is Home from Home a really quiet place?  Because that's what I like.",
    "Do they have higher-quality services than most cheap hotels?",
    "Does the hotel have a good value?",
    "Are their beds comfortable?",
    "Does Jinling Noodle Bar offer nice views?",
    "How many square feet are the rooms there?",
    "Does the acorn have a large room available?",
    "Are they located in a nice area?",
    "Do they have a nice area to dine outside?",
    "Is the staff accomadating?",
    "Does this hotel have a centrally located area and is easily accessible?",
    "Tell me about the scene first. What is the crowd like?",
    "Is the indoor decor nice?",
    "i  prefer clean bathrooms",
    "Is the Lensfield Hotel in close proximity to nightlife and shopping activities?",
    "Do they have a nice outdoor area?",
    "Does the el shaddai have a friendly staff?",
    "Is the room clean?",
    "Does City Stop Restaurant have great service?",
    "Which one is well-known for plentiful food on the plate?",
    "Does this place have a big room?",
    "Do you know if it has a nice location?",
    "Does the restaurant Meghna have a high-quality Chaat?",
    "Yes, but is it true or not that they have friendly staff to deal with?",
    "can you tell me if this option has the clean bathrooms?",
    "Can I compliment the peacefulness of this hotel?",
    "Is it a place that is worth the money that I will spend?",
    "Maybe, but first can you tell me if they have a nice caprese salad there?",
    "Sure, but I'd also like to know if their decor is either fun or modern. I don't like the outdated or tacky decor.",
    "Does Alexander Bed and Breakfast have a friendly staff?",
    "Is it in a quiet location?",
    "Is the location nice?",
    "Is the bed new?",
    "Does it have good breakfast options?",
    "And would you happen to know if their staff is nice and responsive to their guests?",
    "I'd love a quiet escape. Is it in a quiet spot of town?",
    "Can you tell me what stars the room has for being clean? I don't want anything dirty.",
    "Are their beds comfortable?",
    "Can you tell me whether I'll be able to see something interesting through the Slug and Lettuce's windows?",
    "Is the internet reliable?",
    "Is the view here nice?",
    "Do they serve alcohol there?",
    "No, but can you tell me if they have a stable internet connection?",
    "Does the place have a fun and welcoming atmosphere?",
    "Are the portions big?",
    "Does it have a clean bathroom?",
    "Before you book it does this place have a quiet setting.",
    "Is the staff at this location considered friendly and efficient?",
    "Is there nice indoor decorations in Efes?",
    "Does the Autumn House have WiFi for guests?",
    "Are the bathrooms prisine and never messy?",
    "Do they have nice indoor decor?",
    "Does the restaurant have outdoor seating options available?",
    "Are the interiro decorations nice inside?",
    "Does the free wifi and internet have a stable connection?",
    "Which one has the most tempting breakfast food?",
    "Are the restrooms sanitized daily?",
    "But Curry Garden does serve alcohol, right?",
    "Does this place come with highly rated reviews specifically about the staffs general attitude towards guests?",
    "And does it have a good enough view?",
    "Is the hotel a quiet place overall?",
    "Do you know if Chiquito Restaurant Bar offers nice views?",
    "Do they serve alcohol?",
    "Does this location offer good breakfast options?",
    "Do they have highly rated enchiladas at Chiquito Restaurant Bar?",
    "How good is the service at Curry Prince? Have they had any complaints?",
    "How's their vibe? Positive?",
    "Are the beds at Warkworth House comfortable?",
    "Do you know if the Oak Bistro has a good atmosphere?",
    "Does the restaurant have a relaxing atmosphere?",
    "Is the Cambridge Belfry a quiet hotel?",
    "Does it provide a nice view of the city?",
    "Is this place known for great service?",
    "Is the vibe good, and does it have striking features?",
    "What kind of breakfast options are available there?",
    "Is the Alexander B&B a good deal dollar-wise?",
    "Are the rooms very big?",
    "Do they have cheap fondue?",
    "Is the decor nice inside?",
    "How is the staff there?  I want a place with a friendly staff.",
    "Do they offer high-grade pasta?",
    "Does Avalon have good value for money?",
    "Is it in a good location?",
    "how are the reviews on staff friendliness at this location?",
    "Is this restaurant known for it's good service?",
    "I would also like to know if Kohinoor serve alcohol?",
    "That may be okay but can you also check if their staff are known to be responsive, respectful and friendly to the guests?",
    "Are they located somewhere appealing?",
    "Are the beds there comfy?",
    "Do they serve alcohol there?",
    "Could you confirm that the Acorn Guest House has nice employees?",
    "Are their workers very nice?",
    "Is the staff friendly and easy to deal with?",
    "Does this location have a really nice inside decor?  I'm really partial to that.",
    "Also, does Hamilton serve Italian Breakfast?",
    "Are they known for their bathrooms' cleanliness?",
    "Could you confirm whether the Oak Bistro is in a good neighborhood and in an accessible location?",
    "How noisy is this option? I like quiet places.",
    "What is the size of the rooms I need a big one?",
    "Does Midsummer House offer appealing views?",
    "Are the food portions good?",
    "Are the rooms spacious?",
    "Is the staff friendly, polite and responsive there?",
    "Does this place have great service?",
    "Are their prices reasonable?",
    "How do customers rank the value of this guesthouse?",
    "I'm a stickler for good service and would like to be treated right, can you tell anything about their reputation?",
    "Does the Allenbell have an accommodating and pleasant staff?",
    "Is there nice outdoor dining?",
    "Do they offer  good portion of food?",
    "Are the beds soft and relaxing?",
    "Does it have a good feeling atmosphere?",
    "Does the Gonville Hotel have clean bathrooms?",
    "Do you know if this hotel has a relaxing mattress and bed in their room?",
    "Are they in a nice location?",
    "Do they offer other services included in the stay?",
    "Does this restaurant have many choices of non alcoholic drinks?",
    "Does this place have clean guest rooms?",
    "Are the beds there comfotrable?",
    "Sounds great. I'm also looking for a place with friendly staff members.",
    "What kind of view will my table have?",
    "I will be working on my computer. Is the internet stable?",
    "Do they have good quality beds?",
    "Does it have large rooms?",
    "Does it mention having a friendly staff?",
    "This is in a central location, and accessible to everything, right?",
    "Can you also confirm if they have a friendly staff?",
    "Does it have great service?",
    "How well are the beds rated?",
    "I'd like to have a decent view...how's the view at The Cow Pizza Kitchen?",
    "Do you know if they serve Hot Pot....high quality Hot Pot?",
    "Does the Avalon provide a reliable strong wifi connection?",
    "Do they have reliable wifi?",
    "Do they have clean restrooms there?",
    "Thank you, does this hotel have a stable internet connection?",
    "Can you find out if the restaurant has good interior decorating?",
    "How's the service at Little Seoul?",
    "Great. Do they serve alcohol there?",
    "Does this place have great service?",
    "Do they have nice interior decor there?",
    "I am a neat freak. Are the rooms really clean?",
    "Are the bathrooms spotless?",
    "Can you tell me if the staff at the Gonville are helpful and friendly?",
    "What non-alcoholic beverages does it offer?",
    "Does the restaurant serve alcohol?",
    "Can you tell me if it's quiet?",
    "Is it in a good location?",
    "Are the rooms large enough for multiple people?",
    "Are the rooms thoroughly cleaned? That's essential for me.",
    "Are the rooms clean at the Huntington Marriott hotel?",
    "Does the restaurant have a nice decor inside?",
    "Do they offer a good quality breakfast?",
    "Are there friendly staff at the Huntingdon Marriott Hotel?",
    "What about the breakfast options at the Acorn House, are the reasonable?",
    "Does it have a nice area for outdoor dining?",
    "What breakfast options do they offer?",
    "Is this place a good value for what I am paying?",
    "Is it centrally located?",
    "Do you know if it has a nice outdoor place for dining?",
    "What are the breakfast options like at the acorn guest house?",
    "Does the Alpha Milton offer pristine rooms?",
    "Does Charlie Chan serve alcohol?",
    "Does this restaurant have a modern not dated decor?",
    "Does this guest house have breakfast options?",
    "Do they have a nice outdoor dining area?",
    "Does the hotel provide good value for the money spent?",
    "Do you know if Zizzi Cambridge serves alcohol?",
    "Do they have nice interior decor there?",
    "Do they serve alcohol at the restaurant?",
    "Do they have Biryani for a good deal?",
    "Does it have a strong internet connection?",
    "Can you tell me if the Holiday Inn Cambridge is considered to be a quiet hotel?",
    "Does the A and B Guest House feature a pleasant, welcoming staff?",
    "Do they have a good feeling atmosphere?",
    "This hotel is soft sounding right?",
    "Do they have a stable internet connection?",
    "Does it have a high quality Calzone?",
    "Does their menu offer a high quality and reasonably priced Chicken Tikka Masala?",
    "The rooms are nice and big instead of claustrophobic, right?",
    "Does their menu include meatballs, and are the meatballs any good?",
    "Could you first tell me whether the Cambridge Belfry is in a location that's preferred by others?",
    "Would I be able to see something interesting through the window of the restaurant?",
    "Do you know how stable their internet connection is?",
    "Does the restaurant have any outdoor seating where customers can dine?",
    "Would you please find if it has firm mattress in the room to comfort my backpain?",
    "Are the bathrooms clean at this location?",
    "Is it in a nice location?",
    "Are the food portions good?",
    "Does it have a good view?",
    "I really want a comfortable bed so can you check to see if they have them?",
    "Does this hotel have WiFi?",
    "Does it have a nice view?",
    "Is this hotel known to be a good value for money?",
    "Do they offer any non-alcoholic alternatives to Soju?",
    "Is the indoor decor nice?",
    "Does Don Pasquale Pizzeria serve alcohol?",
    "Is this place nicely decorated?",
    "Thanks, could you also tell me whether La Raza offers patrons the chance to see nice views of the surroundings?",
    "What does the reviews say in regards to housekeeping and room cleanlines?",
    "Does the restaurant have friendly and responsive staff?",
    "If the neigborhood is safe, could you tell me about their accessability?",
    "Does it have nice indoor decor?",
    "Does it have a nice view?",
    "Do you know if the Archway House is in an area that others prefer?",
    "Does the hotel provide good value for the money spent?",
    "Do you know if The Cambridge Belfry has big rooms?  I forgot to ask.",
    "Do they offer many drinks that are non-alcoholic?",
    "Do they have really clean rooms there?",
    "I prefer a place with spotless bathrooms does this meet that requirement?",
    "Do they have large rooms at the Acorn Guest house?",
    "How quiet of a place is El Shaddai?",
    "How's the staff?",
    "Is the room spotless?",
    "Do they mention anything about having a friendly staff?",
    "Is this hotel known for their breakfast quality.",
    "Do they have good internet?",
    "Does it have a good location?",
    "Is it a good value?",
    "Do they serve kung pao chicken and is it any good?",
    "Do the reviews mention a nice relaxing vibe and atmosphere?",
    "Are there attractive interior decorations here?",
    "Does the Gonville Hotel have any big rooms available?",
    "Does the Eraina have highly rated Borscht?",
    "Which one has a better view?",
    "Are rooms at Lovell Lodge large enough for 8 people to spend some time together?",
    "Does this place have a good portion of food?",
    "Does the hotel have friendly staff?",
    "Do they have great service at this restaurant?",
    "Yes and how is the internet connection?",
    "Does the Good Luck Chinese Food Takeaway serve nonalcoholic beverages?",
    "How is the atmosphere?",
    "How big are the portions usually at this restaurant?",
    "Is Rosa's Bed and Breakfast known to be located in a convenient location?",
    "Before I do that, can you let me know if there is a bunch of non-alcoholic options for drinking?",
    "How's the view at this restaurant, I prefer something appealing?",
    "Is the view nice?",
    "Do they offer great service?",
    "Do the reviews mention clean restrooms?",
    "Can you tell me if their wifi is really good there I need to get some work done?",
    "Does a and b offer spacious suites?",
    "Are their prices reasonable?  I don't want to spend a fortune.",
    "you are very quiet?",
    "Is that a good location?",
    "Will it be easy for me to get there and back?",
    "Do they have a solid internet connection?",
    "Does it have a good reputation for cleanliness?",
    "Does it have nice interior decor?",
    "Is this place easily accessible?",
    "Is the Copper Kettle in a nice location?",
    "Can you find an average place in terms of expenses?",
    "Does Prezzo have a comfortable dining area?",
    "Do they have large rooms at Allenbell?",
    "I have a lot of luggage so do you know if the hotel has a lot of space in their room and I won't feel cramped?",
    "Is it nicely decorated inside?",
    "Is the internet connection stable and reliable?",
    "How much food do you usually get for the price?",
    "Is the location nice?",
    "Do they have a good atmosphere?",
    "Does this one provide the most accommodations for the price?",
    "Can you tell me if the Curry Garden is in a safe, easily accessible area of town?",
    "Do you know how clean the bathrooms are at El Shaddai?",
    "Does Maharajah Tandoori Restaurant serve alcohol?",
    "Is it in a nice location?",
    "Does it have a nice view?",
    "Is the room in a quiet location?",
    "Does this location offer customers a pleasant view?",
    "Is there a relaxing bed and mattress there?",
    "Can you tell me how big the rooms are at Finches?",
    "Do  they offer non alcoholic beverages?",
    "Are the servings sizes large?",
    "Is this a quiet area, I like my peace and quiet",
    "Does the Ashley Hotel have really clean bathrooms?",
    "Do you know if it has various non-alcoholic drink options?",
    "Which one has a nice area for outdoor dining?",
    "Is the view nice?",
    "That hotel rooms are clean and comfortable and aren't dirty bathrooms?",
    "Does Frankie and Bennys get high ratings for their Calzones? I want a place that does.",
    "Is it quiet?",
    "How large is the room? I'd like a big room.",
    "Can you confirm that Saigon City serves high quality chow mien at a great value?",
    "Does it have a nice area for outdoor dining?",
    "Are the rooms cleaned well? I want something spotless.",
    "Do they offer any large size rooms?",
    "Does the Avalon offer multiple options for breakfast?",
    "Is the decor inside nice?",
    "Do they mention having comfortable beds?",
    "Great, could you kindly tell me whether Saigon City is known for having a friendly and responsive staff?",
    "Are the known for their Baklava?",
    "Can you tell me anything about the atmosphere as I want someplace nice?",
    "Do you know if it has various non-alcoholic drink options?",
    "Does Da Vinci have Risotto at reasonable prices? I would like a place that does.",
    "Is there a nice outdoor space to eat there?",
    "Do they give large food portions?",
    "Sure! Does it have good value for bucks?",
    "Is the outdoor dining area nice at that restaurant?",
    "Does this hotel have good breakfast options?",
    "I need the staff to be understanding.",
    "Does the Hobson House charge a fee for wifi?",
    "Do they serve a reasonably priced Goulash?",
    "Do they have sanitized and pristine restrooms?",
    "What have your heard about their Samosas? Do they have great reviews?",
    "Do they have a patio eating zone outside the hotel?",
    "Do I get a lot of food here?",
    "Is it near all the attractions and transportation stops?",
    "Does the Alexander Bed and Breakfast have rooms that are nice and clean?",
    "Can you tell me if the view from the dining area is a nice one?",
    "Does it have a reputation for spotless rooms where housekeeping pays attention to small details?",
    "Do you know if the Alexander Bed and Breakfast has quality breakfast?",
    "Do they have nice outdoor dining?",
    "Can you confirm if they serve non alcoholic drinks?",
    "How nice are the staff over there?",
    "How big are their guest rooms?",
    "As long as they have a welcoming staff, that is important to me.",
    "Can you check if they have outdoor seating available or a patio?",
    "Do you know if Curry Garden serves a great quality vindaloo?",
    "What is the area like because I prefer somewhere that is quiet?",
    "Is this restaurant in a nice location?",
    "Is it centrally located?",
    "Does this place have clean rooms?",
    "I'd like a place that has pasta dishes that are a good value for its prices. Does the Stazione have that?",
    "Does Golden Wok have a nice view? I want something to look at while I am there’s",
    "Can you see if the staff offers nice, polite service?",
    "Could you tell me if the bathrooms are clean?",
    "I need a stable internet connection. Does it have that?",
    "Is their naan reasonably priced?",
    "Is it in a nice location?",
    "I'm really wanting some delicious grits. Does the Gourmet Burger Kitchen have them?",
    "Is this hotel located in a convenient location in town?",
    "Can you tell me if they have very clean rooms?",
    "Do they have sodas, teas and other non alcoholic drink choices?",
    "Do they have a vermicelli noodles dish that's a good value for the money?",
    "Is this hotel a good value?",
    "Does the place offer enough food?",
    "How quiet is the area and hotel?",
    "Does it have a nice indoor decoration?",
    "What is the general cleanliness of the bathrooms at the Hamilton Lodge?",
    "Are the employees friendly and helpful? I'm travelling alone and want to feel welcomed.",
    "Does it have good portions of food?",
    "Are they well known for their value for the money?",
    "Do they have free guest WiFi?",
    "i  prefer a calm and quiet environment",
    "Does it have a wide variety of breakfast options?",
    "Do they mention clean bathrooms?",
    "Does it have various non-alcoholic drink options?",
    "does the outdoor area have a nice place",
    "Sounds good but do you know if the atmosphere of the place is good?",
    "Does it have good portions for their servings?",
    "Does this restaurant have a nice area for dining outdoors?",
    "What type star rating or review does the bed itself get at this hotel? I'm looking for something plush and wonderful.",
    "How about Ghandi's Tandoori Chicken? Is it high quality?",
    "Does Zizzi Cambridge have a good atmosphere?",
    "Do they have friendly staff there?",
    "What are the breakfast options at Finches Bed and Breakfast?",
    "Is the service quality at the Golden House considered great?",
    "Can you tell me if the atmosphere is pleasant there?",
    "Can you check to see if they offer polite service?",
    "Is that the place with the clean bathrooms?",
    "Which one of them has the best indoor decorations?",
    "I'm still wondering whether the restaurant location is ideal. What would you say about that?",
    "Do they have top notch Pierogi?",
    "Will my seat have a great view?",
    "Do they offer non-alcoholic beverages here?",
    "Do they have good service because we're in a bit of a rush",
    "Does this restaurant have an outdoor seating area?",
    "Do they have a really good breakfast that they serve there?",
    "Does it have a fun and pleasant atmosphere?",
    "Is the staff kind?",
    "Is it in a safe and easily accessible area?",
    "Is the room spacious?",
    "Are the rooms there large? I don't want to feel cramped.",
    "Does the hotel have clean bathrooms?",
    "Is it like an authentic place? Not at all cheesy? I'd love to find a place with a great atmosphere.",
    "Does it have any comfortable beds?",
    "I like to eat at restaurants where the decor helps add to the experience. Are you aware of the quality of the indoor decorations at The Peking Restaurant?",
    "Are the servers kind?",
    "I have back problems do they mention having a comfortable bed?",
    "Do you know if they serve non-alcoholic drinks there?",
    "Can you confirm whether they offer a nice selection of beverages for those who don't want alcohol?",
    "Does it have nice indoor decor?",
    "I need a peaceful stay so do you know how quiet the room is?",
    "Do you know by chance if the people that work there are friendly?",
    "How are the staff rated there?  I'm a stickler for cleanliness and attention to detail.",
    "I need a quite room",
    "How much will the room cost? Is it good value?",
    "Do they have a nice view?",
    "Is their ma po tofu a good value?",
    "Does this restaurant have a good view for diners?",
    "Does this place have a strong, stable internet connection?",
    "Are the bathrooms sanitary there?",
    "Is it in an easy to get to area?",
    "Will I be getting good value for my cash here?",
    "Is the wifi reliable at this hotel?",
    "Sorry, I forgot to ask if they have a good selection of non-alcoholic drinks?",
    "Is it a good value?",
    "Are their scrambled eggs with tomatoes reasonably priced?",
    "Is their SHISA NYAMA affordably priced?",
    "Do they have an extensive non-alcoholic drink menu?",
    "Do they have comfortable beds there?",
    "Does this restaurant offer superb quality mole?",
    "OK. Now what about wifi, is there a fee for this service?",
    "I prefer one where they clean the rooms really good.",
    "Can you tell me if they have good breakfast options there?",
    "May I check if they have clean bathrooms in their rooms?",
    "Are the people who work there very nice?",
    "Does this hotel serve Italian breakfast?",
    "How big are their rooms?",
    "How do you know if the bathrooms are going to be clean?",
    "Does the Warkworth house have friendly staff working there?",
    "Do they have a decent selection of non-alcoholic drinks?",
    "Does it serve alcohol?",
    "Do they mention having large rooms?",
    "Can you get me a room that is spotless?",
    "Does the restaurant have a nice view?",
    "Do you know if the Gourmet Burger Kitchen has an outdoor dining area?",
    "Does it have clean rooms?",
    "Can you tell me whether this hotel is a quiet or noisy place, because I don't want a hectic experience?",
    "Does Cityroomz offer wi-fi for free or will I have to pay for access?",
    "How's the service regarded at Thanh Binh?",
    "How reliable is the wi-fi at the Huntingdon Marriot?",
    "Is it a good place which has a good portion of foods?",
    "I prefer a spacious room. Do they offer large rooms at the hotel?",
    "Is the Express by Holiday Inn a soft sound place to to stay?",
    "Before that, can you tell me if it has clean bathrooms?",
    "Do the reviews mention nice indoor decorations?",
    "Do they have free WiFi at Autumn House or is there a charge?",
    "Can you check whether I can get a full English breakfast at this hotel?",
    "Is it in a good location?",
    "Can you also let me know if this restaurant serves alcohol?",
    "Do they provide clean and comfortable beds?",
    "Does this hotel have any negative reviews about staff members?",
    "Does it have a good value for money?",
    "does it have clean bathrooms?",
    "How are the restrooms like at acorn, are they in good sanitary condition?",
    "I don't like noisy places; is that location quiet and calm?",
    "Is Jinling Noodle Bar in an accessible area with a good neighborhood?",
    "Is the service there good?",
    "Does Alexander bed and breakfast have big rooms?",
    "Do you think the rooms there are worth the money?",
    "Do they serve non alcoholic drinks?",
    "Do you know if this hotel has a clean bathroom?",
    "Is A and B Guesthouse worth the money?",
    "Do they offer outdoor seating?",
    "Is saint johns chop house highly rated for its large portions of food?",
    "Do you know if the Graffiti serves alcohol?",
    "Is the room spotless?",
    "Does it have a good view?",
    "How's the service at Wagamama?",
    "Are their restrooms clean?",
    "I would like something located in a nice area. Which of those 2 restaurants would you recommend?",
    "Do you know if it has a nice outdoor place for dining?",
    "Does that place have a good deal on dumplings?",
    "Is the naan a good value?",
    "Do you know if the University Arms Hotel offers WiFi for guests?",
    "Is the Carolina bed and breakfast in a quiet place?",
    "Do they have a breakfast that is a good quality there?",
    "Just before we proceed, may I inquire if it has a relaxing bed and mattress since those are the things that I prefer in an accomodation?",
    "Will I be able to find a good variety of non-alcoholic beverages?",
    "Does it have nice interior decorations?",
    "Are they known for their shepherd's pie?",
    "Do they offer breakfast options like eggs, bacon and sausage?",
    "Is there a good view?",
    "Are the rooms clean here?",
    "Does it have attractive interior decorations?",
    "I'm considering it. How friendly is the staff?",
    "Can you confirm that the Gonville Hotel cleans its rooms thoroughly?",
    "Can you make sure the hotel is in downtown area?",
    "Would you consider this hotel a place where I would get a lot for what I spend?",
    "Is the location convenient?",
    "Does the Yu Garden have a good atmosphere",
    "You for the easily accessible?",
    "I just want to make sure if they have friendly staff there?",
    "Does it serve Korma, and gives you a lot for what you pay?",
    "Is the indoor decor at Curry Prince attractive?",
    "How large are the rooms for the hotel?",
    "Do they have a strong and stable internet connection?",
    "Does the India House have a fresh source of Samosas?",
    "Do you know if they are known for having comfortable beds?",
    "Are the beds extra soft and comfortable?",
    "Does this location serve healthy portions of food?",
    "Does it have a clean bathroom?",
    "Can you tell me if the rooms are cleaned thoroughly there?",
    "Does Sala Thong have a nice area for outdoor dining?",
    "I need a stable internet connection",
    "Could I dine outdoors there, like on a patio?",
    "And how does the staff treat people?",
    "Are their a variety of non-alcoholic driinks?",
    "Do they serve large portions?",
    "does the guest house have friendly and nice staff?",
    "Do they serve alcohol?",
    "Will it be calm and quiet there?",
    "How well known are their samosas?",
    "Do they have large rooms?",
    "Do you know if the rooms there are clean?",
    "Do they have good service?",
    "I don't like to drink alcohol. Does Yippee Noodle Bar offer non-alcoholic options for me?",
    "How are the prices compared to other inns?",
    "Is the staff friendly there?",
    "Can you check to see if they have clean bathrooms because that is really important to me?",
    "Yes,, does the HK Fusion restaurant have outdoor seating?",
    "Does the Galleria have a good scenic view?",
    "I'd really like a place with fun, welcoming atmosphere...does Eraina have that?",
    "Do they non-alcoholic beverages to order?",
    "Do the rooms have a lot of space?",
    "Does it serve exceptional Samosas?",
    "Could I get a place that has a large room?",
    "Elote is my favorite side dish at Mexican restaurants. Is the Elote at Chiquito Restaurant Bar a good value for the price?",
    "Clean rooms are there?",
    "Do the reviews mention anything about a nice view?",
    "Do they have a good variety of breakfast options there?",
    "Well, actually can you please make sure the location of the venue is convenient?",
    "Is the bathroom clean?",
    "DO they have very big rooms?",
    "Is Allenbell in a good location?",
    "I'm looking for friendly people to help, can you provide any information on the staff?",
    "Are the decorations beautiful?",
    "Does the restaurant have a nice view to look at?",
    "Are the rooms spotless?",
    "Can you find out if they have hummus for a good price?",
    "Is this place highly rated for clean bathrooms?",
    "Yes, can you please check that Prezzo offers good portions of foods? Thank you.",
    "Do they have great service there?",
    "Do They have highly rated reviews for their BIRYANI?",
    "Is it considered to be a good price for what you get?",
    "Can you confirm that the bathrooms at Cityroomz Hotel are clean?",
    "Is this area considered safe and in a centralized area?",
    "Is the staff friendly?",
    "Does the hotel offer Continental breakfast?",
    "Can you tell me whether the Arbury Lodge Guesthouse is centrally placed and accessible?",
    "Do they have various non-alcoholic drink options?",
    "Can you first tell me if their rooms are large?",
    "Does it have a nice atmosphere?",
    "Will we be able to see the city while we eat?",
    "Is Curry Garden located in an accessible area with a good neighborhood?",
    "Does the Ashley have clean bathrooms?",
    "Are the room sizes there large?",
    "Is the staff friendly?",
    "Do they have superb quality tapas?",
    "Will I get a big room here?",
    "Could you tell me whether Alexander Bed and Breakfast has highly-rated breakfast menu items?",
    "Do they have a nice outdoor dining area?",
    "Do they have a pleasant outdoor dining option?",
    "Does the restaurant have a good atmosphere?",
    "Does Charlie Chan serve sweet and sour pork that's a decent value?",
    "Is the breakfast served fresh?",
    "Yeah, are they situated in a nice part of town that provides a nice outdoor eating experience?",
    "And can I inquire if the restaurant has a good view?",
    "Do they have beds that really get you a good night's sleep?",
    "Do they have a good non-alcoholic drink menu?",
    "Do they adequately sanitize their bathrooms?",
    "Is the Cityroomz easily accessible in terms of location?",
    "Do they have a selection of non-alcoholic wines?",
    "Will there be good choices for breakfast there?",
    "Is this place a good value for their prices?",
    "Does this hotel offer it's guests wifi services?",
    "Is it in a safe and convenient location there?",
    "Is The Cambridge Belfry known for its friendly, and helpful staff?",
    "Does the Curry Prince have a nice view from their tables?",
    "Not yet. I need to work during my stay, so can you find out whether El Shaddai has strong internet connection?",
    "i'd like to know whether the restaurant serves alcohol?",
    "Can you tell me if their vindaloo is a good value for the money?",
    "Does this restaurant have a nice indoor decor?",
    "Is it nice decorated inside?",
    "I don't want a dirty room, are those at the Carolina Bed and Breakfast well-kept?",
    "Does it have great service?",
    "Is it located near any other attractions?",
    "Is the service great?",
    "Does the Sitar Tandoori serve alcohol?",
    "Does this location have a pleasant atmosphere?",
    "Are the bathrooms at this place clean and sanitary?",
    "Do they mention having a large rooms?",
    "Is the area consider a good location?",
    "Does it have an appealing view?",
    "is that a quiet place?",
    "Does it offer nice views of the city?",
    "Is Cocum in a safe neighborhood and close to other attractions?",
    "Are the bathrooms at the Gonville both sanitized and pristine?",
    "Does the place have a relaxing vibe and atmosphere?",
    "Can you tell me if they have large sized rooms?",
    "Is this place in a good location?",
    "Does this Ugly Duckling have a nice area for outdoor dining?",
    "Are there good food portions?",
    "Does it have outdoor seating?",
    "Do they have a good atmosphere?",
    "Is the atmosphere good?",
    "Is there nice outdoor dining?",
    "Do they have high ratings for reasonable prices?",
    "Do either of the mention comfortable beds?",
    "Does this restaurant have a good feeling atmosphere?",
    "Does the hotel offer WiFi for guests?",
    "Yes, can you find out if Acorn Guest House has good breakfast options?",
    "Does Charlie Chan have big portion sizes?",
    "Is the Caprese salad of high quality at the Pizza Hut Fen Ditton?",
    "Is location centrally located?",
    "Is the location convenient?",
    "Does it offer large portion sizes?",
    "I need a relaxing bed to get a good nights rest.",
    "Do they offer non-alcoholic drink options?",
    "Are the people who work there nice?",
    "Is outdoor dining available at Pizza Hut Cherry Hinton, along with comfortable and pleasant surroundings?",
    "Does this restaurant have a friendly and responsive staff?",
    "Is the atmosphere of the restaurant relaxing?",
    "Sounds great but have others commented on its atmosphere and fi it is great or not?",
    "Is there a good selection of non-alcoholic drinks at the Curry Prince?",
    "Does the restaurant that serves fresh and quality Risotto?",
    "How's the service rated at the Copper Kettle?",
    "Do they have relaxing beds?",
    "Does it serve sodas, teas, and other non-alcohol drink choices?",
    "Need an place with good friendly staff",
    "How friendly is the staff there?",
    "Do they have updated decor inside?",
    "Is the atmosphere good?",
    "Is this Peking Restaurant modern and and fun to dine in?",
    "Do you know if Pizza Hut Fen Ditton offers a nice view?",
    "Your internet is very past?",
    "Does this place have good service?",
    "Do the rooms in this hotel have comfortable beds?",
    "Is the staff friendly?",
    "Does the hotel have accommodating and pleasant staff?",
    "Does Carolina bed and breakfast have clean rooms?",
    "Do you get a good value for your money here?",
    "Do they have good portions of food?",
    "Do they serve good portions of food?",
    "Do the reviews mention a relaxing atmosphere and vibe?",
    "Are the portions gigantic?",
    "What is atmosphere of the place like?",
    "How convenient and accessable is the location?",
    "Yes, do you know if the bathrooms are clean?",
    "Is either of those in a good location in town?",
    "Ok great! Does the hotel offer WiFi?",
    "Do you know if the wifi is strong?",
    "Does it have a good value for the money?",
    "Oh, is there a WiFi fee at the hotel?",
    "Does the Bangkok City restaurant serve alcohol?",
    "Does it have various non-alcoholic drink options?",
    "Do you know whether Travellers Rest offers a nice view of the city?",
    "I need it to have an extensive non-alcoholic drink menu.",
    "What do they serve for breakfast?",
    "Is the Avalon Hotel a quiet place?",
    "Is that a good place to dine in, with attractive surroundings?",
    "Which restaurant is a place to eat where you get good value for your money?",
    "Is it in a convenient location?",
    "Do reviews say they have a good atmosphere?",
    "Are the bathrooms at Acorn Guest House clean?",
    "Is this place known for having a relaxing bed for a good nights rest?",
    "What are the service and staff reviews like for these two locations?",
    "Is the hotel known for having clean bathrooms?",
    "That is still fine, but is it large enough as per my preference?",
    "Are the employees friendly?",
    "No, but I would like to know if they have large portion sizes?",
    "Does this restaurant serve alcohol?",
    "I'm looking to have fun. Is this located in a good part of town?",
    "Is that internet stable?",
    "Does The Lensfield Hotel have good breakfast options?",
    "What are the food portion sizes there like because I want a lot of food for the money?",
    "Do the tables come with a nice view?",
    "Does it have friendly employees and welcoming staff ?",
    "Sound good, how the location?",
    "Could you tell me if they have quality guacamole?",
    "Do the reviews mention anything about a good atmosphere?",
    "Yes, what type of atmosphere does that restaurant have? I'm looking for something with a good atmosphere.",
    "Are the outdoor seating options good?",
    "How's the service at La Tasca?",
    "One more question. How is the web connection there?",
    "How much does this hotel charge for WIFI?",
    "Is their staff friendly?",
    "Have the rooms been thoroughly cleaned?",
    "Is it considered inexpensive for the area?",
    "Does the restaurant serve non alcoholic drinks at all?",
    "Does it have free wifi?",
    "Does the restaurant have nice decor?",
    "Do they have professional waitstaff there?",
    "Does the restaurant have outdoor seating options?",
    "Is it well known for it's acords dish?",
    "Is it a good value for the money?",
    "Are the rooms large there? I prefer somewhere with a lot of space.",
    "Are the Kirkwood's staff always welcoming to guests?",
    "Are with of these in a quiet area?",
    "Do they have any large rooms available?",
    "Does this restaurant have a well reviewed wait staff?",
    "Is the staff friendly at that hotel?",
    "Are the places quiet?",
    "Do they have a nice area for outdoor dining?",
    "What is the atmosphere like?",
    "Do they have a fee for WiFi?",
    "Do you know if they provide clean bathrooms?",
    "Do they happen to serve any alcoholic beverages at this pizza place?",
    "Did you say that the WiFi was free?",
    "Does it have a nice view?",
    "How's their virgin drink menu?",
    "Is that restaurant in a good location?",
    "Does it offer a wide variety of breakfast options?",
    "Do you know if it has a good portion of foods?",
    "Do they have good atmosphere?",
    "Would you tell me which one has a friendly staff to deal with?",
    "Is that hotel in an area that is preferred by lots of people?",
    "Can you tell me if they have alcoholic beverages on the menu?",
    "Is Saigon City in a nice area of town?",
    "Can you tell me if the Curry Prince gets high ratings for their Dosa? I would like a place that does.",
    "Does it have a nice view?",
    "Does it have a nice view?",
    "Is this hotel know for it's staff hospitality?",
    "Do they have a Continental breakfast?",
    "Does this restaurant have a good atmosphere?",
    "Is the room clean?",
    "Is the staff at the worth house friendly?",
    "Do they have a good portion of food sizes?",
    "Do they mention having clean restrooms?",
    "Does the hotel provide decent value for the cost?",
    "Is there any praise online for their breakfast cooking?",
    "Can you tell me whether the Pizza Hut Fen Ditton is in a nice location?",
    "Does this place have clean bathrooms?",
    "does the  place have nice indoor decor.",
    "Pipasha Restaurant has a good view, yes?",
    "Are the rooms very clean?",
    "Do the reviews mention anything about a nice atmosphere?",
    "Is the staff trained well and friendly?",
    "Their Kafta better have good ratings.",
    "Are the other guests quiet?",
    "Great, is WiFi free for guests?",
    "doe they have a non alcoholic drink menu that is large?",
    "Also an Italian place with great outdoor dining.",
    "Is free  WiFi  offered for guests?",
    "I really want a guesthouse with friendly staff, does Rosa's have that do you know?",
    "Are the beds comfortable?",
    "Does it serve alcohol?",
    "How well does this lodge maintain their bathrooms?",
    "Does it have nice outdoor seating?",
    "Is it pleasant inside?",
    "Is that the best value for the price?",
    "Does the restaurant serve alcohol?",
    "Does it mention having clean restrooms?",
    "Before I do, does it offer clean rooms?",
    "What are some of their non-alcoholic drink options?",
    "Is the atmosphere good?",
    "Do they have nice outdoor dining?",
    "How is the internet there?  Is the connection stable?",
    "Does the Arbury Lodge a large and tasty breakfast service?",
    "Does it have a nice view?",
    "Do they have good breakfast options?",
    "Do they mention a stable and reliable Internet connection?",
    "Do they have good breakfast options?",
    "Do they serve alcohol as well?",
    "Can you look and see which one has the strongest internet signal.",
    "Is there alcohol service available?",
    "Does it have a good feeling atmosphere?",
    "Is there a good and stable internet connection at this location?",
    "is it quiet? because that is what I need.",
    "Are the rooms cleaned routinely and thoroughly?",
    "How clean is the bathrooms?",
    "Is there outdoor seating at the restaurant?",
    "Could you tell me whether Saffron Brasserie has a great selection of non-alcoholic drinks?",
    "Is the Quiche a good value and quality?",
    "Do you know if any outdoor seating is available at Curry Garden?",
    "Is the staff and service good?",
    "Can you check to see if they have large rooms?",
    "Does this place have stable internet connections?",
    "Does alexander bed and breakfast charge a fee for WiFi?",
    "Is the hotel centrally placed and accessible to surroundings?",
    "Are there good food portions?",
    "Does it have a good location?",
    "is this property a good value for the money I'm spending?",
    "Do they have clean bathrooms?",
    "Is the location a good one for this hotel?",
    "Is that in a good area of town?",
    "Is there a strong internet connection there?",
    "Do you know if this hotel has comfortable beds?",
    "Yes, could you tell me if the staff is friendly and accomadating?",
    "Does this place have clean rooms? I prefer one.",
    "Do you have information on good breakfast options?",
    "Does this restaurant also offer a variety of non-alcoholic beverages?",
    "Does the Gardenia serve alcohol?",
    "Does it have stable wifi connection?",
    "Is it located in a safe neighborhood and in a location close to other attractions?",
    "Are the beds of good quality?",
    "Do you know if Lan Hong House serves a high quality sweet and sour pork?",
    "Are the all the restrooms sanitized and pristine?",
    "Do they have a good atmosphere?",
    "Is there a fun, welcoming atmosphere here?",
    "Is the staff friendly and easy to deal with?",
    "Do they have good sized food portions?",
    "How's the interior decor at the Missing Sock?",
    "Do they have a nice area for outdoor dining?",
    "Is this hotel really quiet?",
    "Will the bathrooms there consistently be clean?",
    "The business has a nice place to eat outside right?",
    "Do they have staff that is fast, flawless and friendly?",
    "What is the staff like as I want to eat somewhere where I am treated right.",
    "Is it considered good value for the price?",
    "First can you tell me if they clean their bathrooms regularly? That is really important to me.",
    "Are clean bathrooms expected at that place?",
    "Do they mention having clean bathrooms?",
    "Is the hotel quiet?",
    "Can you tell me if Finches Bed and Breakfast has vegan options for breakfast?",
    "I need a quiet and comfortable rest while i'm there, can you tell me if it is known for that?",
    "Do they have great quality baklava available?",
    "How big are their rooms?",
    "Does it have a nice view?",
    "Is the place easily accessible?",
    "Does this restaurant have beautiful decorations?",
    "Sounds fine, would you happen to know if they have a welcoming and fun atmosphere or not?",
    "Is it in a place with a good view?",
    "Does the Cambridge Belfry have large rooms?",
    "And is the Internet connection stable?",
    "Are the bathrooms frequently deep cleaned?",
    "Are the employees helpful and friendly?",
    "Does Darry's Cookhouse and Wine Shop serve a good Quiche that is not too expensive?",
    "Is alcohol served there?",
    "Is it with good staffs?",
    "Does Cocum happen to have outdoor seating?",
    "Does it have a nice relaxing vibe and atmosphere?",
    "Does this hotel offer Wi-Fi for guests?",
    "is outdoor seating possible ?",
    "What about the beds, are they comfortable?",
    "Does Charlie Chan serve generous portions of food?",
    "Does the staff at this hotel get a high rating when it comes to friendliness and customer service?",
    "Are the portion sizes good?",
    "Can I enjoy a good Risotto without having to spend a lot there?",
    "Does it have various non-alcoholic drink options?",
    "Is the staff accomodating and pleasant?",
    "Yes is there a good web connection from the room booked?",
    "Does this place offer comfortable beds?",
    "Can you tell me whether the Alexander Bed and Breakfast is a good value for the money?",
    "Do you know if the Bridge Guest House has cozy beds?",
    "Do they have great service?",
    "My favorite dish is Chaat. Will I find top notch Chaat at Curry Garden?",
    "Will I have options to drink if I am not drinking alcohol?",
    "There are people, including myself, in my party that do not drink alcohol. Does HK Fusion offer a variety of non-alcoholic beverages that we could enjoy?",
    "Is the place in a well liked area?",
    "Does it serve Dumplings, and gives me a lot for what I pay?",
    "Are nice views available at The Hotpot?",
    "Do they have big rooms?",
    "Do they have a good breakfast selection?",
    "do either restaurants have beautiful decorations?",
    "Is the staff friendly?",
    "Is it in a quiet location?",
    "Do they have clean rooms?",
    "I should have asked, what about the quality of service there -- is it pretty good?",
    "Is it in a convenient location?",
    "Will there be a stable internet connection?",
    "Do the rooms there also have comfortable beds?",
    "Is it in one of the upscale areas of the city?",
    "Does the Saigon city have a chow mein on the menu that is not too expensive?",
    "Does this place have a welcoming vibe to it?",
    "The mattress quality is important to me, can you provide any information about the bedding?",
    "Does this location offer rooms with lots of space?  Because I don't want a cramped room.",
    "Before I book a room, I'd like to know is this hotel is in a good location?",
    "Do you know if Home from Home has highly-rated breakfast items on their menu?",
    "What about their drinks menu; do they serve alcoholic beverages?",
    "Does this hotel offer continental breakfast?",
    "Do either of them have a comfortable mattress to sleep on?",
    "I was also wondering how nice the staff was?",
    "What will I see out the window while I eat?",
    "Does this place have excellent wifi?",
    "Are the rooms in the hotel cleaned thoroughly?",
    "Do you know if they have a good reputation for clean rooms?",
    "Which one has the most welcoming vibe?",
    "Does that restaurant have outdoor seating?",
    "Do they have a good outdoor area?",
    "Do the reviews mention nice indoor decorations?",
    "Which of them is in a better location?",
    "Actually I need a room with a new mattress, it is a must.",
    "Thanks. Can you tell me if the restaurant is located in a safe and easily accessible part of town?",
    "Is the atmosphere good?",
    "Is the view appealing?",
    "Is it located in a nice area?",
    "Do they have a nice view?",
    "Is this restaurant in a safe and accessible part of town?",
    "Does it serve kunefe with good value for the money?",
    "Does this restaurant serve heaping portions of food?",
    "Cool, and would you know if they have excellent service that is also a key point of their dining experience?",
    "What is the indoor decor like as I would like to dine someplace with an attractive interior?",
    "Does this restaurant serve alcohol?",
    "Do they serve large portions here?",
    "Can you make sure I get a large room booked?",
    "Do you know if the Missing Sock offers great views of the city?",
    "Do they serve alcohol?",
    "Are the portions a good size?",
    "Are the course sizes especially large?",
    "Does it happen to have large rooms?",
    "Is the location nice?",
    "do they serve alcohol ?",
    "Does this hotel have a good value for the price?",
    "Is this a quiet area, I need some good rest",
    "Does it have high ratings for clean bathrooms?",
    "Before that, do you know if they have great portions for their meals?",
    "Does this location have large rooms?",
    "Can you tell me if this location is known for having large rooms?  That is what I want.",
    "Is the service at La Tasca high quality?",
    "How are the food portion sizes?",
    "Are their staff famous for their customer service?",
    "Do the reviews mention anything about helpful and friendly employees?",
    "Does it have good breakfast options?",
    "Are decent food portions served at the Slug and Lettuce?",
    "Do they mention having clean bathrooms?",
    "Are the rooms large?",
    "I'm looking for some delicious Ramen. Does Wagamama serve it?",
    "Is this hotel a good value for the money?",
    "Does this place have friendly, polite and responsive staff members?",
    "I'm hoping there will be a free breakfast for us at Ashley hotel",
    "I need the staff to be really nice.",
    "Does this restaurant have striking features with a good vibe?",
    "Which one serves spring rolls at a great value?",
    "Does the restaurant offer outdoor seating?",
    "Do they clean the room thoroughly and maintain good hygienic condition?",
    "Is this restaurant accessible and located in a good neighborhood?",
    "Does it have a nice atmosphere?",
    "Not yet, could you first tell me whether the Bridge Guest House is centrally placed and accessible?",
    "Which one would provide the cleanest bathrooms?",
    "Is the service great?",
    "Are you able to tell me if the Express by Holiday has a stable internet connection for its guests.?",
    "Is it in a good location?",
    "Does the Lucky Star have really good scrambled eggs with tomatoes?",
    "How nice is the location?",
    "Does the Hobsons House have a good breakfast selection?",
    "How often are the rooms deep-cleaned?",
    "I would like to dine somewhere with a nice atmosphere so can you tell me anything about that?",
    "Are their staff friendly with all their guests?",
    "Are the beds comfortable there?",
    "Do they have nice indoor decor?",
    "Can you check if this restaurant has a great selection of non-alcoholic drinks to choose from?",
    "Is this restaurant in a convenient and accessible location?",
    "Is Curry Prince known for its staff and good service?",
    "Is is a un welcoming restaurant?",
    "I wouldnÕt bring my car. I just need a clean room, what is the housekeeping rating?",
    "Is staying here a good value?",
    "Does it give you enough food to feel satisfied?",
    "Is the staff friendly there?",
    "How good is their indoor décor?",
    "If they are generous with portions, I'm interested. Can you find that information?",
    "How is the Internet connection there?",
    "Do you know if the Acorn Guest House serves an Italian breakfast?",
    "I want something with a view of the water.",
    "Do you know if it has good atmosphere?",
    "Is this restaurant known for it's service?",
    "Does it have quality dumplings at a good price?",
    "Can I get a room with a large floorplan?",
    "Can I order alcohol at the restaurant?",
    "Please make sure that the room I get is very clean, I have allergies to dust.",
    "Do they have good breakfast choices?",
    "I need to make sure there is a stable internet connection.",
    "Does it have a good value?",
    "Yes, please tell me about the restaurant's location; is it in a nice area?",
    "Does it have great staff and service there?",
    "Can I get a big room?",
    "Does this restaurant have a nice decor?",
    "Do they have friendly staff?",
    "Is Charlie Chan known for serving heaping portion sizes?",
    "I need the place to have good service.",
    "I'd like to make sure it's quite, though.",
    "How clean are the bathrooms there? I need a place that rates high for this category.",
    "Do they have a really high quality breakfast there?",
    "Does this place have large food portions?",
    "What is the interior decor like at Curry Garden?",
    "Does the hotel have clean bathrooms?",
    "The hotel needs to have a high rated breakfast, does it?",
    "Does it have high ratings for its bouillabaisse?",
    "Will I have plenty of breakfast dishes to choose from?",
    "First, could you tell me whether they offer good value with ample portion sizes?",
    "Is this a good value?",
    "Is it a good value for money option ?",
    "Does Autumn House offer rooms that are large in size?",
    "Do they have a nice vibe?",
    "Does this restaurant serve alcohol?",
    "Does the Ashley hotel have accommodating and pleasant staff?",
    "Is there a reliable and consistent internet there?",
    "Sure does it have a comfortable bed?",
    "I'd like to know if it's in a good location first.",
    "What size are the rooms? I really want a large one.",
    "Thank you, does this hotel have staff that is friendly?",
    "i need a  place that is decorated very nicely.",
    "Do they have good service?",
    "How is the service at Dojo Noodle Bar?",
    "Is this hotel a good value for the price?",
    "Do they have a nice indoor dining area?",
    "Which one of those restaurants serves arancini at a reasonable price?",
    "Does this location offer customers a pleasant view?",
    "Is it at a good location overall?",
    "Do you know if Graffiti offers a nice view of the city?",
    "Oh, and one more thing. Is the Acorn Guest House a good value for the money?",
    "Are their rooms cleaned thoroughly?",
    "Is it centrally located?",
    "Are they known for good service?",
    "Can you first tell me if they are a nice place for outdoor dining?",
    "Can you tell me if they are located in a nice area?",
    "Does the hotel offer WiFi for guests?",
    "Can you confirm whether Graffiti has various nonalcoholic drinks?",
    "Do they give you a good value for the money?",
    "Is the staff well trained to be friendly, fast and flawless?",
    "I need to have a comfortable bed so can you see if they have those there?",
    "Are the serving sizes large here?",
    "How is the service?",
    "Does the Aylesbray Lodge Guest House has a warm and welcoming staff?",
    "Do they have a superb quality of chaat here?",
    "Do they offer an exceptional breakfast?",
    "Do they provide Italian breakfasts?",
    "Can you check to see if they have comfortable beds?",
    "Do you know if it has great service?",
    "How does it compare in terms of value for money?",
    "Do you know if the rooms there are big?",
    "I need to make sure the bathrooms are clean.",
    "Do you know if the Huntingdon Hotel has good options for breakfast?",
    "Are they careful about keeping the bathrooms clean?",
    "Do they have a clean bathroom?",
    "Do they mention having strong and reliable Wi-Fi?",
    "Is there a nice view from this restaurant?",
    "In your opinion, am I getting the best bang for my buck?",
    "Is the place quiet?",
    "Can you also find out if there is a charge for wifi?",
    "Would you say it is in a good area?",
    "Does Allenbell have very comfortable beds?",
    "Before trying that, do they serve alcohol?",
    "Is it in a safe and easily accessible place?",
    "Is the service amazing?",
    "Is there a decent area for outdoor dining there?",
    "Do they have friendly staff at A and B guest house?",
    "Is the view there appealing?",
    "Is the internet connection strong there?",
    "Is there fresh Dosa there?",
    "Are the rooms quiet there?",
    "Does the restaurant serve alcohol?",
    "Wait, can you also check if the WIFI they have is good as well?",
    "Does the room have a cozy bed?",
    "Is it a good place if I want a really quiet room?",
    "Is it in a nice location?",
    "I need a strong internet connection. Does it have that?",
    "Can you provide some more information about the atmosphere?",
    "Are their rooms clean and spotless?",
    "Does Panahar serve a Chaat dish that's a good value for the price?",
    "Do they serve large portions?",
    "Are the food portions here big?",
    "Can you tell me if Gourmet Burger Kitchen is highly rated for giving large portions?",
    "Do they have various non-alcoholic drink options there?",
    "Do they have various non-alcoholic drink options?",
    "Do you know if this bed and breakfast have big rooms?",
    "Does it have 5 star service from their staffs?",
    "Do they have comfortable beds?",
    "Is it a quiet area?",
    "Are the staff there friendly, polite and responsive?",
    "Is the Leverton House known for being quiet? I want peace.",
    "Do they have pasta that is a good value for the money?",
    "kindly advice the bathroom facility, i think its ditty",
    "Can you tell me more about price and amenities?",
    "Do they have friendly staff at the Cambridge Belfry?",
    "Does it serve alcohol?",
    "Do they have a reliable internet connection?",
    "Does The Huntingdon Marriot have big rooms?",
    "How is the place, is it a good value for the money?",
    "Do they have a friendly staff?",
    "Do they serve alcohol?",
    "Do they have a good atmosphere?",
    "Do they serve generous portions here?",
    "Do they offer large rooms at arbury lodge?",
    "Do you know if it has a nice area for outdoor dining?",
    "Does this hotel have a good breakfast menu?",
    "Do they have reliable internet?",
    "How are the rooms in regards to cleanliness?",
    "Do they mention anything about a friendly and helpful staff?",
    "Do they mention a stable and reliable internet connection?",
    "Does the guesthouse have a reputation for immaculate rooms and housekeeping?",
    "Does the Autumn House offer a lot of amenities for the price?",
    "Is that a nice location?",
    "I don't want a dirty room. Does The Acorn Guest house have clean rooms?",
    "Do you know if it has good portion of foods?",
    "Does this place offer a nice view of the city?",
    "Do you know if Hotel du Vin and Bistro would give me interesting views from its windows?",
    "Are they in a nice location?",
    "i prefer good internet",
    "Is it in a good location?",
    "Is this place a good value for the money?",
    "Does this place have a good breakfast selection?",
    "Yes, I need to find a room with a lot of space.",
    "I need a restaurant within a safe nieghborhood.",
    "Does this restaurant serve alcohol?",
    "Is the location a good one?",
    "Does the restaurant have a mellow atmosphere?",
    "Which place is considered a better value?",
    "is this hotel a good value for the money?",
    "Does the place have friendly and well trained staff?",
    "Is the food portion a good size?",
    "Does the hotel charge a fee for WiFi?",
    "Is it good value for the rate?",
    "Does the hotel offer a wide variety of tasty breakfast options?",
    "Do they have a good atmosphere?",
    "Is it centrally-placed and accessible",
    "Does the restaurant serve alcohol?",
    "That depends. Is the Alexander considered to be a good value for the price?",
    "Expensive price range, so can we expect stable internet connection?",
    "Does this hotel have solid internet connections?",
    "Is it highly rated for large food portions?",
    "I'm a germaphobe, are the bathrooms cleaned pretty well?",
    "In your opinion, does it offer a decent value for the money?",
    "Does Good Luck have good service?",
    "Does the City Centre North B and B have clean rooms?",
    "Is the internet reliable at the Huntingdon Marriot?",
    "Do they have friendly staff?",
    "Is it close to other shops and attractions?",
    "Does Fitzbillies have decent food portions?",
    "Which of these guests houses are considered easily accessible?",
    "Can you tell me if the Lucky Star has outdoor seating available?",
    "Does Royal Standard serve alcohol?",
    "Does da Vinci pizzeria have good service?",
    "Can you tell me if one has bigger rooms than the others?",
    "Is there outdoor seating offered?",
    "I need somewhere that has a solid internet connection.",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Does Kohinoor have modern and fun indoor decor?",
    "is the hotel in a good location?",
    "To be clear, they have a good internet connection or WIFI? It's urgent that I have a good strong connection for work and personal matters.",
    "How are the non alcoholic drinks there?",
    "Which one has the better service?",
    "Can you tell me if they have high quality pasta there?",
    "I have a lot of luggage, so I need a large room to not be cramped. Do you know how large the hotel rooms are?",
    "Does the restaurant serve alcohol?",
    "Is that place in a good location?",
    "This isn't a place with dirty rooms?",
    "I'd prefer a big room if they have it.",
    "I'm looking for some steamed mussels that aren't far too expensive.",
    "Does Panahar offer outdoor seating?",
    "Do they charge a fee for using the WiFi?",
    "Is it inexpensive for the area?",
    "Is it in a good location?",
    "Do they offer korma with great value?",
    "Does it have an attractive interior design?",
    "Does this hotel have a kind and helpful staff?",
    "What is their staff like as I want to stay somewhere where the staff is friendly?",
    "Does the Aylesbray Lodge guest house have great location in the city?",
    "How are their staff? Are they friendly?",
    "Can I get an Irish breakfast at the hotel?",
    "Are the rooms kept clean there?",
    "Is the staff friendly?",
    "Are the rooms very clean here?",
    "Can you find out if it's possible for me to book a big room there?",
    "Is the staff friendly?",
    "Are the staff at Worth House considered friendly?",
    "Is the hotel quiet even though it is in the center of the city?",
    "Is this hotel a good value for the price?",
    "How's the staff quality at the Royal Spice?",
    "Are the staff welcoming?",
    "How friendly and knowlegable is the staff there?",
    "Do they have a nice view?",
    "Does it have actual 4 star or 5 star value for money?",
    "Do they have outdoor seating?",
    "Do they have great service there?",
    "Does Cityroomz have a comfortable bed?",
    "Do they have nice indoor decor?",
    "Do you know if the hotel has a friendly and courteous staff?",
    "I need more information about the Nandos City Center. What can you tell me about the portion sizes of the food there?",
    "Does Golden Wok serve dumplings that are a great value?",
    "Does this place have a friendly staff?",
    "Do they have reliable internet?",
    "Before I commit, does it have nice indoor decor so we can enjoy the atmosphere?",
    "Does the restaurant have a good view?",
    "Is the Allenbell in close proximity to activities to do?",
    "And does it have a strong internet connection?",
    "Does it have a good atmosphere?",
    "Are the portion sizes large at Yippee Noodle Bar?",
    "Does the Acorn offer free breakfast?",
    "Can I be certain I'll get a clean room there?",
    "I need a friendly staff to accommodate me. How nice are the staff?",
    "Does it have a wide variety of sodas, teas and other non alcohol drink choices?",
    "Do they get good reviews for cleanliness?",
    "The price is okay, but not all of us are 21. Do they have a menu with non-alcoholic drinks for our non-drinkers?",
    "Does this restaurant have outdoor seating?",
    "Do they keep the hotel quiet?",
    "Does they have beds that are comfortable there?",
    "Can you tell me are they known to have clean bathrooms?",
    "is the breakfast tasty?",
    "Is the view appealing at Galleria?",
    "Do they have a nice area for outdoor dining?",
    "Will I be able to get a seat with a nice view?",
    "About that restaurant, can you find out whether they offer a place to eat comfortably outdoors?",
    "is it conveniently located?",
    "Is this restaurant known for its great service?",
    "Do either of these locations serve a high-quality, reasonably-priced Tandoori Chicken?",
    "Great, does this hotel serve Irish Breakfast?",
    "Are the rooms pretty much clean there?",
    "Does this place have clean guest rooms?",
    "Can you tell me about the options that they have for breakfast?",
    "Do they have highly-rated reviews for their reasonable prices?",
    "Is the atmosphere good?",
    "Is this hotel good value for money?",
    "Is it good value for the money I'm spending?",
    "Are the beds there comfortable?",
    "I want a place that has high ratings for its caprese salad.",
    "Please check which option offers a better value for money.",
    "Are the staff helpful?",
    "Does it mention anything about the staff? I'm looks for good service",
    "How do they rate on cleanliness?",
    "Does this place have a friendly staff?",
    "The accommodations are easily accessed right?",
    "Does it have a comfortable bed too?",
    "Does the hotel have easy access?",
    "Are the beds comfortable?",
    "Is it a good place where I'll get good value for my money?",
    "Do they have both good alcoholic and non alcoholic drink choices?",
    "Do they have a breakfast buffet?",
    "Does it offer a good value for the price?",
    "Is the service great?",
    "What type of service do they usually provide to their guests?",
    "Do they have a nice area for outdoor dining?",
    "How's the quality of the King's College Fiorentina Steak?",
    "Do you know anything about the staff, such as if they are nice and welcoming?",
    "Which location has the better service?",
    "The restaurant has striking features correct?",
    "Does the table have a nice view?",
    "Do they also have clean and well maintained bathroom?",
    "Does el shaddai have clean bathrooms? This is a must for me.",
    "Is their kung pao chicken a good value for the money?",
    "Does it have good portion of foods?",
    "Could you tell me about the decor there?",
    "Do I have to pay for Wi-Fi access on the hotel premises?",
    "Which hotel has the most comfortable beds?",
    "Do they have a strong internet connection there?",
    "Do they have a welcoming vibe?",
    "Does Oak Bistro have a pleasant inside?",
    "Does this place have a big room?",
    "Do they have warm and welcoming staff?",
    "First can you tell me if the bathrooms are clean?",
    "Is the room large?",
    "Do you know which of A and B Guesthouse or Avalon has friendlier staff?",
    "Is it in a nice location or near any attractions?",
    "it needs to have great breakfast options",
    "Do either of the restaurants serve  alcohol?",
    "Is this place in a good location?",
    "What mass transit service is close to the guesthouse and how walkable is it to local attractions?",
    "Does Prezzo have a nice outdoor patio I can dine at?",
    "Which one provides decent value?",
    "What portion sizes does this restaurant offer?",
    "Are there good breakfast options there?",
    "Does worth house have friendly staff?",
    "Do they have clean bathrooms there?",
    "does this place have good breakfast options?",
    "Do you know if the hotel has friendly staffs?",
    "Is the service quality good?",
    "Can you also find out if they have a highly-rated breakfast menu items?",
    "Does this place have good breakfast options?",
    "Can you find me a nice place outside of town?",
    "Are they known for providing a relaxing atmosphere?",
    "First, do you know if the beds are comfortable at the Ashley Hotel?",
    "Do you know how good the breakfast options are at the Ashley Hotel?",
    "Does the University Arms Hotel provide clean bathrooms for its guests?",
    "Are the beds there really high quality?",
    "Does this place have good service?",
    "That sounds great. Is the staff friendly at the hotel? That always makes for a better stay.",
    "Is it considered to have a good value?",
    "Do they have large rooms?",
    "Does The Lucky Star offer outdoor seating?",
    "Are the mattresses good?",
    "Is the restaurant location in a safe part of town?",
    "Do they have nice views here?",
    "How clean are the rooms rated for the El Shaddai Hotel?",
    "Do they have good portion sizes here?",
    "Are there good choices for breakfast?",
    "Will it be too noisy there?",
    "Which one has the most attractive outdoor seating area?",
    "I need a place with good ambience.",
    "Is that the best deal for my money?",
    "Does it have a large room?",
    "First, tell me if the place has nice decor",
    "Which of them serve the most non alcoholic drinks?",
    "Do they have relaxing beds?",
    "Are they good at keeping the noise level low?",
    "Does this particular place come with comfortable beds?",
    "Is there alcohol serve there?",
    "Will I get a relaxing bed and mattress here?",
    "Do yo know if they are known for having clean bathrooms?",
    "Do they provide good value and service?",
    "Is the service is really good there?",
    "Does this hotel have big rooms?",
    "Do they keep the rooms spotless?",
    "Can you let me know if the bathrooms are cleaned well at the Lensfield?",
    "Is this hotel known for it's staff's kindness?",
    "Does Ali Baba offer patrons a view of nice surroundings?",
    "How big are the food portions from Two Two?",
    "Does it have a  nice view?",
    "Can you find out whether their free internet is reliable and consistent?",
    "Does the hotel provide a buffet for breakfast?",
    "Yes. I need to know how quiet the rooms at el shaddai are, please.",
    "Before I book, can you tell me if the Ashley Hotel have a stable internet connection?",
    "Is alcohol served at Nandos?",
    "Does this hotel provide an Irish breakfast?",
    "Is the El Shaddai a quiet place?",
    "Do they have a nice view of the city?",
    "Is Nandos located in a safe and easily accessed area?",
    "Does the restaurant have outdoor seating?",
    "Does this hotel offer WiFi to guests?",
    "Does Pizza Hut Fen Ditton have good views?",
    "Does the Express have good ratings for cleanliness, specifically clean bathrooms?",
    "Is the area where the hotel is located a good area?",
    "Is the place in a good location?",
    "Do they serve alcohol there?",
    "Do they have relaxing beds and mattresses?",
    "Is it in a good location?",
    "Do they serve a reasonably priced Waffle?",
    "Are the bathrooms cleaned every day?",
    "Is the cleaning staff diligent about vacuuming the rooms?",
    "Wait, I need more information. Does this hotel have friendly staff working there?",
    "Does Kohinoor offer interior features that are nice to look at?",
    "I need to make sure that the room is spacious enough to suit my needs. Do you know how large the room are at Hobson House?",
    "Is the bathroom really clean?",
    "Does it have a nice outdoor dining area?",
    "Does the Bedouin offer a chance to dine outdoors, in the fresh air?",
    "Can you tell me if there is a good view while dining in?",
    "Is the service good at Ali baba?",
    "Will I get a great deal for my money spent?",
    "as long as the warkworth house has a good value to it",
    "Is the view nice?",
    "Does the hotel have comfortable beds?",
    "Would you say that they have a good atmosphere for dining?",
    "Can you please reserve a large room?",
    "Is the WiFi good there?",
    "Do you know if the City Stop Restaurant has a good atmosphere?",
    "Do they have good breakfast options?",
    "Does La Margherita have a feelgood atmosphere?",
    "Will you tell me if they offer big rooms?",
    "As long as it well know for a good value for the money. That's important.",
    "Is this in a safe neighborhood, close to other attractions?",
    "Do the reviews mention quality pizza?",
    "Does the A and B guesthouse offer comfortable beds for their guests?",
    "Do they have gigantic portions for me?",
    "Does it have a nice view?",
    "Is this a place with comfortable beds?",
    "Can you make sure the room I get is quite spacious, I feel claustrophobic in small rooms.",
    "Is their waitstaff capable of providing efficient and high quality service?",
    "Does the room have a cozy bed?",
    "Is alcohol served at this restaurant?",
    "Is it good value for the rate?",
    "The first one sounds good. Is the room going to be clean there?",
    "Do they have a big room available?",
    "Are the beds designed to be extra comfortable?",
    "Do they offer many options for breakfast?",
    "Does the hotel have a solid internet connection, it is important.",
    "Is the place nicely decorated?",
    "Do you know if they have nice indoor decor?",
    "Do they mention anything about a stable and reliable Internet connection?",
    "Does the place serve various non-alcoholic drink options?",
    "Is there a great selection of non-alcoholic drinks?",
    "Is that place worth the money?",
    "Is this restaurant known for having nice indoor decor?",
    "Is the location for the Autumn House in a pretty good area?",
    "Is that centrally located?",
    "Do they give you a decent value for what you pay here?",
    "Does this restaurant have attractive interior decorations?",
    "Do they have a nice view?",
    "Does that hotel come with really big rooms?",
    "Is the internet good?",
    "Does that place have some good breakfast options?",
    "Does Finches have good breakfast options?",
    "Does the Autumn House have clean bathrooms?",
    "Do they have Arancini? I love that but only if it’s the best.",
    "Does this restaurant serve alcohol?",
    "I don't have a car, so is it close to activities?",
    "Do you know if the Gonville is known to provide a calm and quiet environment for guests?",
    "How nice is the location for Sala Thong?",
    "Is it a good value?",
    "Is the indoor decor considered modern?",
    "Can you tell me a bit about the view from the Sesame Restaurant and Bar?",
    "Do the reviews mention anything about nice indoor decorations?",
    "Does this hotel have rooms with clean bathrooms?",
    "Does it have a clean bathroom?",
    "Do they have good breakfast options?",
    "Does the Allenbell have large hotel rooms?",
    "Is it in an area which is generally preferred by others?",
    "Are the staff friendly?",
    "Is Ugly Duckling situated in a good location?",
    "Are they in a nice location?",
    "How do other guests rate the cleanliness of the rooms?",
    "I would love a place that offers a relaxing and fancy atmosphere, does this place offer that?",
    "Does it have a good selection of non-alcoholic drinks?",
    "Is the free internet WiFi?",
    "It depends. Do they serve excellent goulash there?",
    "What is the atmosphere of the restaurant considered?",
    "Is it a good value for the price?",
    "Do they have a reputation for spotless rooms?",
    "Do they offer a nice view of the city because this is going to be a special night?",
    "How is the atmosphere? I need a place with a good ambiance.",
    "Is this hotel known for it's clean rooms?",
    "And which of them has the biggest rooms?",
    "Does it offer a nice view of the city?",
    "Do you know if Aylesbray Lodge Guest House has reliable internet service?",
    "Do they mention having comfortable beds?",
    "Is this place in a good location?",
    "I need to know if the El Shaddai provides extremely clean bathrooms.",
    "Do they have a decent selection of non-alcoholic drinks?",
    "Is it a good dining place with nice indoor decoration?",
    "Do they offer non-alcoholic drink options?",
    "Is it a decent value for what you pay there?",
    "Would you say it is in a good location?",
    "Does this restaurant have a nice view?",
    "Are there clean bathrooms at the Acorn?",
    "Clean bathrooms is a must for me. What is the reputation of this hotel in regards to clean bathroom?",
    "Do they have a good selection of non-alcoholic drinks?",
    "Does this restaurant offer alcohol?",
    "Does Home From Home feature a wide variety of breakfast options?",
    "Have there been any complaints about the friendliness of the staff at this bed and breakfast?",
    "Do you know if it has various non-alcoholic drink options?",
    "Does the restaurant offer a variety of non-alcoholic beverages?",
    "Are the rooms cleaned after every guest checks out?",
    "Are the portions big?",
    "Does the Arbury lodge guesthouse have comfortable beds?",
    "Does it have a nice outdoor dining area?",
    "Do they offer exceptional catering and have kind staff?",
    "What type of amenities will I get for that price?",
    "Do they serve Freshly sourced Alheira?",
    "Is it really quiet there I need silence?",
    "Is Restaurant Two Two in a good neighborhood that's accessible?",
    "Does it offer good portions of food?",
    "How frequently are the bathrooms cleaned?",
    "Is there an outdoor patio for when the weather is nice?",
    "Does this location offer a nice view through the windows of the restaurant?",
    "Does this place have a nice view?",
    "Do you know if the University Arms Hotel offers a peaceful environment in the rooms?",
    "Does Oak Bistro offer outdoor dining with comfortable, pleasant surroundings?",
    "Do you know if it has a nice outdoor place for dining?",
    "Is the Acorn centrally located?",
    "I really want some Sweet and Sour Pork but it needs to be high quality. Does Yippee have it?",
    "Do they have a nice relaxing vibe and atmosphere?",
    "Do they have a good breakfast?",
    "I'm a neat freak, can you confirm for me that the rooms at the Avalon are very clean?",
    "Is there an outdoor patio so I can eat outside?",
    "How large are the biggest rooms?",
    "Is this in a highly desirable location?",
    "Is this place in a noisy setting? I would like something more on the quiet side.",
    "Can you give me the price range of 4 stars hotel in the area and Warkworth house pricing?",
    "How are the non alcoholic options?",
    "Do they have a nice view?",
    "Also, do they have outdoor seating there?",
    "So is there a fee for wifi or is it free?",
    "Does it have large rooms?",
    "How large are the rooms?",
    "I need some good nourishment in the morning, so do they have a good breakfast menu?",
    "Do they serve alcohol in the restaurant?",
    "Are the rooms really big for the arms hotel?",
    "Can you make sure the place has a stable internet connection?",
    "Does the Riverside Brasserie offer a fun, welcoming atmosphere?",
    "Is the staff friendly?",
    "Is the staff there friendly?",
    "Are they well known for plentiful food on the plate?",
    "Could you tell me if the restaurant has any outdoor seating options?",
    "Do they have a good non-alcoholic drink menu?",
    "Do you know if Cow Pizza Kitchen and Bar offers great service?",
    "Are the staff friendly?",
    "Can you tell me if they have highly-rated reviews for their reasonable prices?",
    "Do they have comfortable bed ratings?",
    "Does this location have a pleasant atmosphere?",
    "Is that hotel in a good location?",
    "Is there a good variety of breakfast options there?",
    "What can you tell me about the staff because I want to stay somewhere where the employees are nice?",
    "Does it have a nice location?",
    "Are they known for their korma?",
    "I need an fast wifi speed during my stay, can you please advise me the speed of the internet?",
    "Do you know if it has a nice location?",
    "Does the place come with a clean room?",
    "Is there free breakfast?",
    "Is the outdoor dining nice?",
    "Can I get a large room?",
    "Yes do they serve good breakfast?",
    "Which of those have the most welcoming vibe?",
    "Does the restaurant have a good atmosphere?",
    "Do they have a nice dining view?",
    "How do others rate the location?",
    "Is it a quiet place to stay?",
    "Yes, can you tell me if the rooms are clean?",
    "Is it a good value for the price?",
    "Would you tell me if they have delicious dosa?",
    "Does it have a good atmosphere?",
    "Is it in a safe and convenient area?",
    "How are the beds reviewed?",
    "Does the Hamilton Lodge have friendly staffs?",
    "Do any of them mention having a good breakfast?",
    "Do they have nice outdoor dining area?",
    "Do they have a good location?",
    "I prefer a good breakfast, does this have that option?",
    "Does it have a comftorable bed?",
    "Can you confirm that Thanh Binh has striking features and a good vibe inside?",
    "Does this hotel give you a lot of space in the room to spread out?",
    "I need to know if they have tapas that get good ratings first.",
    "Do the reviews mention having good breakfast options?",
    "Does it have a comfortable bed?",
    "Are any of those locations known for having clean and spotless rooms?",
    "First tell me if they thoroughly clean the rooms here?",
    "How good is the service?",
    "Do they have yummy breakfast?",
    "Is La Tasca situated in a nice location within the city?",
    "Which of those is a better value?",
    "Does the Golden Curry have a good variety of non-alcoholic drinks?",
    "Is the room large and spacious?",
    "Does it have good service?",
    "Is the internet a good connection?",
    "Does the hotel provide decent value for the cost?",
    "Does this restaurant offer good outdoor seating?",
    "Are they known for having bathrooms that are in perfectly clean condition?",
    "Do they serve reasonably priced pasta?",
    "Do either of the reviews mention a welcoming vibe?",
    "Could you tell me how solid the Internet connection is at Express by Holiday Inn Cambridge?",
    "Does the internet work well there?  I need to have a stable connection.",
    "Yes, can you check whether there's an outdoor dining option, something nice and cozy?",
    "Also, could you check if they have comfortable beds in the room?",
    "Are the staff pleasant and accommodating there?",
    "What does their breakfast selection look like?",
    "Is this a good location?",
    "Do other guests rate their bathroom cleanliness as high?",
    "Before that please make sure it has a stable internet connection.",
    "Does this hotel have good breakfast options?",
    "Does the finches bed and breakfast have spacious rooms?",
    "Does this place have big rooms?",
    "Does it have a nice view?",
    "Is there any outdoor seating at the restaurant?",
    "Are their rooms spotless?",
    "Is the Royal Spice in a decent spot at least?",
    "Does The Avalon have a quiet atmosphere?",
    "Do they provide comfortable beds?",
    "Do they have a quality selection of non-alcoholic drinks?",
    "Do you know if the Belfry is a quiet place to stay?",
    "Does it have a nice view to look at?",
    "How are their breakfast options?",
    "Is the location good?",
    "How stable is the internet connection there?",
    "Does this restaurant have a happy, friendly feel?",
    "Are nice indoor decorations available at Ugly Duckling?",
    "Do they offer a nice view of the city?",
    "does the place have a good portion of foods",
    "What is the scenery like there -- I want a nice view while I dine.",
    "Are they known for good service?",
    "Is this hotel in a place that is located somewhere appealing?",
    "What have other guests said about the quality of the wifi?",
    "Are the staff there friendly, polite and responsive?",
    "Is there a nice city view from the tables?",
    "Are any of its breakfast dishes popular on social media?",
    "Can you confirm that the rooms at Alexander Bed and Breakfast are large?",
    "Yes and is it the most expensive hotel?",
    "Does this place have big guest rooms?",
    "Does it have any policies on noise levels?",
    "does the grafton hotel restaurant have good table service",
    "Does this location provide healthy servings of food?",
    "Does it serve alcohol?",
    "Does this restaurant serve alcohol?",
    "Will the staff make me feel welcome there?",
    "I like friendly people is the staff friendly?",
    "Do you know whether the Gonville Hotel's employees are friendly and helpful?",
    "The bathrooms aren't dirty are they?",
    "Are the staff there warm and welcoming?",
    "Does The Varsity Restaurant have a top notch atmosphere?",
    "does the hotel have good breakfast options?",
    "Is City Stop Restaurant known for providing great service?",
    "Can I get the best dumplings in town here?",
    "Are the rooms clean at Lovell Lodge?",
    "Are the rooms big at that hotel?",
    "How large are the portion sizes at The Varsity Restaurant?",
    "The accommodations are easily accessed right?",
    "What's their banh cuon like?",
    "Are their beds comfortable?",
    "Do they have a nice outdoor seating area?",
    "How big are their rooms? I want a big room.",
    "Can you check on the ratings for their lasagna because I want the best?",
    "Does this hotel have a good breakfast menu?",
    "Do they serve decently valued Hot Pot there?",
    "When do the bathrooms get cleaned?",
    "It is decorated nicely on the inside?",
    "Is it in a good location?",
    "Do they serve large portions?",
    "Does it have a nice outdoor dining area?",
    "First, can you please advise if that place is a good value for the money?",
    "Are the beds comfortable?",
    "Does the breakfast served at this hotel get five star reviews?",
    "How are the portion sizes at the Graffiti restaurant?",
    "Is the place decorated nicely?",
    "How does it compare in terms of value for money?",
    "Is the service great?",
    "Are the rooms super clean?",
    "How is the outdoor seating area?",
    "Is the indoor decor nice?",
    "Are they decorated very nicely?",
    "Can you confirm for me whether Hobson's House has highly-rated breakfast menu items?",
    "Are the bathrooms well kept there?",
    "Yes, do they have a nice view for diners to enjoy?",
    "Do they have a decent view despite their price?",
    "I forgot to ask, is the lensfield  location, centrally-placed, and accessible?",
    "Which one of those has the best rating for cleanliness?",
    "Does this place have quiet rooms?",
    "Do they offer free breakfast?",
    "Are the mattresses comfortable?",
    "Could you first tell me if they serve alcohol there?",
    "Does it offer big rooms as well?",
    "Do they have reliable internet? I need to work while there.",
    "Does this place have excellent wifi?",
    "Do you know if it has a nice outdoor place for dining?",
    "Is this hotel nicer than the price suggests?",
    "Is this location silent and not noisy?",
    "Is the indoor decor nice?",
    "Does it have nice indoor decor?",
    "Is it quiet?",
    "Is breakfast free",
    "May I check if they have friendly staff members?",
    "Does the Arbury Lodge Guesthouse have highly-rated breakfast options?",
    "One more question, are the bathrooms clean there?",
    "First i need to know how often they clean and sanitize the bathrooms.",
    "I'm looking for a spotless room, how are they rated on cleanliness?",
    "Do they offer a high quality Falafel?",
    "Can you find out for me if Little Seoul has high-quality kimchi?",
    "Are the bathrooms clean?",
    "Do you get a lot for what you pay here?",
    "Is it in a nice location?",
    "Do they have a nice and clean bathroom?",
    "Could you tell me what the reviews say about their staff?",
    "Does the hotel offer Wi-Fi for its guests?",
    "Does this restaurant serve alcohol?",
    "Is there a fee for WiFi?",
    "Is all the staffs there as friendly as you?",
    "Will the drive there be quick and convenient?",
    "Does it have friendly staff?",
    "Can you also check to see if they provide good breakfast options?",
    "Will you tell me if they have a good location?",
    "How sanitized and pristine are the restrooms at Rosa's Bed and Breakfast?",
    "Also, does the bed and breakfast have clean rooms overall?",
    "Do they have large rooms?",
    "Is it located in a good part of town?",
    "Do they have great service?",
    "I also need a place with clean restrooms",
    "Is the service great?",
    "Are the breakfast options good?",
    "Are the staff there friendly, polite and responsive?",
    "Do they have a nice outdoor dining area?",
    "Is the staff well trained to be friendly, fast and flawless?",
    "Does this place have a lot of amenities?1",
    "Which one of these restaurants offers great scenery to enjoy with my meal?",
    "Do they have large portions? We're so hungry from travelling.",
    "It doesn't have gaudy decorations, does it?",
    "Does it have an outdoor dining area?",
    "Are they known for attractive interior decor?",
    "Can you tell me what stars the bathroom has for being clean? I don't want anything dirty.",
    "Do either of those offer comfortable beds as I really want to sleep well while I am there?",
    "Do they have various non-alcoholic drink options?",
    "Is it good dining place that also has a good atmosphere?",
    "Is this a quiet place?",
    "The location doesn't matter. But does it have friendly staff and good service?",
    "Do they have a friendly and helpful staff?",
    "How big are the portions of food? I was hoping for a place with good portion size.",
    "Do they serve alcohol there?",
    "Is it a nice and quiet place?",
    "Are the bathrooms disinfected and cleaned on a daily basis?",
    "Is it a big room?",
    "Is the first meal good ehre?",
    "I'd like a good selection of non-alcoholic drinks. Does this fit the bill?",
    "Is the staff known to be nice?",
    "What are some of their breakfast options available?",
    "Does this hotel have a stable internet connection?",
    "Does maid service clean the rooms daily?",
    "Do they have CAPRESE SALAD that's affordable?",
    "Do you know if it has a nice view?",
    "Does this restaurant have outdoor seating?",
    "Does this place have great service?",
    "Do they have great service?",
    "Is it worth the money?",
    "Are the beds comfortable?",
    "Is this hotel a good value for the money?",
    "Does Anatolia restaurant serve alcohol?",
    "Do they have highly-rated breakfast menu items there?",
    "Are the restrooms at Acorn Guest House well-maintained?",
    "I'd love a quiet escape. Is it in a quiet spot of town?",
    "Do they have a nice view there?",
    "Is the staff nice and friendly?",
    "Does the hotel charge a fee for WiFi?",
    "Is the room spotless?",
    "Does it have a welcoming vibe?",
    "Does the restaurant have outdoor seating?",
    "I must be sure that Worth House is situated in a quiet, peaceful area.",
    "Can you tell me if its bathrooms aren’t dirty?",
    "How comfortable are their mattresses?",
    "Can you confirm their beds are of the highest quality & tell me what kind they are?",
    "Do they give you a spacious room to stay in?",
    "Do they serve decently priced Gazpacho there?",
    "Do they serve large portions?",
    "Are the portions big?",
    "Is it a decent value for what you pay there?",
    "Is there a nice indoor decor?",
    "Is the atmosphere at the Slug and Lettuce nice?",
    "Do they have a strong, stable internet connection?",
    "A well trained and welcoming staff is important to me. Is the staff at the Autumn House known for being friendly?",
    "Before you do that can you confirm whether Kymmoy offers good views?",
    "Does Rosa's Bed and Breakfast offer breakfast?",
    "Does the place have clean and spotless rooms?",
    "Do they have friendly staffs?",
    "Before you do that, could you tell me whether Curry Prince serves alcohol?",
    "Great, but do you know if they have good breakfast options?",
    "Do they have outdoor seating?",
    "Do they offer large portions?",
    "Is this place quiet?",
    "Does it have a nice outdoor area for dining?",
    "Will I see the city's sights out the window?",
    "Is it a quiet place?",
    "Do you know if Wagamama has nice views?",
    "i need a  location that's pleasant inside",
    "Do they have good portions of food?",
    "Is it good value for the rate?",
    "Is the room a pretty decent size there? I'd like a big one.",
    "Do you know if they have outdoor seating there?",
    "Do they have larger rooms available?",
    "Is there a wifi fee",
    "Do they have a friendly staff there?",
    "Can you confirm that the Cambridge Chop House is in a good location?",
    "I'll need the internet to be stable. Do you know if this location has internet that doesn't go down?",
    "Is it considered a great value?",
    "Do they offer good value for the price at alpha-milton guest house?",
    "Can you tell me if they have comfortable beds?",
    "Can you tell me first if they're known for great service?",
    "Is it a good location?",
    "Are they known for their clean rooms?",
    "Can you confirm that the A and B Guest House offers beds that allow for a great night's sleep?",
    "May I check if they have a friendly staff?",
    "Does City Stop have many different non-alcoholic beverages?",
    "Yes, does this hotel offer Italian breakfast for its guests?",
    "Is it a great place for what it is worth?",
    "Are the bathrooms clean at hamilton lodge?",
    "Are the places quiet?",
    "Can you tell me whether Cote has a nice outdoor dining area?",
    "Do you know if it has great service?",
    "Does the Ashley Hotel provide Irish breakfast?",
    "Is that hotel located in a good location for travelers?",
    "What values will I get from the Huntington Marriott?",
    "Can you first confirm that the Cambridge Belfry offers a calm and quiet environment?",
    "Do they give you a large room?",
    "Do they have large portions? I'd really like to have leftovers.",
    "is it truly in a good location?",
    "Is the hotel in a good location?",
    "Does the restaurant have a view of any unique sites?",
    "Which restaurant has a nice location?",
    "Yes. How spacious are the rooms?",
    "Which one offers the best Spanakopita for the price?",
    "Do the reviews mention anything about the interior decoration?",
    "Is the staff very kind there?",
    "I want to see the sights and go out for a nice dinner while I am there. Is the Hamilton Lodge located in an area that will be convenient for me to get around the city?",
    "Is the Golden Wok known for serving big portion sizes?",
    "Does Frankie and Benny's have a nice area for outdoor dining?",
    "Do they have outdoor seating?",
    "Is their Cornish pastry just a good value for the money?",
    "Will they give me a lot for my money?",
    "Is this place a good value for what I'd be paying?",
    "Does the Acorn guest house have good breakfast quality?",
    "Is this considered a nice location?",
    "Do they have an extensive menu of non alcoholic beverages?",
    "Are the restrooms pristine?",
    "Do they charge extra to use the wifi there?",
    "Do they serve alcohol at Alibaba?",
    "It does have non-alcoholic drinks, right?",
    "Is the wifi service reliable?",
    "Are they both in good locations?",
    "Do you know if Graffiti's reviews mention reasonable prices?",
    "Are the mattresses in the hotel room firm?",
    "Does this hotel offer a good value for the money?",
    "I'll require a strong internet connection will there be one?",
    "Is free WiFi for guests included with the room price?",
    "Is the staff there friendly, polite and responsive?",
    "Are the portions big?",
    "Is Yu Garden known for having great service from its staff?",
    "I would like to go sightseeing after dinner. Is Da Vinci Pizzeria in a good location close to popular sites?",
    "Does it have clean bathrooms?",
    "How is the service?",
    "Do they mention anything about reliable wifi?",
    "Great! One last thing, Do they have a good amount of different breakfast options?",
    "First I would like to know if they have big rooms available?",
    "Does it have a clean bathroom?",
    "Does La Tasca serve decently sized food portions?",
    "Do they offer generous portions of food?",
    "Only if it has a four star or better atmosphere.",
    "Is that place a good value for the money?",
    "I'd prefer if the rooms are big do you know?",
    "Does it serve continental breakfast?",
    "How comfortable are the beds at Cabridge Belfry? Can you tell me what the room or bed comfort rating or review are there?",
    "Do they have great service?",
    "How high-quality are their spring rolls?",
    "Do they have good breakfast options?",
    "Do they have delicious guacamole?",
    "Is the outdoor dining appealing?",
    "Is the staff known for being friendly?",
    "Oh and can you please tell me how big the room is?",
    "Is it pleasant inside this restaurant?",
    "Before you make a reservation, can you tell me if the Royal Spice seves alcohol?",
    "Is the place very clean?",
    "Do they have great portions of food there?",
    "That sounds great, is the breakfast American style?",
    "Are the staff trained to be friendly?",
    "Do you know anything about them having clean rooms?",
    "Are the portions good if you have a big appetite?",
    "Is it located in a nice area?",
    "Does the restaurant have various non alcoholic drink options?",
    "Do you know Alpha-Milton hotel? Does it offer really good values?",
    "Can you tell me if Gourmet Burger Kitchen serves alcohol?",
    "Is the hotel quiet?",
    "Is there a hotel within the same price range in this area with a better rating?",
    "Do they have large portions?",
    "Does Royal Spice have nice indoor features for patrons to look at?",
    "Is the staff friendly?",
    "Can you tell me anything about their WiFi service, because I need it to be excellent?",
    "Can I rely on the internet connection there?",
    "Are the portion sizes generous?",
    "Is that the best deal available?",
    "Do they have friendly and responsive staff members?",
    "Does this place have a spot for free breakfast?",
    "How clean are the bathrooms at Acorn Guest House?",
    "Does the Ashley offer breakfast options?",
    "What non alcoholic drinks do they have?",
    "Will the staff help me out with anything I need without making me feel awkward?",
    "Are they known for clean bathrooms?  That's important to me.",
    "Does it have a nice location?",
    "Does that restaurant have outdoor seating?",
    "Does the hotel have high ratings for its customer service?",
    "Are you familiar with their decor inside, is it decent?",
    "Do they have large rooms available? I require a spacious area so that I don't feel crowded during my stay.",
    "I'm really hungry, can you tell me if they're known for large portions?",
    "Yes, does the hotel offer free wifi?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Does it have an attractive interior design?",
    "Is it a good place to just relax and chill?",
    "How is the atmosphere here?",
    "Do they have a good non-alcoholic drink menu?",
    "Do they charge a fee for wifi or is it free?",
    "Not yet, can you check if their rooms are clean and don't have dirty bathrooms?",
    "Do they have an appealing view?",
    "Can you say that it serves top notch Dumplings?",
    "Do they have excellent wifi there?",
    "I need a place for good outdoor dining please.",
    "Does Fen Ditton have reasonably priced Bolognese? I would like for it to have that.",
    "Do people say the staff have good attitudes?",
    "I need to work. Do they have good wifi?",
    "I just want to make sure, will there be non-alcoholic drink options for my children?",
    "Is there a warm and welcoming staff here?",
    "Do they have good beds? I am really picky about beds, I want the one that I can sleep good.",
    "What are their restrooms like according to reviews?",
    "Does the Curry Prince serve korma that's a good value for the money?",
    "Does Restaurant Alimentum have incredible waitstaff?",
    "Can you check to see if anyone mentions them having really comfortable beds?",
    "Are the portions big?",
    "Is there allot of space at this hotel?",
    "What sort of decor does Chiquito have, Mexican?",
    "How's the service?",
    "Do they have large size rooms?",
    "How's the service quality at the Curry Prince?",
    "Do they have comfortable beds?",
    "Is the atmosphere pleasant to dine in?",
    "Despite the price, is the gyoza at Wagamama high-quality?",
    "Can you make sure its been thoroughly cleaned first?",
    "Is the staff nice there? I prefer them to be friendly.",
    "is there a wifi fee ?",
    "Is the indoor decor nice?",
    "Is this location in a nice neighborhood?",
    "Do you know if it has a nice outdoor place for dining?",
    "Can you tell me if the Hotpot serves spring rolls that are a good value for their price?",
    "What's the view like from a table by the window?",
    "Are they known for their friendly and helpful staff?",
    "Is the neighborhood safe there and within a short area of other places in town?",
    "Do you know which of these hotels has friendlier employees?",
    "Do they have comfortable mattresses so I can sleep well?",
    "Is this place well equipped for outdoor seating?",
    "Does it have large portion sizes for food?",
    "Are the beds comfortable there, I'd strongly prefer that?",
    "Is it a hotel that is pretty quiet?",
    "Are the employees very nice and friendly?",
    "Do they have a nice interior decor?",
    "Do you know if Rosa's Bed and Breakfast has welcoming staff?",
    "Can you check their menu to see if they offer a good variety of non alcoholic drinks?",
    "Is the Autumn House a quiet place?",
    "I've got to have a comfy bed. Can you check that please?",
    "Do they serve a good breakfast?",
    "Does the Huntington Marriott Hotel have a reputation for having a friendly staff to assist during my stay?",
    "Is the location good for shopping with lots of place to eat and there is mass transit available within walking distance?",
    "Is it good value for the rate?",
    "Does this place offer large serving sizes of food?",
    "Do they serve large enough portion sizes to satisfy a healthy appetite?",
    "Does the Alexander provide Full English breakfast?",
    "Would you make sure the rooms are spacious, please?",
    "Does this hotel offer a good value for the price?",
    "Does this hotel provide a good reliable internet connection for zoom?",
    "Are they located in a nice location?",
    "Does the place have clean rooms?",
    "Does the Fitzbillies Restaurant provide a quality service for your dining experience?",
    "Are the bathrooms cleaned daily?",
    "Is the lensfield known for helpful and friendly employees?",
    "Do they have great service?",
    "Do they serve high quality paella there?",
    "Does this hotel come with clean and not dirty bathrooms?",
    "Is there good views around it?",
    "Could you please check to see if the restaurant serves alcohol?",
    "Does Pizza Hut City Centre serve a great selection of non-alcoholic drinks?",
    "How is the internet there?  I want a place with stable internet.",
    "Do they have a really nice staff at the hotel?",
    "Is it in a quiet area, I need a very quiet room",
    "Are you able to see if they have great service there?",
    "Is the room clean in your hotel?",
    "Do they offer various non-alcoholic drink options?",
    "Do they have great service there?",
    "Do they have Irish breakfast menu at The Acorn Guest House?",
    "Do they have stable internet?",
    "Do they serve large portions here?",
    "Do they have a nice indoor decor?",
    "How big are the rooms?",
    "Do they have high quality lasagna for a good value?",
    "How stable is their connection?",
    "Is there a nice atmosphere there?",
    "Are the bathrooms clean?",
    "I prefer a nice view. Does this restaurant have a nice view?",
    "Which one has the biggest food portions?",
    "Do they have good portions of food there?",
    "Does it have reliable and consistent internet?",
    "Is  Backstreet Bistro in a good neighborhood and accessible?",
    "Is the outdoor seating area nice?",
    "Is that Fitzbillies in a good location? I need to impress a client.",
    "Is this in a good location?",
    "How comfortable are the beds at A and B Guest House so I can get a good night's sleep?",
    "Do they have non-alcoholic drink options?",
    "Do they have non-alcoholic drinks?",
    "Is this hotel a good value for my money?",
    "Can you tell me if the rooms there are considered highly clean?",
    "Do you know if it has great service?",
    "Do you know if it has good portion of foods?",
    "Are their breakfast options good?",
    "Do they have rooms with comfortable beds?",
    "Do they have a good atmosphere?",
    "Do they have warm, soft beds there?",
    "Can you tell me how solid the Internet connection is at the Acorn Guest House?",
    "Do you know if they serve alcohol?",
    "Do you know if it has a nice outdoor place for dining?",
    "Yes, but before I book, do you know if they have a nonalcoholic menu? There are some people who are underage in our party.",
    "Does this place have clean bathrooms in it?",
    "OK, Do they have large rooms? I need a large room.",
    "Is it a good value?",
    "Do they have a quality selection of non-alcoholic drinks?",
    "The place has a friendly staff right?",
    "Does Saigon CIty serve alcohol?",
    "Do they have a nice selection of non-alcoholic drinks?",
    "Do you know if the Ashley Hotel is known for their breakfast quality?",
    "Are the portion sizes really big?",
    "Does this location have a pleasant atmosphere?",
    "The inside has nice decor to look at, right?",
    "Is the Gonville Hotel in a good area for travelling?",
    "Is the location convenient?",
    "Do you know whether the Oak Bistro offers a decent seating area for outdoor dining?",
    "Does Warkworth House have any kind of outdoor seating?",
    "Does Worth House offer very clean rooms to its customers?",
    "Do you know if Da Vinci Pizzeria serves freshly sourced Fiorentina steak?",
    "Can you tell me if the hotel is in a good location?",
    "Can you first tell me if they are known for having really clean bathrooms?",
    "Are the rooms big?",
    "Yes, does this guesthouse have a clean bathroom?",
    "Does it have a nice view/",
    "Does this hotel offer a comfortable bed to sleep in?",
    "Do they serve reasonably priced SCRAMBLED EGGS WITH TOMATOES?",
    "Can you tell me which one has dumplings that are a good value for the money?",
    "I like places that have good breakfast, is this a place that has good breakfast?",
    "How are their food prices in general?  I want a reasonably priced meal",
    "Does the pub have a nice view?",
    "Is it conveniently located?",
    "Is the staff there friendly?",
    "Do you know if they have a friendly staff?",
    "How's the selection of non-alcoholic drinks at Panahar?",
    "It may, are the beds good quality to give a good night sleep?",
    "Yes, can you make sure the rooms have pristine clean bathrooms?",
    "Is the hotel quiet?",
    "Do they offer alchohol?",
    "Is this place nice and quiet?",
    "Can you tell me if they have a bar there?",
    "Do they have a pleasant, outdoor dining section?",
    "Are the beds and mattresses relaxing?",
    "Do they have a nice area for dining outdoor?",
    "Does it have a nice view?",
    "Does city centre north b and b have clean restrooms?",
    "Is it in a safe neighborhood and close to other attractions?",
    "Will I get a better experience than you would expect for the money?",
    "Just one thing. Are the rooms spacious at the Autumn House?",
    "Do they at least have a friendly staff?",
    "Do you know if the hotel is quiet?",
    "Does the Acorn Guest House have free breakfast?",
    "How good are the views around the Golden House?",
    "Are the portions large?",
    "Does Acorn Guest House provide a continental breakfast?",
    "Neat, can you check if Hk fusion also has a great view for its diners?",
    "Is it in a nice location?",
    "We'd like to eat outside, so does this restaurant have outdoor seating?",
    "Do you know anything about what kind of breakfast options they have?",
    "Is it conveniently located near nice scenery and a variety of attractions?",
    "Are there rooms spotless and clean?",
    "Can you tell me anything about the staff, such as are they friendly?",
    "Does it have a nice outdoor dining area?",
    "Is it in a convenient and accessible location?",
    "Do they serve alcohol? I could really use some of the stuff.",
    "Is the staff friendly?",
    "Is it possible to get a restaurant that doesn't sell alcohol?",
    "Is the place in a good location?",
    "Is the room spacious enough?",
    "Does The Gandhi serve alcohol?",
    "Does this place have clean bathrooms in it?",
    "How is the decor inside rated?",
    "Do they have good non-alcoholic drink options for my kids?",
    "I'm a germaphobe, are the bathrooms cleaned pretty well?",
    "Are the rooms well-cleaned in between guest stays?",
    "Do they have a friendly and responsive staff?",
    "Do you know if it has great service?",
    "Great, and is that a nice location?",
    "Is their internet reliable enough to work on during the day?",
    "Are large food portions available at Charlie Chan?",
    "Do they have highly rated reviews for the chicken tikka masala?",
    "Do they offer samosas at a great value?",
    "Does it have a nice view?",
    "Generally speaking, how is the service they provide?",
    "Do you know if it has a nice outdoor place for dining?",
    "Does this restaurant have a good outdoor dining area?",
    "I don't want a restaurant with poor service, so can you check their reputation?",
    "Is the location nice?",
    "How stable is the internet connection there?",
    "Does this place have high quality Paella?",
    "How would you describe the decor? I like contemporary interiors, not tacky old-fashioned decor.",
    "Is alcohol served at Shiraz Restaurant?",
    "Does that restaurant have a quality butter chicken dish?",
    "Do they offer big rooms here?",
    "Do they have a good Calzone?",
    "Will one find high quality service at the Nirala?",
    "They offer free wifi there",
    "Do the reviews mention good indoor decorations?",
    "How the atmosphere at Charlie Chan's?  I'd like a pleasant one.",
    "Yes. Restroom hygiene is very important for me. Can you find out if Ashley Hotel has sanitary restrooms?",
    "Are the rooms there cleaned thoroughly?",
    "Does this hotel offer Wi-Fi for guests?",
    "Does this restaurant serve alcohol?",
    "Is it in a good location?",
    "I need a restaurant that serves high quality pizza.",
    "Are the bathrooms dirty?",
    "Is Mill Road City Centre in a good location in town?",
    "Do the reviews mention clean and spotless rooms?",
    "Do you know if it has a nice view?",
    "Does it have a good location?",
    "Do they have good breakfast options?",
    "Does it have a nice and relaxing vibe?",
    "Does this restaurant serve alcohol?",
    "Does the Bridge Guest House have wifi?",
    "Can you confirm if that is a quiet place to stay?",
    "And would la raza happen to have a positive, nice feeling atmosphere as well?",
    "Does this hotel offer wifi services?",
    "Do they have CHICKEN TIKKA MASALA available at a good price?",
    "Does Prezzo offer good service?",
    "Is it well decorated inside?",
    "Do they have clean bathrooms?",
    "How is their service? I want a place with great service.",
    "It is a good value for the money?",
    "Does it have a nice atmosphere?",
    "Is there a nice area for outdoor dining here?",
    "That sounds nice.  Are the rooms clean there?",
    "I require a place with a stable internet connection, would that be available?",
    "Would you happen to know whether Yippee Noodle Bar has nice indoor decor?",
    "Do you know if it has a nice view?",
    "Yes, please, does the Lucky Star have a good value dumplings dish on the menu?",
    "Does this hotel have a calm and quiet environment?",
    "Does this place serve alcohol?",
    "Are the bathrooms clean?",
    "Does the place come with a clean room?",
    "Is the Acorn guest house a good value for the money?",
    "Do they have excellent wifi here?",
    "Is that location known for having high bathroom-cleanliness ratings?",
    "Does it have a welcoming vibe?",
    "Does this guesthouse have a good reputation for its bathroom cleanliness?",
    "Do you know if El Shaddai offers some bang for my buck and isn't overpriced?",
    "Do you know if the Ashley Hotel offers a good value for the price of its rooms?",
    "Is this property a good value?",
    "I love a restaurant with a great view from the dining area; does Riverside Brasserie deliver in the department?",
    "Do they have outdoor seating?",
    "How reliable is the internet service?",
    "Is the Leverton House known to be located in a quiet location?",
    "do they have comfortable beds?",
    "Could you first let me know whether The Cow Pizza Kitchen and Bar offers outdoor seating with comfortable, pleasant surroundings?",
    "How is the Wifi quality at the hotel?",
    "Does the restaurant have a liquor license and a drinks menu?",
    "Do they offer a good breakfast selection in the morning?",
    "Does the table have a nice view?",
    "Does this place have a nice view?",
    "Do they have good breakfast choices?",
    "Are the bathrooms cleaned frequently?",
    "Do they have a fun, welcoming atmosphere?",
    "Is the room large?",
    "Do they serve non alcoholic drinks?",
    "Does the restaurant have large windows where I can see displays of artwork?",
    "Do they have a good selection of non-alcoholic drink options?",
    "Does this restaurant have a well reviewed dosa?",
    "Is this restaurant known for dumplings for a good value?",
    "Is it in a nice location?",
    "Will I be able to get a satisfying breakfast there?",
    "Does that restaurant have a good atmosphere?",
    "Is it located in an area that is preferred by others?",
    "Do you know how spacious the rooms are at the Lovell Lodge?",
    "Is this place highly rated for clean bathrooms?",
    "Are the rooms big?",
    "Is the outdoor dining area nice?",
    "Is the A and B guest house considered to be in a good location?",
    "Does this place have big rooms?",
    "That depends, is the El Shaddai good value for the money I'll be paying?",
    "Do you know if they are well known for their korma?",
    "Is this restaurant in a good location?",
    "Do they have an extensive non-alcoholic drink menu?",
    "Can you please check if the rooms can be very clean when I arrive?",
    "Do they offer eggs over easy?",
    "Do they have good internet there?",
    "Do you know if El Shaddai has sanitized and pristine restrooms?",
    "Only if the bathrooms are clean. Can you let me know?",
    "Are the bathrooms kept tidy?",
    "Does this place have clean bathrooms?",
    "Does it have nice views?",
    "Before you do, can you tell me if the beds there are comfortable?",
    "Do they have a good breakfast spread for foodies?",
    "Do they have comfortable beds?",
    "Do they serve fresh and quality Caprese Salad?",
    "Does it have nice decor inside?",
    "Do they have a large non alcoholic drink menu?",
    "Is it in a decent part of town?",
    "Do they have a non-alcoholic drink menu with many options?",
    "Is the Tom kha kai high quality?",
    "Can you confirm that the rooms at the Acorn Guest House are clean and spotless?",
    "How does it compare in terms of value for money?",
    "I want comfortable only, will this do?",
    "Is the Allenbell a good deal?",
    "Do they have a nice outdoor dining are?",
    "Does Yu Garden have outdoor seating available at their restaurant?",
    "Is the internet connection stable during the day?",
    "Is the staff there friendly?",
    "Do they have nice and relaxing beds?",
    "How is the noise level? I prefer it to be quiet.",
    "Before making the reservation, please find out whether the bathrooms there are kept spotlessly clean.",
    "Are the staff members considered friendly?",
    "Is the waitstaff known for providing high quality service?",
    "Do they have a nice view?",
    "Do they have comfortable beds?",
    "Is it renown for the excellent service of its staff?",
    "How quiet is this hotel?",
    "Do they have a reliable internet connection?",
    "Your bathroom cleaner name?",
    "Is this in a nice location?",
    "Does it have A friendly and responsive staff?",
    "Does it have a modern and fun decor?",
    "I'm craving apple pie. Does Gourmet Burger Kitchen have a highly rated apple pie?",
    "Do any of them have cool outdoor seating?",
    "Which one has a good location?",
    "Is it considered a good value for how much I'd spend on it?",
    "Only if the beds are comfortable. How are they?",
    "Will they give me a large room if I stay there?",
    "Do they offer large food portions?",
    "I'm on a budget so I need to verify that the rooms are a good value?",
    "Can I get a big room there?",
    "Does Kirkwood House have big rooms?",
    "Does the Hobson house have comfortable beds?",
    "It must have a comfortable bed. Do they?",
    "Do they have really peaceful and quiet rooms there where I can't hear any noises?"
]